Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: mix(float a,float b,float alpha) Blend of a and b according to alpha.
ar: mix(float a,float b,float alpha) امزُج a و b وفقًا لـ alpha.
ca: mix(float a,float b,float alpha) Barreja d'«a» i «b» segons alfa.
eo: mix(float a,float b,float alfa) Miksaĵo de a kaj b laŭ alfa.
es: mix(float a,float b,float alfa) Mezcla de a y b según alfa.
fr: mix (float a, float b, float alpha) Mélange de a et b selon alpha.
he: mix(שבר עשרוני a,שבר עשרוני b,שבר עשרוני alpha) ערבוב של a ו־b לפי alpha.
it: mix(float a,float b,float alpha) Miscela di a e b in base ad alfa.
nl: mix(float a,float b,float alpha) mengen van a en b volgens alpha.
pl: mix(float a,float b,float alpha) Zmieszanie "a" oraz "b" wg alfy.
pt_br: mix(float a,float b,float alpha) Mistura de a e b de acordo com alfa.
sl: mix(float a,float b,float alpha) Mešanica a in b glede na alpha.
sv: mix(float a,float b,float alpha) Blanda a och b enligt alpha.
tr: mix(float a,float b,float alpha) Alfaya göre a ve b'nin harmanı.
uk: mix(float a,float b,float alpha) Змішує a і b відповідно до alpha.
zh_cn: mix(float a,float b,float alpha) 根据 alpha (透明度通道) 混合 a 和 b
zh_tw: mix(float a,float b,float alpha) 根據 alpha 混合 a 和 b。

# builtin|
source: color hsi(color x, float h, float s, float i, float map=1) The hsi function shifts the hue by h (in degrees) and scales the saturation and intensity by s and i respectively.&nbsp; A map may be supplied which will control the shift - the full shift will happen when the map is one and no shift will happen when the map is zero.&nbsp; The shift will be scaled back for values between zero and one.
ar: color hsi(color x, float h, float s, float i, float map=1) دالة hsi تزيح الصبغة بمقدار h (بالدرجات) وتغير مقياس الإشباع والشدة بمقدار s و i على التوالي.&nbsp; قد تورِّد خريطة تتحكم في الإزاحة - الإزاحة الكاملة تحدث عندما تكون الخريطة واحد ولا تحدث إزاحة عندما تكون الخريطة صفر.&nbsp; الإزاحة تُعاد تقليصها للقيم التي بين الصفر والواحد.
ca: color hsi(color x, float h, float s, float i, float map=1) La funció «hsi» desplaça el to per «h» (en graus) i escala la saturació i la intensitat per «s» i «i» respectivament.&nbsp; Es pot proporcionar un mapa que controlarà el desplaçament: tot el desplaçament succeirà quan el mapa sigui u, i no succeirà cap canvi quan el mapa sigui zero.&nbsp; El desplaçament s'escalarà a menys per als valors entre zero i u.
eo: color hsi(color x, float h, float s, float i, float mapo=1) La hsi-funkcio ŝanĝas la nuancon je h (en gradoj) kaj skalas la saturiĝon kaj intensecon je s kaj i respektive.&nbsp; Mapo povas esti liverita, kiu kontrolos la movon - la plena movo okazos kiam la mapo estas unu kaj neniu movo okazos kiam la mapo estas nulo. La movo estos malgrandigita por valoroj inter nulo kaj unu.
es: color hsi(color x, float h, float s, float i, float mapa=1) La función «hsi» desplaza el matiz «h» grados y escala la saturación y la intensidad «s» e «i», respectivamente. &nbsp; Se puede proporcionar un mapa para controlar el desplazamiento (tendrá lugar un desplazamiento completo cuando el mapa es uno, mientras que no habrá desplazamiento cuando el mapa es cero.&nbsp; El desplazamiento se escalará hacia atrás para los valores entre cero y uno.
fr: color hsi (color x, float h, float s, float i, float map=1) La fonction « hsi » décale la tonalité chromatique par h (en degrés) et dimensionne la saturation et l'intensité lumineuse respectivement par s et i. Une carte peut être fournie contrôlant le décalage - le décalage complet se produira quand la carte est unique et qu'aucun décalage ne se produira quand la carte est à zéro. Le décalage sera dimensionné en retour pour des valeurs entre 0 et 1.
it: color hsi(color x, float h, float s, float i, float map=1) La funzione hsi sposta la tonalità di h (in gradi) e scala la saturazione e l'intensità di s e i rispettivamente.&nbsp;Potrebbe essere fornita una mappa che controllerà lo spostamento - lo spostamento completo avverrà quando la mappa è una e nessuno spostamento si verifica quando la mappa è zero.&nbsp;Lo spostamento sarà ridotto per valori compresi tra zero e uno.
nl: color hsi(color x, float h, float s, float i, float map=1) de hsi function verschuift kleur met h (in graden) en schaalt de verzadiging en intensiteit met s en i. &nbsp; Met optioneel map kan de verschuiving worden geregeld - volledig wanneer map 1 is, en geen verandering wanneer map 0 is.&nbsp; De verschuiving wordt voor waarden tussen 0 en 1 terug geschaald.
pl: color hsi(color x, float h, float s, float i, float map=1) Funkcja hsi przesuwa odcień o wartość "h" (w stopniach) i skaluje nasycenie oraz natężenie odpowiednio o wartość "s" oraz "i" .&nbsp; Można podać mapę, która będzie sterować przesunięciem - pełne przesunięcie nastąpi, gdy mapa jest równa jeden, a brak przesunięcia nastąpi gdy mapa jest równa zero.&nbsp; Przesunięcie powróci do swojej pierwotnej wartości pomiędzy zero i jeden.
pt_br: color hsi(color x, float h, float s, float i, float map=1) A função hsi muda a matiz em h (em graus) e dimensiona a saturação e a intensidade por s e i respectivamente.&nbsp; Um mapa pode ser fornecido para controlar a mudança - a mudança completa acontecerá quando o mapa for um e nenhuma mudança acontecerá quando o mapa é zero.&nbsp; A mudança será reduzida para valores entre zero e um.
sl: color hsi(color x, float h, float s, float i, float map=1) Funkcija hsi premakne odtenek za h (v stopinjah) in nasičenost in intenzivnost prilagodi za s in i. Na voljo je še preslikava, ki bo nadzorovala premik - popoln premik se bo zgodil, ko bo preslikava ena in noben premik ne bo zgodil, ko je preslikava nič. Premik bo pomanjšan za vrednosti med nič in ena.
sv: color hsi(color x, float h, float s, float i, float map=1) Funktionen hsi ändrar färgtonen med h (i grader) och skalar färgmättnaden och intensiteten med s och i.&nbsp; En avbildning kan anges som bestämmer skiftningen - fullständig skiftning sker när avbildningen är ett och igen skiftning sker när avbildningen är noll.&nbsp; Skiftningen skalas ner för värden mellan noll och ett.
tr: color hsi(color x, float h, float s, float i, float map=1) hsi işlevi, renk tonunu h kadar (derece türünden) kaydırır ve doygunluğu ve yoğunluğu sırasıyla s ve i kadar ölçekler.&nbsp; Kaydırmayı denetleyecek bir eşlem verilebilir - eşlem 1 iken tam kaydırma, eşlem 0 iken hiçbir kaydırma yapılmaz.&nbsp; Sıfır ve bir arasındaki değerler için, kaydırma geri ölçeklendirilecektir.
uk: color hsi(color x, float h, float s, float i, float map=1) Функція hsi зсуває відтінок на ``h`` (у градусах) і масштабує насиченість та інтенсивність на ``s`` і ``i``, відповідно. Функції може бути передано значення map, яке контролюватиме зсув — повний зсув відбуватиметься, якщо map дорівнює одиниці. Якщо ж значенням map буде нуль, зсув не відбуватиметься. Зсув буде масштабовано до значень між нулем та одиницею.
zh_cn: color hsi(color x, float h, float s, float i, float map=1) hsi 函数按 h (单位为度) 对色相进行 shift (偏移) 按 s 缩放饱和度，按 i 缩放亮度 可以提供 map (映射值) 来控制偏移量 map 为 1 时色相旋转一周，map 为 0 时色相不旋转 map 在 0 到 1 之间时，偏移量将等比例缩放
zh_tw: color hsi(color x, float h, float s, float i, float map=1) 將色相 (hue) 偏移 h 度，同時將飽和度及強度分別乘以 s 及 i。 map 可以控制偏移的幅度——map 為 1 時作全幅度偏移， 而 map 為 0 時則不作偏移，在 0 和 1 之間時則按比例偏移。

# builtin|
source: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) The midhsi function is just like the hsi function except that the control map is centered around the mid point (value of 0.5) and can scale the shift in both directions.
ar: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) دالة midhsi هي كدالة hsi تمامًا باستثناء أن خريطة التحكم تتمركز حول نقطة المنتصف (قيمة 0.5) ويمكنها تقليم التحريف في كلا الاتجاهين.
ca: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) La funció «midhsi» és com la funció «hsi», excepte que el mapa de control està centrat al voltant del punt mitjà (valor de 0,5) i pot escalar el desplaçament en ambdues direccions.
eo: color midhsi (color x, float h, float s, float i, float mapo, float falloff=1, int interp=0) La midhsi-funkcio estas same kiel la hsi-funkcio krom ke la kontrolmapo estas centrita ĉirkaŭ la meza punkto (valoro de 0,5) kaj povas grimpi la movon en ambaŭ direktoj.
es: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) La función «midhsi» es similar a la función «hsi», excepto que el mapa de control está centrado alrededor del punto medio (valor de 0.5) y puede escalar el desplazamiento en ambas direcciones.
fr: color midhsi (color x, float h, float s, float i, float map, float falloff=1, int interp=0) La fonction « midhsi » est similaire à la fonction « hsi » excepté que la carte de contrôle est centré autour du point médian (valeur de 0.5) et peut dimensionner le positionnement dans les deux directions.
it: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) La funzione midhsi è proprio come la funzione hsi tranne che la mappa di controllo è centrata attorno al punto medio (valore 0,5) e può scalare lo spostamento in entrambe le direzioni.
nl: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) midhsi is gelijk aan de functie hsi behalve dat de besturing map werkt rond het midden (waarde 0.5) en de verschuiving in beide richtingen kan schalen.
pl: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) Funkcja midhsi jest taka sama jak hsi z wyjątkiem, że mapa sterująca jest wyśrodkowana względem punktu środkowego (wartość 0.5) i może skalować przesunięcie w obu kierunkach.
pt_br: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) A função midhsi é como a função hsi, exceto que o mapa de controle é centralizado em torno do ponto médio (valor de 0.5) e pode escalar a mudança em ambas as direções.
sl: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) Funkcija midhsi je podobna funkciji hsi, razen, da je kontrolna preslikava centrirana okoli srednje točke (vrednost 0,5) in lahko spreminja premik v obe smeri.
sv: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) Funktionen midhsi är precis som funktionen hsi utom att kontrollavbildningen är centrerad omkring mittpunkten (värdet 0,5) och kan skala skiftningen i båda riktningar.
tr: color midhsi(color x, float h, float s, float i, float eşlem, float düşme=1, int aradeğerlenen=0) midhsi işlevi, hsi işlevinin aynısıdır; yalnızca denetim eşlemi orta nokta çevresinde merkezlenmiştir (0,5'in değeri) ve kaydırmayı her iki yönde de ölçeklendirebilir.
uk: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) Функція midhsi подібна до функції hsi, але керівне відображення центровано навколо середньої точки (значення 0.5) і може масштабувати зсув у обох напрямках.
zh_cn: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) midhsi 函数和 hsi 函数类似 不同之处在于它的控制映射按中间点对齐 (数值为 0.5) 可以向两个方向按比例缩放色相偏移量
zh_tw: color midhsi(color x, float h, float s, float i, float map, float falloff=1, int interp=0) 與 hsi 函數相似，不過 midhsi 參數 map 的中間點為 0.5， 可循兩個方向控制偏移的比例。

# builtin|
source: color rgbtohsl(color rgb) RGB to HSL color space conversion. HSL is Hue, Saturation, Lightness (all in range [0..1] ) These functions have also been extended to support rgb and hsl values outside of the range [0..1] in a reasonable way.&nbsp; For any rgb or hsl value (except for negative s values), the conversion is well-defined and reversible.
ar: color rgbtohsl(color rgb) تحويل مساحة اللون RGB إلى HSL. HSL هي Hue، Saturation، Lightness (الكل في النطاق [0..1] ) ُوُسِّعَت هذه الدوال أيضًا لدعم قيم rgb و hsl خارج النطاق [0..1] بطريقة معقولة. لأي قيمة rgb أو hsl (باستثناء قيم s السالبة)، يكون التحويل محددًا جيدًا وقابلاً للعكس.
ca: color rgbtohsl(color rgb) Conversió des de l'espai de color RGB a HSL. El HSL és To, Saturació i Claredat (tots en l'interval [0..1]). Aquestes funcions també s'han ampliat per a admetre valors RGB i HSL fora de l'interval [0..1] de manera raonable.&nbsp; Per a qualsevol valor RGB o HSL (excepte per als valors «s» negatius), la conversió estarà ben definida i serà reversible.
eo: color rgbtohsl(color rgb) RGB al HSL-kolorspaco-konverto. HSL estas Nuanco, Saturo, Malpezeco (ĉio en intervalo [0..1] ) Ĉi tiuj funkcioj ankaŭ estis etenditaj por subteni rgb kaj hsl-valorojn ekstere de la gamo [0..1] en racia maniero.&nbsp; Por iu ajn rgb aŭ hsl-valoro (krom negativaj s-valoroj), la konvertiĝo estas bone difinita kaj reigebla.
es: color rgbtohsl(color rgb) Conversión de espacio de color RGB a HSL. HSL significa «matiz», «saturación» y «luminosidad» (todos en el intervalo [0..1]). Estas funciones también se han extendido para permitir valores RGB y HSL fuera del intervalo [0..1] de un modo razonable.&nbsp; La conversión está bien definida y es reversible para cualquier valor RGB o HSL (excepto para valores negativos de «s»).
fr: color rgbtohsl (color rgb) Conversion de l'espace colorimétrique de RGB vers HSL. HSL est la tonalité chromatique « Hue », la saturation « Saturation » , l'intensité lumineuse « Lightness » (tout entre [0..1] ) Ces fonctions ont aussi été étendues pour la prise en charge des valeurs « rgb » et « hsl » en dehors de l'intervalle [0..1] de façon raisonnable. Pour toute valeur « rgb » et « hsl » (excepté les valeurs négatives), la conversion est bien définie et réversible.
he: color rgbtohsl(color rgb) המרה ממרחב צבע RGB ל־HSL. HSL זה גוון, רוויה ובהירות (כולם בטווח של [0..1] ) הפונקציות האלו הורחבו כדי לתמוך בערכי rgb ו־hsl מחוץ לטווח של [0..1] בצורה הגיונית.&nbsp; לכל ערך rgb או hsl (למעט ערכי s שליליים), ההמרה מוגדרת היטב והפיכה.
it: color rgbtohsl(color rgb) Conversione dello spazio dei colori da RGB a HSL. HSL sta per Tonalità (Hue), Saturazione, Luminosità (tutto nell'intervallo [0..1]) Queste funzioni sono state estese anche per supportare i valori rgb e hsl al di fuori dell'intervallo [0..1] in modo ragionevole.&nbsp;Per qualsiasi valore rgb o hsl (ad eccezione dei valori s negativi), la conversione è ben definita e reversibile.
nl: color rgbtohsl(color rgb) Omzetting kleurruimten van RGB naar HSL. HSL is Hue (kleur), Saturation (verzadiging), Lightness (lichtheid) (alles in bereik [0..1] ) Deze functies zijn ook op redelijke manier uitgebreid voor rgb- en hsl-waarden buiten het bereik [0..1].&nbsp; Voor elke rgb- of hsl-waarde (behalve negatieve getallen), is de omzetting goed gedefinieerd en omkeerbaar.
pl: color rgbtohsl(color rgb) Przekształcenie przestrzeni barw RGB na HSL. HSL to Hue (z ang. odcień), Saturation (z ang. nasycenie), Lightness (z ang. jasność) (wszystkie w zakresie[0..1] ) Funkcje te zostały także rozszerzone o obsługę wartości rgb oraz hsl spoza zakresu [0..1] w sensowny sposób.&nbsp; Dla każdej wartości rgb czy hsl (poza ujemnymi wartościami "s"), przekształcenie jest jednoznacznie określone i odwracalne.
pt_br: color rgbtohsl(color rgb) Conversão de espaço de cores RGB em HSL. HSL significa Matiz, Saturação, Luminosidade (todos no intervalo [0..1]) Essas funções também foram estendidas para oferecer suporte aos valores RGB e HSL fora do intervalo [0..1] de uma forma razoável. &nbsp;Para qualquer valor RGB ou HSL (exceto para valores s negativos), a conversão é bem definida e reversível.
sl: color rgbtohsl(color rgb) Pretvorba barvnega prostora RGB v HSL. HSL (angl. Hue, Saturation, Lightness) je odtenek, nasičenost, osvetljenost (vse v intervalu [0..1]). Te funkcije so bile razširjene tudi tako, da podpirajo vrednosti rgb in hsl zunaj obsega [0..1] na razumen način.&nbsp; Za katerokoli vrednost rgb ali hsl (razen negativnih vrednosti s) je pretvorba dobro definirana in reverzibilna.
sv: color rgbtohsl(color rgb) RGB till HSL färgrymdskonvertering. HSL är färgton, färgmättnad, ljushet (alla i intervallet [0..1] ) Funktionerna har också utökats för att stödja rgb- och hsi-värden utanför intervallet [0..1] på ett rimligt sätt.&nbsp; För alla rgb- eller hsl-värden (utom för negativa s-värden), är konverteringen väldefinierad och reversibel.
tr: color rgbtohsl(color rgb) RGB'den HSL'ye renk uzayı dönüşümü. HSL, sırasıyla renk tonu, doygunluk ve aydınlık demektir (tümü [0...1] eriminde Bu işlevler, RGB ve HSL değerlerini, [0...1] erimi dışında da uygulanabilir bir biçimde desteklemeleri için genişletilmiştir.&nbsp; Herhangi bir RGB veya HSL değeri için (negatif s değerleri dışında), dönüştürme düzgünce tanımlanmıştır ve geri döndürülebilir.
uk: color rgbtohsl(color rgb) Перетворення з простору кольорів RGB до простору кольорів HSL. Колір у HSL визначається значеннями відтінку (Hue), насиченості (Saturation), освітленості (Lightness) (усі в діапазоні [0, 1]). Ці функції також розширено для підтримки значень RGB і HSL поза діапазоном [0, 1] у природний спосіб. Для будь-якого значення RGB або HSL (окрім від'ємних значень) перетворення є коректним і оборотним.
zh_cn: color rgbtohsl(color rgb) RGB 到 HSL 色彩空间转换 HSL 代表 Hue (色相)、Saturation (饱和度)、Lightness (亮度) 这些数值的范围全部为 [0..1] 可扩展至支持在合理范围内超出 [0..1] 的 RGB 和 HSL 数值 对于任意 RGB 或者 HSL 数值 (负值除外) 此转换操作是定义明确且可逆的
zh_tw: color rgbtohsl(color rgb) 轉換 RGB 色彩空間至 HSL。 HSL 為色相、飽和度、亮度 (範圍為 [0..1] ) 這些函數已被擴展至支援 [0..1] 範圍以外的 RGB 及 HSL 值。 任何 RGB 或 HSL 值 (負數的 s 值除外) 都有明確的定義，可逆向轉換。

# builtin|
source: color hsltorgb(color hsl) HSL to RGB color space conversion. HSL is Hue, Saturation, Lightness (all in range [0..1] ) These functions have also been extended to support rgb and hsl values outside of the range [0..1] in a reasonable way.&nbsp; For any rgb or hsl value (except for negative s values), the conversion is well-defined and reversible.
ar: color hsltorgb(color hsl) تحويل مساحة اللون HSL إلى RGB. HSL هي Hue، Saturation، Lightness (الكل في النطاق [0..1] ) ُوُسِّعَت هذه الدوال أيضًا لدعم قيم rgb و hsl خارج النطاق [0..1] بطريقة معقولة. لأي قيمة rgb أو hsl (باستثناء قيم s السالبة)، يكون التحويل محددًا جيدًا وقابلاً للعكس.
ca: color hsltorgb(color hsl) Conversió des de l'espai de color HSL a RGB. El HSL és To, Saturació i Claredat (tots en l'interval [0..1]). Aquestes funcions també s'han ampliat per a admetre valors RGB i HSL fora de l'interval [0..1] de manera raonable.&nbsp; Per a qualsevol valor RGB o HSL (excepte per als valors «s» negatius), la conversió estarà ben definida i serà reversible.
eo: color hsltorgb(color hsl) HSL al RGB-kolorspaco-konverto. HSL estas Nuanco, Saturo, Malpezeco (ĉio en intervalo [0..1] ) Ĉi tiuj funkcioj ankaŭ estis etenditaj por subteni rgb kaj hsl-valorojn e ekstere de la gamo [0..1] en racia maniero.&nbsp; Por iu ajn rgb aŭ hsl-valoro (krom negativaj s-valoroj), la konvertiĝo estas bone difinita kaj reigebla.
es: color hsltorgb(color hsl) Conversión de espacio de color HSL a RGB. HSL significa «matiz», «saturación» y «luminosidad» (todos en el intervalo [0..1]). Estas funciones también se han extendido para permitir valores RGB y HSL fuera del intervalo [0..1] de un modo razonable.&nbsp; La conversión está bien definida y es reversible para cualquier valor RGB o HSL (excepto para valores negativos de «s»).
fr: color hsltorgb (color hsl) Conversion de l'espace colorimétrique de HSL vers RGB. HSL est la tonalité chromatique « Hue », la saturation « Saturation », l'intensité lumineuse « Lightness » (tout entre [0..1] ) Ces fonctions ont aussi été étendues pour la prise en charge des valeurs « rgb » et « hsl » en dehors de l'intervalle [0..1] de façon raisonnable. Pour toute valeur « rgb » et « hsl » (excepté les valeurs négatives), la conversion est bien définie et réversible.
he: color hsltorgb(color hsl) המרה ממרחב צבע HSL ל־RGB. HSL זה גוון, רוויה ובהירות (כולם בטווח של [0..1] ) הפונקציות האלו הורחבו כדי לתמוך בערכי rgb ו־hsl מחוץ לטווח של [0..1] בצורה הגיונית.&nbsp; לכל ערך rgb או hsl (למעט ערכי s שליליים), ההמרה מוגדרת היטב והפיכה.
it: color hsltorgb(color hsl) Conversione dello spazio dei colori da HSL a RGB. HSL sta per Tonalità (Hue), Saturazione, Luminosità (tutto nell'intervallo [0..1]) Queste funzioni sono state estese anche per supportare i valori rgb e hsl al di fuori dell'intervallo [0..1] in modo ragionevole.&nbsp;Per qualsiasi valore rgb o hsl (ad eccezione dei valori s negativi), la conversione è ben definita e reversibile.
nl: color hsltorgb(color hsl) omzetting kleurruimten van HSL naar RGB. HSL is Hue (kleur), Saturation (verzadiging), Lightness (lichtheid) (alles in bereik [0..1] ) Deze functies zijn ook op redelijke manier uitgebreid voor rgb- en hsl-waarden buiten het bereik [0..1].&nbsp; Voor elke rgb- of hsl-waarde (behalve negatieve getallen), is de omzetting goed gedefinieerd en omkeerbaar.
pl: color hsltorgb(color hsl) Przekształcenie przestrzeni barw HSL na RGB. HSL to Hue (z ang. odcień), Saturation (z ang. nasycenie), Lightness (z ang. jasność) (wszystkie w zakresie[0..1] ) Funkcje te zostały także rozszerzone o obsługę wartości rgb oraz hsl spoza zakresu [0..1] w sensowny sposób.&nbsp; Dla każdej wartości rgb czy hsl (poza ujemnymi wartościami "s"), przekształcenie jest jednoznacznie określone i odwracalne.
pt_br: color hsltorgb(color hsl) Conversão de espaço de cor HSL em RGB. HSL significa Matiz, Saturação, Luminosidade (todos no intervalo [0..1]) Essas funções também foram estendidas para oferecer suporte aos valores RGB e HSL fora do intervalo [0..1] de uma forma razoável. &nbsp; Para qualquer valor RGB ou HSL (exceto para valores s negativos), a conversão é bem definida e reversível.
sl: color hsltorgb(color hsl) Pretvorba barvnega prostora HSL v RGB. HSL (angl. Hue, Saturation, Lightness) je odtenek, nasičenost, osvetljenost (vse v intervalu [0..1]). Te funkcije so bile razširjene tudi tako, da podpirajo vrednosti rgb in hsl zunaj obsega [0..1] na razumen način.&nbsp; Za katerokoli vrednost rgb ali hsl (razen negativnih vrednosti s) je pretvorba dobro definirana in reverzibilna.
sv: color hsltorgb(color hsl) HSL till RGB färgrymdskonvertering. HSL är färgton, färgmättnad, ljushet (alla i intervallet [0..1] ) Funktionerna har också utökats för att stödja rgb- och hsi-värden utanför intervallet [0..1] på ett rimligt sätt.&nbsp; För alla rgb- eller hsl-värden (utom för negativa s-värden), är konverteringen väldefinierad och reversibel.
tr: color hsltorgb(color hsl) HSL'den RGB'ye renk uzayı dönüşümü. HSL, sırasıyla renk tonu, doygunluk ve aydınlık demektir (tümü [0...1] eriminde Bu işlevler, RGB ve HSL değerlerini, [0...1] erimi dışında da uygulanabilir bir biçimde desteklemeleri için genişletilmiştir.&nbsp; Herhangi bir RGB veya HSL değeri için (negatif s değerleri dışında), dönüştürme düzgünce tanımlanmıştır ve geri döndürülebilir.
uk: color hsltorgb(color hsl) Перетворення з простору кольорів HSL до простору кольорів RGB. Колір у HSL визначається значеннями відтінку (Hue), насиченості (Saturation), освітленості (Lightness) (усі в діапазоні [0, 1]). Ці функції також розширено для підтримки значень RGB і HSL поза діапазоном [0, 1] у природний спосіб. Для будь-якого значення RGB або HSL (окрім від'ємних значень) перетворення є коректним і оборотним.
zh_cn: color hsltorgb(color hsl) HSL 到 RGB 色彩空间转换 HSL 代表 Hue (色相)、Saturation (饱和度)、Lightness (亮度) 这些数值的范围全部为 [0, 1] 可扩展至支持在合理范围内超出 [0, 1] 的 RGB 和 HSL 数值 对于任意 RGB 或者 HSL 数值 (负值除外) 此转换操作是定义明确且可逆的
zh_tw: color hsltorgb(color hsl) 轉換 HSL 色彩空間至 RGB。 HSL 為色相、飽和度、亮度 (範圍為 [0..1] ) 這些函數已被擴展至支援 [0..1] 範圍以外的 RGB 及 HSL 值。 任何 RGB 或 HSL 值 (負數的 s 值除外) 都有明確的定義，可逆向轉換。
