Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: color cellnoise(vector v) cellnoise generates a field of constant colored cubes based on the integer location. This is the same as the prman cellnoise function.
ar: color cellnoise(vector v) تولِّد cellnoise حقلاً من المكعبات ذات الألوان الثابتة بناءً على الموقع الصحيح. هذه هي نفس دالة prman cellnoise.
ca: color cellnoise(vector v) «cellnoise» genera un camp de cubs amb colors constants en funció de la ubicació del nombre enter. És el mateix que la funció «cellnoise» de PRMan.
eo: color cellnoise(vector v) cellnoise generas kampon de konstantaj koloraj kuboj bazitaj sur la entjerloko. Ĉi tio estas la sama kiel la prman cellnoise-funkcio.
es: color cellnoise(vector v) «cellnoise» genera un campo constante de cubos de color basado en la posición entera. Es idéntica a la función «cellnoise» de PRMan.
fr: float cellnoise (vector v) La fonction « cellnoise » génère un ensemble de cubes constants et colorés selon un emplacement entier. Elle est identique à la fonction « prman » pour le bruit dans les cellules.
he: color cellnoise(וקטור v) רעש תא מייצר שדה של קוביות בצבעים קבועים שמבוססים על מקום המספר השלם. זהה לפונקציית רעש תא של prman ‏(RenderMan מבית Pixar).
it: color cellnoise(vector v) cellnoise genera un campo di cubi colorati costanti in base alla posizione dell'intero. È uguale alla funzione prman cellnoise.
nl: color cellnoise(vector v) cellnoise genereert een veld van constant gekleurde kubussen op basis van de gehele locatie. Dit is gelijk aan de prman cellnoise functie.
pl: color cellnoise(vector v) cellnoise tworzy pole sześcianów o stałej barwie na podstawie położenia liczb całkowitych. Jest to to samo co funkcja szumu komórkowego prman.
pt_br: color cellnoise(vector v) cellnoise gera um campo de cubos coloridos constantes com base no número inteiro da localização. Este é o mesmo que a função cellnoise do prman.
sl: color cellnoise(vector v) cellnoise ustvari polje konstantnih barvnih kock na podlagi lokacije števila. To je enako kot funkcija prman cellnoise.
sv: color cellnoise(vector v) cellnoise genererar ett fält av konstantfärgade kuber baserade på heltaletsplats. Det är samma sak som prman funktionen cellnoise.
tr: color cellnoise(vector v) cellnoise, tamsayı konumuna göre sabit bir renkli küpler alanı üretir. Bu, prman cellnoise işlevi ile aynıdır.
uk: color cellnoise(vector v) cellnoise створює поле кубів розфарбованих сталим кольором на основі цілочисельного розташування вершин. Ця функція збігається із функцією cellnoise prman.
zh_cn: color cellnoise(vector v) cellnoise 会在一片区域中依据整数位置生成一片带有恒定颜色的方块 它和 PRMan cellnoise function 功能一致
zh_tw: color cellnoise(vector v) 產生一系列基於整數位置固定上色的立方體。 與 prman cellnoise 函數相同。

# builtin|
source: float pnoise ( vector v, vector period ) periodic noise
ar: float pnoise ( vector v, vector period ) ضوضاء دورية
ca: float pnoise ( vector v, vector period ) Soroll periòdic
eo: float pnoise ( vector v, vector periodo ) perioda bruo
es: float pnoise ( vector v, vector periodo ) ruido periódico
fr: float pnoise (vector v, vector period) bruit périodique
he: float pnoise ( וקטור v, וקטור תקופה ) רעש לאורך תקופה
it: float pnoise ( vector v, vector period ) rumore periodico
nl: float pnoise ( vector v, vector periode ) periodieke ruis
pl: float pnoise ( vector v, vector okres ) szum okresowy
pt_br: float pnoise ( vector v, vector period ) ruído periódico
sl: float pnoise ( vector v, vector period ) periodični šum
sv: float pnoise ( vector v, vector period ) periodiskt brus
tr: float pnoise(vector v, vector periyot) Periyodik gürültü
uk: float pnoise ( vector v, vector період ) періодичний шум
zh_cn: float pnoise ( vector v, vector period ) 输出周期噪声
zh_tw: float pnoise ( vector v, vector period ) 週期函數雜訊

# builtin|
source: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi is a cellular noise pattern. It is a jittered variant of cellnoise.
ar: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi هو نمط ضوضاء خلوي. إنه نوع مُرَتَّعِش من cellnoise.
ca: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) «voronoi» és un patró de soroll cel·lular. És una variant nerviosa de «cellnoise».
eo: float voronoi(vector v, int tipo=1, float jitter=0.5, float fbmScale=0, int fbmOctaves=4, float fbmLacunarity=2, float fbmGain=.5) voronoi estas ĉela brua ŝablono. Ĝi estas ŝancelita varianto de ĉelbruo.
es: float voronoi(vector v, int tipo=1,float agitación=0.5, float fbmEscala=0, int fbmOctavas=4,float fbmLagunaridad=2, float fbmGanancia=.5) «voronoi» es un patrón de ruido celular. Es una variante de «cellnoise» con agitación.
fr: float voronoi (vector v, int type=1, float jitter=0.5, float fbmScale=0, int fbmOctaves=4, float fbmLacunarity=2, float fbmGain=0.5) « Voronoi » est un profil de bruit cellulaire. C'est une variante instable de la fonction « cellnoise ».
he: float voronoi(וקטור v, מספר שלם type=1,שבר עשרוני jitter=0.5, שבר עשרוני fbmScale=0, מספר שלם fbmOctaves=4,שבר עשרוני fbmLacunarity=2, שבר עשרוני fbmGain=.5) וורונוי היא תבנית רעש תאית. זה הגוון מפוזר של רעש תאי (cellnoise).
it: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi è un modello di rumore cellulare. È una variante con jitter di cellnoise.
nl: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunariteit=2, float fbmGain=.5) voronoi is een cellulair ruispatroon. Het is een springerige variant van cellnoise.
pl: float voronoi(vector v, int rodzaj=1,float postrzępienie=0.5, float fbmSkala=0, int fbmOktawy=4,float fbmLakunarność=2, float fbmWzmocnienie=.5) voronoi jest komórkowym wzorcem szumu. Jest postrzępioną odmianą cellnoise.
pt_br: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi é um padrão de ruído celular. É uma variante instável do cellnoise.
sl: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi je celični vzorec šumov. To je vzburjena različica celičnega šuma.
sv: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi är ett cellulärt brusmönster. Det är en gittervariant av cellnoise.
tr: float voronoi(vector v, int tür=1, float titreşim=0,5, float fbmÖlçeği=0, int fbmOktavları=4, float fbmEksikliği=2, float fbmKazancı=,5) voronoi, hücresel bir gürültü desenidir. cellnoise'in titreşimli bir varyantıdır.
uk: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) повертає стільниковий шумовий візерунок. Це варіант cellnoise із джитером.
zh_cn: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi 是一种蜂窝状噪声图案，它是 cellnoise 的抖动变体
zh_tw: float voronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) 巢狀雜訊圖案，為 cellnoise 經抖動後的變化體。

# builtin|
source: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) returns color in cellular pattern. It is a jittered variant of cellnoise.
ar: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) يعود اللون بنمط خلوي. إنه نوع مُرَتَّعِش من cellnoise.
ca: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) Retorna el color en un patró cel·lular. És una variant nerviosa de «cellnoise».
eo: color cvoronoi(vector v, int tipo=1, float jitter=0.5, float fbmScale=0, int fbmOctaves=4, float fbmLacunarity=2, float fbmGain=.5) redonas koloron en ĉela ŝablono. Ĝi estas ŝancelita varianto de ĉelbruo.
es: color cvoronoi(vector v, int tipo=1,float agitación=0.5, float fbmEscala=0, int fbmOctavas=4,float fbmLagunaridad=2, float fbmGanancia=.5) Devuelve el color de un patrón celular. Es una variante de «cellnoise» con agitación.
fr: color cvoronoi (vector v, int type=1, float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=0.5) retourne une couleur dans un profil de cellules. C'est une variante instable de la fonction « cellnoise ».
he: color cvoronoi(וקטור v, מספר שלם type=1,שבר עשרוני jitter=0.5, שבר עשרוני fbmScale=0, מספר שלם fbmOctaves=4,שבר עשרוני fbmLacunarity=2, שבר עשרוני fbmGain=.5) מחזירה צבע בתבנית תאית. זה הגוון מפוזר של רעש תאי (cellnoise).
it: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) restituisce il colore nel modello cellulare. È una variante con jitter di cellnoise.
nl: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunariteit=2, float fbmGain=.5) geeft kleur terug in cellulair patroon. Het is een springerige variant van cellnoise.
pl: color cvoronoi(vector v, int rodzaj=1,float postrzępienie=0.5, float fbmSkala=0, int fbmOktawy=4,float fbmLakunarność=2, float fbmWzmocnienie=.5) zwraca barwę we wzorcu komórkowym. Jest postrzępioną odmianą cellnoise.
pt_br: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) retorna a cor no padrão celular. É uma variante instável do ruído da célula.
sl: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) vrne barvo v celičnem vzorcu. To je vzburjena različica celičnega šuma.
sv: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) returnerar färg i ett cellulärt mönster. Det är en gittervariant av cellnoise.
tr: color cvoronoi(vector v, int tür=1,float titreşim=0,5, float gbmÖlçeği=0, int fbmOktavları=4, float fbmEksikliği=2, float fbmKazancı=,5) Bir hücresel desen olarak renk döndürür. cellnoise'in titreşimli bir varyantıdır.
uk: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) повертає колір у стільниковому візерунку. Це варіант cellnoise із джитером.
zh_cn: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) 给蜂窝图案的每一格返回一种随机颜色，它是 cellnoise 的抖动变体
zh_tw: color cvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) 傳回巢狀雜訊圖案的色彩，為 cellnoise 經抖動後的變化體。

# builtin|
source: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) returns center of voronoi cell.
ar: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) يعود مركز خلية voronoi.
ca: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) Retorna el centre de la cel·la «voronoi».
eo: color pvoronoi(vector v, int tipo=1, float jitter=0.5, float fbmScale=0, int fbmOctaves=4, float fbmLacunarity=2, float fbmGain=.5) revenas centron de voronoi-ĉelo.
es: color pvoronoi(vector v, int tipo=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) devuelve el centro de la celda de Voronói.
fr: color pvoronoi(vector v, int type=1, float jitter=0.5, float fbmScale=0, int fbmOctaves=4, float fbmLacunarity=2, float fbmGain=0.5) retourne la cellule de Voronoi.
he: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) מחזירה את מרכז תא וורונוי.
it: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) restituisce il centro della cellula voronoi.
nl: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunariteit=2, float fbmGain=.5) geeft centrum terug van voronoi cel.
pl: color pvoronoi(vector v, int rodzaj=1,float postrzępienie=0.5, float fbmSkala=0, int fbmOktawy=4,float fbmLakunarność=2, float fbmWzmocnienie=.5) zwraca środek komórki voronoi.
pt_br: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) retorna o centro da célula de voronoi.
sl: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) vrne center voronoiove celice.
sv: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) returnerar centrum av en voronoi-cell.
tr: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) voronoi hücresinin merkezini döndürür.
uk: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) повертає центр комірки Вороного.
zh_cn: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) 返回蜂窝图案格子中心点位置
zh_tw: color pvoronoi(vector v, int type=1,float jitter=0.5, float fbmScale=0, int fbmOctaves=4,float fbmLacunarity=2, float fbmGain=.5) 傳回 voronoi 巢狀格的中心點。

# builtin|
source: float dist(vector a, vector b) distance between two points
ar: float dist(vector a, vector b) المسافة بين نقطتين
ca: float dist(vector a, vector b) Distància entre dos punts
eo: float dist(vector a, vector b) distanco inter du punktoj
es: float dist(vector a, vector b) distancia entre dos puntos
fr: float dist (vector a, vector b) distance entre deux points
he: float dist(וקטור a, וקטור b) מרחק בין שתי נקודות
it: float dist(vector a, vector b) distanza tra due punti
nl: float dist(vector a, vector b) afstand tussen twee punten
pl: float dist(vector a, vector b) odległość pomiędzy dwoma punktami
pt_br: float dist(vector a, vector b) distância entre dois pontos
sl: float dist(vector a, vector b) razdalja med dvema točkama
sv: float dist(vector a, vector b) avstånd mellan två punkter
tr: float dist(vector a, vector b) iki nokta arasındaki uzaklık
uk: float dist(vector a, vector b) відстань між двома точками
zh_cn: float dist(vector a, vector b) 求两点间距离
zh_tw: float dist(vector a, vector b) 兩點之間的距離

# builtin|
source: float length(vector v) length of vector
ar: float length(vector v) طول المتجه
ca: float length(vector v) Longitud del vector
eo: float length (vector v) longo de vektoro
es: float length(vector v) longitud del vector
fr: float length (vector v) longueur du vecteur
he: float length(וקטור v) אורך וקטור
it: float length(vector v) lunghezza del vettore
nl: float length(vector v) lengte van vector
pl: float length(vector v) długość wektora
pt_br: float length(vector v) comprimento do vetor
sl: float length(vector v) dolžina vektorja
sv: float length(vector v) en vektors längd
tr: float length(vector v) vektörün uzunluğu
uk: float length(vector v) довжина вектора
zh_cn: float length(vector v) 求矢量的长度
zh_tw: float length(vector v) 向量的長度

# builtin|
source: float hypot(vector v) length of 2d vector [x,y]
ar: float hypot(vector v) طول المتجه ثنائي الأبعاد [x,y]
ca: float hypot(vector v) Longitud del vector en 2D [x,y]
eo: float hipot(vector v) longo de 2d vektoro [x,y]
es: float hypot(vector v) longitud del segundo vector [x,y]
fr: float hypot (vector v) longueur d'un vecteur à deux dimensions [x,y]
he: float hypot(וקטור v) אורך של וקטור דו־ממדי [x,y]
it: float hypot(vector v) lunghezza del vettore 2D [x,y]
nl: float hypot(vector v) lengte van 2d vector [x,y]
pl: float hypot(vector v) długość wektora 2D [x, y]
pt_br: float hypot(vector v) comprimento do vetor 2d [x,y]
sl: float hypot(vector v) dolžina 2d vektorja [x,y]
sv: float hypot(vector v) längden av en 2d-vektor [x,y]
tr: float hypot(vector v) 2b vektörün uzunluğu [x, y]
uk: float hypot(vector v) довжина двовимірного вектора [x,y]
zh_cn: float hypot(vector v) 求二维矢量 [x, y] 的长度
zh_tw: float hypot(vector v) 2D 向量 [x,y] 的長度

# builtin|
source: float dot(vector a,vector b) vector dot product
ar: float dot(vector a,vector b) حاصل الضرب النقطي للمتجه
ca: float dot(vector a,vector b) Producte d'un punt vectorial
eo: float punkto(vector a,vector b) vektora punktoproduto
es: float dot(vector a,vector b) Producto de un punto vectorial
fr: float dot (vector a, vector b) vecteur.produit
he: float dot(וקטור a,וקטור b) מכפלה סקלרית של וקטורים
it: float dot(vector a,vector b) prodotto scalare
nl: float dot(vector a,vector b) vector inproduct
pl: float dot(vector a,vector b) iloczyn skalarny wektorów
pt_br: float dot(vector a,vector b) produto de ponto vetorial
sl: float dot(vector a,vector b) skalarni produkt vektorjev
sv: float dot(vector a,vector b) vektorskalärprodukt
tr: float dot(vector a,vector b) vektör nokta ürünü
uk: float dot(vector a,vector b) скалярний добуток векторів
zh_cn: float dot(vector a,vector b) 求矢量的标量积
zh_tw: float dot(vector a,vector b) 向量的內積 (dot product)

# builtin|
source: vector norm(vector v) vector scaled to unit length
ar: vector norm(vector v) متجه مُقَلَّم إلى طول الوحدة
ca: vector norm(vector v) Vector escalat a una unitat de longitud
eo: vector normo(vector v) vektoro skalita al unuolongo
es: vector norm(vector v) vector escalado a la longitud unitaria
fr: vector norm (vector v) vecteur redimensionné à la longueur de l'unité
he: vector norm(וקטור v) שינוי קנה מידה של וקטור לאורך של יחידה
it: vector norm(vector v) vettore scalato alla lunghezza unitaria
nl: vector norm(vector v) tot lengte 1 geschaalde vector
pl: vector norm(vector v) wektor przeskalowany do długości jednostkowej
pt_br: vector norm(vector v) vetor dimensionado para unidade de comprimento
sl: vector norm(vector v) vektor, pomanjšan na dolžino enote
sv: vector norm(vector v) vektor skalad till enhetslängd
tr: vector norm(vector v) birim uzunluğuna ölçeklendirilmiş vektör
uk: vector norm(vector v) масштабування вектора до одиничної довжини
zh_cn: vector norm(vector v) 求矢量缩放至单位长度后的矢量
zh_tw: vector norm(vector v) 將向量縮放至單位長度

# builtin|
source: vector cross(vector a,vector b) vector cross product
ar: vector cross(vector a,vector b) حاصل الضرب الاتجاهي للمتجه
ca: vector cross(vector a,vector b) Producte vectorial
eo: vector kruco(vector a,vector b) vektora kruca produto
es: vector cross(vector a,vector b) Producto de un cruce vectorial
fr: vector cross (vector a, vector b) vecteur x produit
he: vector cross(וקטור a,וקטור b) מכפלה וקטורית
it: vector cross(vector a,vector b) prodotto vettoriale
nl: vector cross(vector a,vector b) vector uitproduct
pl: vector cross(vector a,vector b) iloczyn wektorowy wektorów
pt_br: vector cross(vector a,vector b) produto vetorial de vetor
sl: vector cross(vector a,vector b) vektorski produkt
sv: vector cross(vector a,vector b) vektorkorsprodukt
tr: vector cross(vector a,vector b) vektör çapraz ürün
uk: vector cross(vector a,vector b) векторний добуток векторів
zh_cn: vector cross(vector a,vector b) 求矢量的矢量积
zh_tw: vector cross(vector a,vector b) 向量外積 (cross product)

# builtin|
source: float angle(vector a,vector b) angle between two vectors (in radians)
ar: float angle(vector a,vector b) الزاوية بين متجهين (بالراديان)
ca: float angle(vector a,vector b) Angle entre dos vectors (en radians)
eo: float angulo(vector a,vector b) angle inter du vektoroj (en radianoj)
es: float angle(vector a,vector b) ángulo entre dos vectores (en radianes)
fr: float angle (vector a, vector b) angle formé par deux vecteurs (en radians)
he: float angle(וקטור a,וקטור b) זווית בין שני וקטורים (ברדיאנים)
it: float angle(vector a,vector b) angolo tra due vettori (in radianti)
nl: float angle(vector a,vector b) hoek tussen twee vectoren (in radialen)
pl: float angle(vector a,vector b) kąt pomiędzy dwoma wektorami (w radianach)
pt_br: float angle(vector a,vector b) ângulo entre dois vetores (em radianos)
sl: float angle(vector a,vector b) kot med dvema vektorjema (v radianih)
sv: float angle(vector a,vector b) vinkel mellan två vektorer (i radianer)
tr: float angle(vector a,vector b) iki vektör arasındaki açı (yarıçap olarak)
uk: float angle(vector a,vector b) кут між двома векторами (у радіанах)
zh_cn: float angle(vector a,vector b) 求两个矢量之间的夹角 (输出弧度)
zh_tw: float angle(vector a,vector b) 兩組向量之間的夾角 (以弧度 rad 為單位)

# builtin|
source: vector angle(vector a,vector b) normalized vector orthogonal to a and b scaled to unit length
ar: vector angle(vector a,vector b) متجه مُسوّى عمودي على a و b مُقَلَّم إلى طول الوحدة
ca: vector angle(vector a,vector b) Vector normalitzat ortogonal, «a» i «b» escalats a una unitat de longitud
eo: vector angulo(vector a,vector b) normaligita vektora orta al a kaj b skalita al unuolongo
es: vector angle(vector a,vector b) Vector ortogonal normalizado de «a» y «b» escalado a la longitud unitaria
fr: vector angle (vector a, vector b) vecteur normé orthogonal à a et b, redimensionné à la longueur de l'unité
he: vector angle(וקטור a,וקטור b) וקטור מנורמל במאונך ל־a ול־b בקנה מידה שמתאים לאורך היחידות
it: vector angle(vector a,vector b) vettore normalizzato ortogonale ad a e b scalato alla lunghezza unitaria
nl: vector angle(vector a,vector b) genormaliseerde vector loodrecht op a en b geschaald naar lengte 1
pl: vector angle(vector a,vector b) znormalizowany wektor prostopadły do "a" oraz "b", przeskalowany do jednostki długości
pt_br: vector angle(vector a,vector b) vetor ortogonal normalizado entre a e b dimensionado para comprimento unitário
sl: vector angle(vector a,vector b) normalizirani vektor, pravokoten na a in b, pomanjšan na dolžino enote
sv: vector angle(vector a,vector b) normalisera vektor ortogonalt mot a och b skalat till enhetslängd
tr: vector angle(vector a,vector b) a ve b'ye dik normalleştirilmiş vektör, birim uzunluğa ölçeklendirilmiş
uk: vector angle(vector a,vector b) нормалізований вектор, який є ортогональним до a і b, масштабований до одиничної довжини
zh_cn: vector angle(vector a,vector b) normalized vector orthogonal to a and b scaled to unit length 求与矢量 a 和 b 正交的归一化矢量，缩放至单元长度
zh_tw: vector angle(vector a,vector b) 與 a 和 b 正交的正規化向量 (normalized vector，即已縮放至單位長度)
