Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: float max(float a,float b) greater of a and b
ar: float max(float a,float b) أكبر من a و b
ca: float max(float a,float b) Enter més gran entre «a» i «b»
eo: float max(float a,float b) plej granda de a kaj b
es: float max(float a,float b) mayor de a y b
fr: float max (float a, float b) le plus grand entre a et b
he: float max(שבר עשרוני a,שבר עשרוני b) הגדול מבין a ו־b
it: float max(float a,float b) maggiore di a e b
nl: float max(float a,float b) grootste van a en b
pl: float max(float a,float b) większe spośród a oraz b
pt_br: float max(float a,float b) maior de a e b
sl: float max(float a,float b) večji izmed a in b
sv: float max(float a,float b) det största av a och b
tr: float max(float a,float b) a ve b'den büyük
uk: float max(float a,float b) більше з чисел a і b
zh_cn: float max(float a,float b) 取 a 和 b 的较大值
zh_tw: float max(float a,float b) 取 a 與 b 之間的最大值

# builtin|
source: float min(float a,float b) lesser of a and b
ar: float min(float a,float b) أصغر من a و b
ca: float min(float a,float b) Enter més petit entre «a» i «b»
eo: float min(float a,float b) pli malgranda de a kaj b
es: float min(float a,float b) menor de a y b
fr: float min(float a,float b) Le plus petit entre a et b
he: float min(שבר עשרוני a,שבר עשרוני b) הקטן מבין a ו־b
it: float min(float a,float b) minore di a e b
nl: float min(float a,float b) kleinste van a en b
pl: float mix(float a,float b) mniejsze spośród a oraz b
pt_br: float min(float a,float b) menor de a e b
sl: float min(float a,float b) manjši izmed a in b
sv: float min(float a,float b) det minsta av a och b
tr: float min(float a,float b) a ve b'den küçük
uk: float min(float a,float b) менше з чисел a і b
zh_cn: float min(float a,float b) 取 a 和 b 的较小值
zh_tw: float min(float a,float b) 取 a 與 b 之間的最小值

# builtin|
source: float trunc(float a) nearest integer towards zero
ar: float trunc(float a) أقرب عدد صحيح باتجاه الصفر
ca: float trunc(float a) Nombre enter més proper a zero
eo: float trunc(float a) plej proksima entjero al nulo
es: float trunc(float a) entero más cercano hacia cero
fr: float trunc (float a) Entier le plus proche de zéro
he: float trunc(שבר עשרוני a) המספר השלם הקרוב ביותר לעבר האפס
it: float trunc(float a) intero più vicino verso lo zero
nl: float trunc(float a) dichtstbijzijnd geheel getal in de richting van 0
pl: float trunc(float a) najbliższa liczba całkowita w stronę zera
pt_br: float trunc(float a) o número inteiro mais próximo de zero
sl: float trunc(float a) najbližje celo število proti ničli
sv: float trunc(float a) närmaste heltal mot noll
tr: float trunc(float a) sıfıra yakın en yakın tamsayı
uk: float trunc(float a) найближче до x ціле значення у напрямку до нуля
zh_cn: float trunc(float a) 趋零截尾，求 x 在趋近零方向上的最近似整数
zh_tw: float trunc(float a) 向 0 取最近整數值

# builtin|
source: float floor(float a) next lower integer
ar: float floor(float a) العدد الصحيح الأدنى التالي
ca: float floor(float a) Següent nombre enter més petit
eo: float floor(float a) sekva pli malalta entjero
es: float floor(float a) siguiente entero más bajo
fr: float floor (float a) Entier inférieur suivant
he: float floor(שבר עשרוני a) המספר השלם הנמוך הבא
it: float floor(float a) intero successivo inferiore
nl: float floor(float a) eerstvolgend kleiner geheel getal
pl: float floor(float a) następna niższa liczba całkowita
pt_br: float floor(float a) próximo inteiro inferior
sl: float floor(float a) naslednje manjše celo število
sv: float floor(float a) nästa mindre heltal
tr: float floor(float a) sonraki daha düşük tamsayı
uk: float floor(float a) найбільше з менших цілих чисел
zh_cn: float floor(float a) 取下一更小整数
zh_tw: float floor(float a) 向下取整數值

# builtin|
source: float ceil(float a) next higher integer
ar: float ceil(float a) العدد الصحيح الأعلى التالي
ca: float ceil(float a) Següent nombre enter més gran
eo: float ceil(float a) sekva pli alta entjero
es: float ceil(float a) siguiente entero más alto
fr: float ceil (float a) Entier supérieur suivant
he: float ceil(שבר עשרוני a) המספר השלם הגבוה הבא
it: float ceil(float a) intero successivo più alto
nl: float ceil(float a) eerstvolgend groter geheel getal
pl: float ceil(float a) następna wyższa liczba całkowita
pt_br: float ceil(float a) próximo inteiro superior
sl: float ceil(float a) naslednje večje celo število
sv: float ceil(float a) nästa större heltal
tr: float ceil(float a) sonraki daha yüksek tamsayı
uk: float ceil(float a) найменше з більших цілих чисел
zh_cn: float ceil(float a) 取下一更大整数
zh_tw: float ceil(float a) 向上取整數值

# builtin|
source: float invert(float a) Defined as 1-x
ar: float invert(float a) يعرَّف كـ 1-x
ca: float invert(float a) Definit com a 1-x
eo: float invert (float a) Difinita kiel 1-x
es: float invert(float a) Definido como 1-x
fr: float invert (float a) Défini comme « 1 - x »
he: float invert(שבר עשרוני a) מוגדר בתור ‎1-a
it: float invert(float a) Definito come 1-x
nl: float invert(float a) Gedefinieerd als 1-x
pl: float invert(float a) Określone jako 1-x
pt_br: float invert(float a) Definido como 1-x
sl: float invert(float a) Določeno kot 1-x
sv: float invert(float a) Definierat som 1-x
tr: float invert(float a) 1-x olarak tanımlı
uk: float invert(float a) визначено як 1-x
zh_cn: float invert(float a) 将数值进行反相，按照 1 - x 进行定义
zh_tw: float invert(float a) 已定義為 1-x

# builtin|
source: float cbrt(float x) cube root
ar: float cbrt(float x) الجذر التكعيبي
ca: float cbrt(float x) Arrel cúbica
eo: float cbrt(float x) kuba radiko
es: float cbrt(float x) raíz cúbica
fr: float cbrt (float x) racine cubique
he: float cbrt(שבר עשרוני x) שורש מסדר שלישי
it: float cbrt(float x) radice cubica
nl: float cbrt(float x) derdemachts wortel
pl: float cbrt(float x) pierwiastek sześcienny
pt_br: float cbrt(float x) raiz cúbica
sl: float cbrt(float x) kubni koren
sv: float cbrt(float x) kubrot
tr: float cbrt(float x) küpkök
uk: float cbrt(float x) кубічний корінь
zh_cn: float cbrt(float x) 求 x 的立方根
zh_tw: float cbrt(float x) 立方根

# builtin|
source: float sqrt(float x) square root
ar: float sqrt(float x) الجذر التربيعي
ca: float sqrt(float x) Arrel quadrada
eo: float sqrt(float x) kvadrata radiko
es: float sqrt(float x) raíz cuadrada
fr: float sqrt (float x) Racine carrée
he: float sqrt(שבר עשרוני x) שורש ריבועי
it: float sqrt(float x) radice quadrata
nl: float sqrt(float x) (vierkants) wortel
pl: float sqrt(float x) pierwiastek kwadratowy
pt_br: float sqrt(float x) raiz quadrada
sl: float sqrt(float x) kvadratni koren
sv: float sqrt(float x) kvadratrot
tr: float sqrt(float x) karekök
uk: float sqrt(float x) квадратний корінь
zh_cn: float sqrt(float x) 求 x 的平方根
zh_tw: float sqrt(float x) 平方根

# builtin|
source: float exp(float x) E raised to the x power
ar: float exp(float x) E مرفوعة للقوة x
ca: float exp(float x) «e» elevat a la potència de «x»
eo: float exp(float x) E levita al la x-potenco
es: float exp(float x) E elevado a la potencia de x
fr: float exp (float x) E élevé à la puissance x
he: float exp(שבר עשרוני x) E בחזקת x
it: float exp(float x) E elevato alla potenza di x
nl: float exp(float x) e tot de macht x
pl: float exp(float x) E podniesione do potęgi x
pt_br: float exp(float x) <i>e</i> elevado à potência de x
sl: float exp(float x) E na potenco x
sv: float exp(float x) e upphöjt till x
tr: float exp(float x) x kuvvetine yükseltilmiş E
uk: float exp(float x) E у степені x
zh_cn: float exp(float x) 求 E 的 x 次方
zh_tw: float exp(float x) E 的 x 次方 (指數函數)

# builtin|
source: float pow(float x, float y) x to the y power, also available as ^
ar: float pow(float x, float y) x مرفوعة للقوة y، متاحة أيضًا كـ ^
ca: float pow(float x, float y) «x» elevat a la potència de «y», també disponible com a «^»
eo: float pow(float x, float y) x al la y-potenco, ankaŭ havebla kiel ^
es: float pow(float x, float y) x a la potencia de y, también está disponible como ^
fr: float pow (float x, float y) Élévation de x à la puissance y, aussi noté x^y
he: float pow(שבר עשרוני x, שבר עשרוני y) x בחזקת y, זמין גם בתור ^
it: float pow(float x) x alla potenza di y, disponibile anche come ^
nl: float pow(float x, float y) x tot de macht y, ook mogelijk met ^
pl: float pow(float x, float y) x do potęgi y, dostępne również jako ^
pt_br: float pow(float x, float y) x elevado à potência de y, também disponível como ^
sl: float pow(float x, float y) x na potenco y, na voljo tudi kot ^
sv: float pow(float x, float y) x upphöjt till y, också tillgängligt som ^
tr: float pow(float x, float y) x üzeri y kuvveti, ^ olarak da kullanılabilir
uk: float pow(float x, float y) x у степені y, також можна записати у формі з ^
zh_cn: float pow(float x, float y) 求 x 的 y 次方 (也可以通过 ^ 运算符调用)
zh_tw: float pow(float x, float y) x 的 y 次方，亦可用運算符號 ^ 表達

# builtin|
source: float log(float x) Natural logarithm
ar: float log(float x) اللوغاريتم الطبيعي
ca: float log(float x) Logaritme natural
eo: float log(float x) Natura logaritmo
es: float log(float x) Logaritmo natural
fr: float log (float x) Logarithme classique
he: float log(x כשבר עשרוני) לוגריתם טבעי
it: float log(float x) Logaritmo naturale
nl: float log(float x) natuurlijke logaritme
pl: float log(float x) Logarytm naturalny
pt_br: float log(float x) Logaritmo natural
sl: float log(float x) Naravni logaritem
sv: float log(float x) Naturlig logaritm
tr: float log(float x) Doğal logaritma
uk: float log(float x) натуральний логарифм
zh_cn: float log(float x) 求自然对数
zh_tw: float log(float x) 自然對數

# builtin|
source: float log10(float x) Base 10 logarithm
ar: float log10(float x) اللوغاريتم ذو الأساس 10
ca: float log10(float x) Logaritme en base 10
eo: float log10(float x) Baza 10 logaritmo
es: float log10(float x) Logaritmo en base 10
fr: float log10 (float x) Logarithme en base 10
he: float log10 (x כשבר עשרוני) Base 10 logarithm
it: float log10(float x) Logaritmo in base 10
nl: float log10(float x) logaritme met grondtal 10
pl: float log10(float x) Podstawa algorytmu 10
pt_br: float log10(float x) Logaritmo de base 10
sl: float log10(float x) Logaritem z osnovo 10
sv: float log10(float x) Bas 10 logaritm
tr: float log10(float x) 10 tabanlı logaritma
uk: float log10(float x) логарифм за основою 10
zh_cn: float log10(float x) 求以 10 为底的对数
zh_tw: float log10(float x) 基數為 10 的對數

# builtin|
source: float fmod(float x,float y) remainder of x/y (also available as % operator)
ar: float fmod(float x,float y) باقي قسمة x/y (متاح أيضًا كعامل %)
ca: float fmod(float x,float y) La resta de «x»/«y» (també disponible com a l'operador «%»)
eo: float fmod(float x,float y) resto de x/y (ankaŭ disponebla kiel % operatoro)
es: float fmod(float x,float y) resto de x/y (también disponible como el operador %)
fr: float fmod (float x, float y) Reste de la division entière de x par y (aussi nommé sous la forme x % y)
he: float fmod(שבר עשרוני x,שבר עשרוני y) השארית של x/y (זמין גם עם הסימן %)
it: float fmod(float x,float y) resto di x/y (disponibile anche come operatore %)
nl: float fmod(float x,float y) rest van x/y (ook mogelijk met x%y)
pl: float fmod(float x,float y) reszta z x/y (dostępne również jako operator %)
pt_br: float fmod(float x,float y) restante de x/y (também disponível como operador % )
sl: float fmod(float x,float y) ostanek pri x/y (na voljo tudi kot operator %)
sv: float fmod(float x,float y) rest av x/y (också tillgänglig som operatorn %)
tr: float fmod(float x,float y) x/y'nin kalanı (% işleci olarak da kullanılabilir)
uk: float fmod(float x,float y) Лишок від ділення x/y (також можна використати форму запису з оператором %)
zh_cn: float fmod(float x,float y) 求 x/y 的余数 (也可以通过 % 运算符调用)
zh_tw: float fmod(float x,float y) x/y 的餘數，亦可用運算符號 % 表達

# builtin|
source: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Absolute value of each noise term is taken. This gives billowy appearance
ar: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) القيمة المطلقة لكل حد ضوضاء مأخوذة. هذا يعطي مظهرًا متموجًا
ca: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=0.5) Es pren el valor absolut de cada terme de soroll. Això li dona una aparença més ondulada
eo: float turbulence(vector v, int oktavoj=6, float lakuneco=2, float gajno=.5) Absoluta valoro de ĉiu brua termino estas prenita. Ĉi tio donas fluantan aspekton
es: float turbulence(vector v,int octavas=6,float lagunaridad=2,float ganancia=.5) Se toma el valor absoluto de cada término de ruido. Esto proporciona una apariencia ondulada.
fr: float turbulence (vector v, int octaves=6, float lacunarity=2, float gain=0.5) La valeur absolue de chaque terme de bruit est prise. Ceci donne une apparence agitée.
he: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) נלקח ערך מוחלט לכל רכיב רעש. מעניק מראה נפוח.
it: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Viene preso il valore assoluto di ciascun termine di rumore. Questo dà un aspetto fluttuante
nl: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Met absolute waarde van elke ruisterm. Ziet er golvend uit
pl: float turbulence(vector v,int oktawy=6,float lakunarność=2,float wzmocnienie=.5) Brana jest bezwzględna wartość każdego wyrażenia szumu. Nadaje to wzburzony wygląd
pt_br: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) O valor absoluto de cada termo de ruído é considerado. Isso dá uma aparência ondulada
sl: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Upošteva absolutna vrednost vsakega izraza šuma. To daje valovit videz
sv: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Absolutvärdet av varje brusterm beräknas. Det ger ett böljande utseende.
tr: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Her gürültü teriminin mutlak değeri alınır. Bu, dalgalı bir görünüş verir
uk: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Врахування усіх складових шуму за модулем. Надає хвилястішого вигляду.
zh_cn: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) 取每种噪声条件的绝对值，给出更加汹涌的视觉效果
zh_tw: float turbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) 將取每個雜訊數值的絕對值。這會產生一個比較膨脹飽滿的外觀

# builtin|
source: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Absolute value of each noise term is taken. This gives billowy appearance
ar: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) القيمة المطلقة لكل حد ضوضاء مأخوذة. هذا يعطي مظهرًا متموجًا
ca: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=0.5) Es pren el valor absolut de cada terme de soroll. Això li dona una aparença més ondulada
eo: color cturbulence(vector v,int oktavoj=6,float lakuneco=2,float gajno=.5) Absoluta valoro de ĉiu brua termino estas prenita. Ĉi tio donas fluantan aspekton
es: color cturbulence(vector v,int octavas=6,float lagunaridad=2,float ganancia=.5) Se toma el valor absoluto de cada término de ruido. Esto proporciona una apariencia ondulada.
fr: color cturbulence(vector v, int octaves=6, float lacunarity=2, float gain=0.5) La valeur absolue de chaque terme de bruit est prise. Ceci donne une apparence agitée.
he: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) נלקח ערך מוחלט לכל רכיב רעש. מעניק מראה נפוח.
it: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Viene preso il valore assoluto di ciascun termine di rumore. Questo dà un aspetto fluttuante
nl: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Met absolute waarde van elke ruisterm. Ziet er golvend uit
pl: color cturbulence(vector v,int oktawy=6,float lakunarność=2,float wzmocnienie=.5) Brana jest bezwzględna wartość każdego wyrażenia szumu. Nadaje to wzburzony wygląd
pt_br: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) O valor absoluto de cada termo de ruído é considerado. Isso dá uma aparência ondulada
sl: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Upošteva absolutna vrednost vsakega izraza šuma. To daje valovit videz
sv: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Absolutvärdet av varje brusterm beräknas. Det ger ett böljande utseende.
tr: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Her gürültü teriminin mutlak değeri alınır. Bu, dalgalı bir görünüş verir
uk: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Врахування усіх складових шуму за модулем. Надає хвилястішого вигляду.
zh_cn: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) 取每种噪声条件的绝对值，给出更加汹涌的视觉效果
zh_tw: color cturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) 將取每個雜訊數值的絕對值。這會產生一個比較膨脹飽滿的外觀

# builtin|
source: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Absolute value of each noise term is taken. This gives billowy appearance
ar: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) القيمة المطلقة لكل حد ضوضاء مأخوذة. هذا يعطي مظهرًا متموجًا
ca: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=0.5) Es pren el valor absolut de cada terme de soroll. Això li dona una aparença més ondulada
eo: vector vturbulence(vector v,int oktavoj=6,float lakuneco=2,float gajno=.5) Absoluta valoro de ĉiu brua termino estas prenita. Ĉi tio donas fluantan aspekton
es: vector vturbulence(vector v,int octavas=6,float lagunaridad=2,float ganancia=.5) Se toma el valor absoluto de cada término de ruido. Esto proporciona una apariencia ondulada.
fr: vector vturbulence (vector v, int octaves=6, float lacunarity=2, float gain=0.5) La valeur absolue de chaque terme est prise. Ceci donne une apparence agitée.
he: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) נלקח ערך מוחלט לכל רכיב רעש. מעניק מראה נפוח.
it: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Viene preso il valore assoluto di ciascun termine di rumore. Questo dà un aspetto fluttuante
nl: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Met absolute waarde van elke ruisterm. Ziet er golvend uit
pl: vector vturbulence(vector v,int oktawy=6,float lakunarność=2,float wzmocnienie=.5) Brana jest bezwzględna wartość każdego wyrażenia szumu. Nadaje to wzburzony wygląd
pt_br: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) O valor absoluto de cada termo de ruído é considerado. Isso dá uma aparência ondulada
sl: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Upošteva absolutna vrednost vsakega izraza šuma. To daje valovit videz
sv: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Absolutvärdet av varje brusterm beräknas. Det ger ett böljande utseende.
tr: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Her gürültü teriminin mutlak değeri alınır. Bu, dalgalı bir görünüş verir
uk: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) Врахування усіх складових шуму за модулем. Надає хвилястішого вигляду.
zh_cn: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) 取每种噪声条件的绝对值，给出更加汹涌的视觉效果
zh_tw: vector vturbulence(vector v,int octaves=6,float lacunarity=2,float gain=.5) 將取每個雜訊數值的絕對值。這會產生一個比較膨脹飽滿的外觀

# builtin|
source: float compress(float x,float lo,float hi) Remaps x in [0,1] to [lo,hi]
ar: float compress(float x,float lo,float hi) أعِد رسم x في [0,1] إلى [lo,hi]
ca: float compress(float x,float lo,float hi) Reassigna «x» de [0,1] a [lo,hi]
eo: float compress(float x,float lo,float hi) Remapas x en [0,1] al [lo,hi]
es: float compress(float x,float bajo,float alto) Remapea x en [0,1] a [bajo,alto]
fr: float compress (float x, float lo, float hi) Recales x dans [0,1] vers [lo, hi]
he: float compress(שבר עשרוני x,שבר עשרוני lo,שבר עשרוני hi) מיפוי מחדש של x בטווח [0,1] לכדי [lo,hi]
it: float compress(float x,float lo,float hi) Rimappa x in [0,1] a [lo,hi]
nl: float compress(float x,float laag,float hoog) Beeldt x af van [0,1] naar [laag,hoog]
pl: float compress(float x,float lo,float hi) Ponownie mapuje x w [0,1] do [lo,hi]
pt_br: float compress(float x,float lo,float hi) Remapeia x em [0,1] para [lo, hi]
sl: float compress(float x,float lo,float hi) Preslika x iz [0,1] v [lo,hi]
sv: float compress(float x,float lo,float hi) Avbildar x inom [0,1] till [lo,hi]
tr: float compress(float x,float dü,float yü) [0,1]'deki x'i [dü,yü]'ye yeniden eşler
uk: float compress(float x,float lo,float hi) Відображає x з [0,1] на [lo,hi]
zh_cn: float compress(float x,float lo,float hi) 将 x 的动态范围从 [0, 1] 压缩至 [lo, hi]
zh_tw: float compress(float x,float lo,float hi) 將 x 由 [0,1] 映射到 [lo,hi]

# builtin|
source: float expand(float x,float lo,float hi) Remaps x in [lo,hi] to [0,1]
ar: float expand(float x,float lo,float hi) أعِد رسم x في [lo,hi] إلى [0,1]
ca: float expand(float x,float lo,float hi) Reassigna «x» de [lo,hi] a [0,1]
eo: float expand(float x, float lo, float hi) Remapas x en [lo,hi] al [0,1]
es: float expand(float x,float bajo,float alto) Remapea x en [bajo,alto] a [0,1]
fr: float expand (float x, float lo, float hi) Recales x dans [lo,hi] vers [0,1]
he: float expand(float x,float lo,float hi) מיפוי x ב־[lo,hi] ל־[0,1]
it: float expand(float x,float lo,float hi) Rimappa x in [lo,hi] a [0,1]
nl: float expand(float x,float laag,float hoog) Beeldt x af van [laag,hoog] naar [0, 1]
pl: float expand(float x,float lo,float hi) Ponownie mapuje x w [lo,hi] do [0,1]
pt_br: float expand(float x,float lo,float hi) Remapeia x em [lo, hi] para [0,1]
sl: float expand(float x,float lo,float hi) Preslika x iz [lo,hi] v [0,1]
sv: float expand(float x,float lo,float hi) Avbildar x inom [lo,hi] till [0,1]
tr: float expand(float x,float dü,float yü) [dü,yü]'deki x'i [0,1]'e yeniden eşler
uk: float expand(float x,float lo,float hi) Відображає x з [lo,hi] на [0,1]
zh_cn: float expand(float x,float lo,float hi) 将 x 的动态范围从 [lo, hi] 扩展至 [0, 1]
zh_tw: float expand(float x,float lo,float hi) 將 x 由 [lo,hi] 映射到 [0,1]

# builtin|
source: float fit(float x,float a1,float b1,float a2,float b2) Linearly remaps x in [a1,b1] to [a2,b2]
ar: float fit(float x,float a1,float b1,float a2,float b2) أعِد رسم x خطيًا في [a1,b1] إلى [a2,b2]
ca: float fit(float x,float a1,float b1,float a2,float b2) Reassigna linealment «x» de [a1,b1] a [a2,b2]
eo: float fit(float x,float a1,float b1,float a2,float b2) Linie remapas x en [a1,b1] al [a2,b2]
es: float fit(float x,float a1,float b1,float a2,float b2) Remapea linealmente x en [a1,b1] a [a2,b2]
fr: float fit (float x, float a1, float b1, float a2, float b2) Recales linéairement x dans [a1, b1] vers [a2, b2]
he: float fit(float x,float a1,float b1,float a2,float b2) מיפוי קווי של x ב־[a1,b1] ל־[a2,b2]
it: float fit(float x,float a1,float b1,float a2,float b2) Rimappa linearmente x in [a1,b1] a [a2,b2]
nl: float fit(float x,float a1,float b1,float a2,float b2) Lineair afbeelden van x van [a1,b1] naar [a2,b2]
pl: float fit(float x,float a1,float b1,float a2,float b2) Liniowo mapuje ponownie x w [a1,b1] do [a2,b2]
pt_br: float fit(float x,float a1,float b1,float a2,float b2) Remapeia linearmente x em [a1,b1] para [a2,b2]
sl: float fit(float x,float a1,float b1,float a2,float b2) Linearno preslika x iz [a1,b1] v [a2,b2]
sv: float fit(float x,float a1,float b1,float a2,float b2) Avbildar x inom [a1,b1] linjärt till [a2,b2]
tr: float fit(float x,float a1,float b1,float a2,float b2) [a1,b1]'deki x'i [a2,b2]'ye doğrusal olarak yeniden eşler
uk: float fit(float x,float a1,float b1,float a2,float b2) Лінійно відображає x з [a1,b1] на [a2,b2]
zh_cn: float fit(float x,float a1,float b1,float a2,float b2) 将 x 从 [a1,b1] 范围线性重映射至 [a2,b2]
zh_tw: float fit(float x,float a1,float b1,float a2,float b2) 線性地將 x 由 [a1,b1] 映射到 [a2,b2]
