Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# ExprAddDialog|
source: String Default
ar: مبدئي السلسلة النصية
ca: Cadena predeterminada
eo: String Defaŭlta
es: Cadena de texto por omisión
fr: Chaîne par défaut
he: ברירת מחדל של מחרוזת
it: Valore predefinito stringa
nl: Stringstandaard
pl: Domyślny ciąg znaków
pt_br: Texto padrão
sl: Privzeti niz
sv: Strängförval
tr: Dizi Öntanımlısı
uk: Типовий рядок
zh_cn: String Default(字符串默认值)
zh_tw: 字串預設

# ExprAddDialog|
source: String
ar: سلسلة نصية
ca: Cadena
es: Cadena de texto
fr: Chaîne
he: מחרוזת
it: Stringa
nl: String (tekenreeks)
pl: Ciąg znaków
pt_br: Texto
sl: Niz
sv: Sträng
tr: Dizi
uk: Рядок
zh_cn: String(字符串)
zh_tw: 字串 (string)

# ExprBrowser|
source: Save Expression
ar: احفظ العبارة
ca: Desa l'expressió
eo: Konservi Esprimon
es: Guardar expresión
fr: Enregistrer une expression
he: שמירת ביטוי
it: Salva espressione
nl: Expressie opslaan
pl: Zapisz wyrażenie
pt_br: Salvar expressão
sl: Shrani izraz
sv: Spara uttryck
tr: İfadeyi Kaydet
uk: Зберегти вираз
zh_cn: 保存表达式
zh_tw: 儲存運算式

# ExprBrowser|
source: Could not open file %1 for writing
ar: تعذَّر فتح الملف %1 للكتابة
ca: No s'ha pogut obrir el fitxer «%1» per a escriptura
eo: Ne eblis malfermi dosieron %1 por skribado
es: No se ha podido abrir el archivo %1 para escritura
fr: Impossible d'ouvrir le fichier %1 pour y écrire
he: לא ניתן לפתוח את %1 לכתיבה
it: Impossibile aprire il file %1 in scrittura
nl: Kon bestand %1 niet openen voor schrijven
pl: Nie można otworzyć pliku %1 do zapisu
pt_br: Não foi possível abrir o arquivo %1 para gravação
sl: Datoteke %1 ni bilo mogoče odpreti za pisanje
sv: Kunde inte öppna filen %1 för skrivning
tr: %1, yazma için açılamadı
uk: Не вдалося відкрити файл %1 для запису.
zh_cn: 无法打开文件 %1 进行写入
zh_tw: 不能開啟檔案 %1 以供寫入

# ExprBrowser|
source: Error
ar: خطأ
eo: Eraro
fr: Erreur
he: שגיאה
it: Errore
nl: Fout
pl: Błąd
pt_br: Erro
sl: Napaka
sv: Fel
tr: Hata
uk: Помилка
zh_cn: 错误
zh_tw: 錯誤

# ExprBrowser|
source: Could not open file %1 for writing. Is it read-only?
ar: لم أقدر على فتح الملف %1 للكتابة. هل هو للقراءة فقط؟
ca: No s'ha pogut obrir el fitxer «%1» per a escriptura. És de només lectura?
eo: Ne eblis malfermi dosieron %1 por skribado. Ĉu ĝi estas nurlegebla?
es: No se ha podido abrir el archivo %1 para escritura. ¿Es de solo lectura?
fr: Impossible d'ouvrir le fichier %1 pour y écrire ? Serait-il en lecture seule ?
he: לא ניתן לפתוח את הקובץ %1 לכתיבה. האם הוא לקריאה בלבד?
it: Impossibile aprire il file %1 in scrittura. È in sola lettura?
nl: Kon bestand %1 niet openen voor schrijven. Is het alleen-lezen?
pl: Nie można otworzyć pliku %1 do zapisu. Czy jest on tylko do odczytu?
pt_br: Não foi possível abrir o arquivo %1 para gravação. É somente leitura?
sl: Datoteke %1 ni bilo mogoče odpreti za pisanje. Ali je samo za branje?
sv: Kunde inte öppna filen %1 för skrivning. Är den skrivskyddad?
tr: %1, yazma için açılamadı. Saltokunur olabilir mi?
uk: Не вдалося відкрити файл %1 для запису. Цей файл призначено лише для читання?
zh_cn: 无法打开文件 %1 进行写入，它是只读文件吗？
zh_tw: 不能開啟檔案 %1 以供寫入。檔案是否唯讀？

# CCurveScene|
source: Delete Point
ar: احذف النقطة
ca: Suprimeix el punt
eo: Forigi Punkton
es: Borrar punto
fr: Supprimer un point
he: מחיקת נקודה
it: Elimina punto
nl: Punt verwijderen
pl: Usuń punkt
pt_br: Excluir ponto
sl: Briši točko
sv: Ta bort punkt
tr: Noktayı Sil
uk: Вилучити точку
zh_cn: 删除点
zh_tw: 刪除點

# ExprColorCurve|
source: Selected Position:
ar: الموقع المختار:
ca: Posició seleccionada:
eo: Elektita Pozicio:
es: Posición seleccionada:
fr: Position sélectionnée :
he: מקום נבחר:
it: Posizione selezionata:
nl: Geselecteerde positie:
pl: Wybrane położenie:
pt_br: Posição selecionada:
sl: Izbrana pozicija:
sv: Vald position:
tr: Seçili Konum:
uk: Вибрана позиція:
zh_cn: 选定的位置:
zh_tw: 已選取位置：

# ExprColorCurve|
source: Selected Color:
ar: اللون المختار:
ca: Color seleccionat:
eo: Elektita Koloro:
es: Color seleccionado:
fr: Couleur sélectionnée :
he: צבע נבחר:
it: Colore selezionato:
nl: Geselecteerde kleur:
pl: Zaznaczona barwa:
pt_br: Cor selecionada:
sl: Izbrana barva:
sv: Vald färg:
tr: Seçili Renk:
uk: Вибраний колір:
zh_cn: 选定的颜色:
zh_tw: 已選取色彩：

# ExprColorCurve|
source: Interp:
ar: استقطاب:
eo: Interpreto:
es: Intérp:
he: פענוח:
tr: Aradeğerlenen:
uk: Ітерпр.:
zh_cn: 插值(Interp):
zh_tw: 插值：

# ExprColorCurve|
source: None
ar: لا شيء
ca: Cap
eo: Neniu
es: Ninguna
fr: Aucun
he: ללא
it: Nessuno
nl: Geen
pl: Brak
pt_br: Nenhuma
sl: Nobena
sv: Ingen
tr: Yok
uk: Немає
zh_cn: None(无)
zh_tw: 無

# ExprColorCurve|
source: Linear
ar: خطي
ca: Lineal
eo: Lineara
es: Lineal
fr: Linéaire
he: קווי
it: Lineare
nl: Lineair
pl: Liniowa
sl: Linearno
sv: Linjär
tr: Doğrusal
uk: Лінійний
zh_cn: Linear(线性)
zh_tw: 線性

# ExprColorCurve|
source: Smooth
ar: سلس
ca: Suavitzat
eo: Glata
es: Suave
fr: Doux
he: חלק
it: Smussatura
nl: Glad
pl: Wygładzona
pt_br: Suave
sl: Gladko
sv: Jämn
tr: Pürüzsüz
uk: Згладжування
zh_cn: Smooth(平滑)
zh_tw: 平滑

# ExprColorCurve|
source: Spline
fr: Courbe
he: ספליין/Spline
pl: Krzywa sklejana
sl: Zlepek
tr: Eğri
uk: Сплайни
zh_cn: Spline(样条曲线)
zh_tw: 樣條曲線 (spline)

# ExprColorCurve|
source: MSpline
he: ספליין מונוטוני/MSpline
sl: MZlepek
tr: M-Eğri
uk: M-сплайни
zh_cn: MSpline(单调样条曲线)
zh_tw: M樣條曲線 (MSpline)

# ExprColorCurve|
source: &Expand...
ar: &وسِّع...
ca: &Expandeix...
eo: &Vastigi...
es: &Expandir…
fr: Développ&er...
he: ה&רחבה…
it: &Espandi...
nl: Uitvouw&en...
pl: &Rozwiń...
pt_br: &Expandir...
sl: Razširi...
sv: &Expandera...
tr: &Genişlet...
uk: Роз&горнути
zh_cn: 展开(&E)…
zh_tw: 放大窗格(&E)…

# ExprColorFrame|
source: Delete Swatch
ar: احذف عينة اللون
ca: Suprimeix la mostra
eo: Forigi Swatch
es: Borrar muestra
fr: Supprimer le nuancier
he: מחיקת מקבץ צבעים
it: Elimina campione
nl: Kleurenstaal wissen
pl: Usuń łatkę
pt_br: Excluir amostra
sl: Zbriši vzorec barve
sv: Ta bort färgruta
tr: Parçayı Sil
uk: Вилучити зразок
zh_cn: 删除色块
zh_tw: 刪除色彩

# ExprColorFrame|
source: Cancel
ar: ألغِ
ca: Cancel·la
eo: Nuligi
es: Cancelar
fr: Annuler
he: ביטול
it: Annulla
nl: Annuleren
pl: Anuluj
pt_br: Cancelar
sl: Prekliči
sv: Avbryt
tr: İptal
uk: Скасувати
zh_cn: 取消
zh_tw: 取消

# ExprColorSwatchWidget|
source: &Add...
ar: أ&ضف...
ca: &Afegeix...
eo: &Aldoni...
es: &Añadir…
fr: &Ajouter...
he: הו&ספה…
it: &Aggiungi...
nl: &Toevoegen...
pl: Dod&aj...
pt_br: &Adicionar...
sl: Dodaj...
sv: &Lägg till...
tr: &Ekle...
uk: &Додати…
zh_cn: 新增(&A)…
zh_tw: 加入(&A)…

# ExprCompletionModel|
source: Local
ar: محلي
eo: Loka
he: מקומי
it: Locale
nl: Lokaal
pl: Lokalna
sl: Lokalno
sv: Lokal
tr: Yerel
uk: Локально
zh_cn: 局部变量
zh_tw: 本地變數

# StringControl|
source: Please choose a file
ar: اختارِ ملفًا من فضلك
ca: Si us plau, seleccioneu un fitxer
eo: Bonvolu elekti dosieron
es: Seleccione un archivo
fr: Veuillez choisir un fichier
he: נא לבחור קובץ
it: Scegli un file
nl: Kies een bestand a.u.b
pl: Wybierz plik
pt_br: Escolha um arquivo
sl: Izberite datoteko
sv: Välj en fil
tr: Lütfen bir dosya seçin
uk: Будь ласка, виберіть файл
zh_cn: 请选择文件
zh_tw: 請選擇檔案

# StringControl|
source: Images (*.tif *.tx *.jpg *.ptx *.png)
ar: الصور (*.tif *.tx *.jpg *.ptx *.png)
ca: Imatges (*.tif *.tx *.jpg *.ptx *.png)
eo: Bildoj (*.tif *.tx *.jpg *.ptx *.png)
es: Imágenes (*.tif *.tx *.jpg *.ptx *.png)
he: מקום (‎*.tif‏ ‎*.tx‏ ‎*.jpg‏ ‎*.ptx‏ ‎*.png)
it: Immagini (*.tif *.tx *.jpg *.ptx *.png)
nl: Afbeeldingen (*.tif *.tx *.jpg *.ptx *.png)
pl: Obrazy (*.tif *.tx *.jpg *.ptx *.png)
pt_br: Imagens (*.tif *.tx *.jpg *.ptx *.png)
sl: Slike (*.tif *.tx *.jpg *.ptx *.png)
sv: bilder (*.tif *.tx *.jpg *.ptx *.png)
tr: Görseller (*.tif *.tx *.jpg *.ptx *.png)
uk: зображення (*.tif *.tx *.jpg *.ptx *.png)
zh_cn: 图像 (*.tif *.tx *.jpg *.ptx *.png)
zh_tw: 圖像檔 (*.tif *.tx *.jpg *.ptx *.png)

# CurveControl|
source: Pos:
ar: موقع:
eo: Pozo:
he: מקום:
pl: Położenie:
tr: Konum:
uk: Поз.:
zh_cn: 位置(Pos):
zh_tw: 位置：

# CurveControl|
source: Val:
ar: قيمة:
he: ערך:
nl: Waarde:
pl: Wartość:
sv: Värde:
tr: Değer:
uk: Знач.:
zh_cn: 数值(Val):
zh_tw: 數值：

# CurveControl|
source: Interp:
ar: استقطاب:
es: Intérp:
he: פענוח:
tr: Aradeğerlenen:
uk: Ітерпр.:
zh_cn: 插值(Interp):
zh_tw: 插值：

# CCurveControl|
source: Pos:
ar: موقع:
eo: Poz:
he: מקום:
pl: Położenie:
tr: Konum:
uk: Поз.:
zh_cn: 位置(Pos):
zh_tw: 位置：

# CCurveControl|
source: Val:
ar: قيمة:
he: ערך:
nl: Waarde:
pl: Wartość:
sv: Värde:
tr: Değer:
uk: Знач.:
zh_cn: 数值(Val):
zh_tw: 數值：

# CCurveControl|
source: Interp:
ar: استقطاب:
es: Intérp:
he: פענוח:
tr: Aradeğerlenen:
uk: Ітерпр.:
zh_cn: 插值(Interp):
zh_tw: 插值：

# CurveScene|
source: Delete Point
ar: احذف النقطة
ca: Suprimeix el punt
eo: Forigi Punkton
es: Borrar punto
fr: Supprimer un point
he: מחיקת נקודה
it: Elimina punto
nl: Punt verwijderen
pl: Usuń punkt
pt_br: Excluir ponto
sl: Zbriši točko
sv: Ta bort punkt
tr: Noktayı Sil
uk: Вилучити точку
zh_cn: 删除点
zh_tw: 刪除點

# ExprCurve|
source: Selected Position:
ar: الموقع المختار:
ca: Posició seleccionada:
eo: Elektita Pozicio:
es: Posición seleccionada:
fr: Position sélectionnée :
he: מקום נבחר:
it: Posizione selezionata:
nl: Geselecteerde positie:
pl: Wybrane położenie:
pt_br: Posição selecionada:
sl: Izbrana pozicija:
sv: Vald position:
tr: Seçili Konum:
uk: Вибрана позиція:
zh_cn: 选定的位置:
zh_tw: 已選取位置：

# ExprCurve|
source: Selected Value:
ar: القيمة المختارة:
ca: Valor seleccionat:
eo: Elektita Valoro:
es: Valor seleccionado:
fr: Valeur sélectionnée :
he: ערך נבחר:
it: Valore selezionato:
nl: Geselecteerde waarde:
pl: Zaznaczona wartość:
pt_br: Valor selecionado:
sl: Izbrana vrednost:
sv: Valt värde:
tr: Seçili Değer:
uk: Вибране значення:
zh_cn: 选定的数值:
zh_tw: 已選取數值：

# ExprCurve|
source: Interp:
ar: استقطاب:
eo: Interpreto:
es: Intérp:
he: פענוח:
tr: Aradeğerlenen:
uk: Ітерпр.:
zh_cn: 插值(Interp):
zh_tw: 插值：

# ExprCurve|
source: None
ar: لا شيء
ca: Cap
eo: Neniu
es: Ninguna
fr: Aucun
he: ללא
it: Nessuno
nl: Geen
pl: Brak
pt_br: Nenhum
sl: Nobena
sv: Inget
tr: Yok
uk: Немає
zh_cn: None(无)
zh_tw: 無

# ExprCurve|
source: Linear
ar: خطي
ca: Lineal
eo: Lineara
es: Lineal
fr: Linéaire
he: קווי
it: Lineare
nl: Lineair
pl: Liniowa
sl: Linearno
sv: Linjärt
tr: Doğrusal
uk: Лінійний
zh_cn: Linear(线性)
zh_tw: 線性

# ExprCurve|
source: Smooth
ar: سلس
ca: Suavitzat
eo: Glata
es: Suave
fr: Doux
he: חלק
it: Smussatura
nl: Glad
pl: Wygładzona
pt_br: Suave
sl: Gladko
sv: Jämnt
tr: Pürüzsüz
uk: Згладжування
zh_cn: Smooth(平滑)
zh_tw: 平滑

# ExprCurve|
source: Spline
fr: Courbe
he: ספליין/Spline
pl: Krzywa sklejana
sl: Zlepek
tr: Eğri
uk: Сплайни
zh_cn: Spline(样条曲线)
zh_tw: 樣條曲線 (spline)

# ExprCurve|
source: MSpline
he: ספליין מונוטוני/MSpline
sl: MZlepek
tr: M-Eğri
uk: M-сплайни
zh_cn: MSpline(单调样条曲线)
zh_tw: M樣條曲線 (MSpline)

# ExprCurve|
source: &Expand...
ar: &وسِّع...
ca: &Expandeix...
eo: &Vastigi...
es: &Expandir…
fr: Développ&er...
he: ה&רחבה…
it: &Espandi...
nl: Uitvouw&en...
pl: &Rozwiń...
pt_br: &Expandir...
sl: Razširi...
sv: &Expandera...
tr: &Genişlet...
uk: &Розгорнути…
zh_cn: 展开(&E)…
zh_tw: 放大窗格(&E)…

# ExprEditor|
source: Expression Editor
ar: محرِّر العبارات
ca: Editor d'expressions
eo: Esprimredaktilo
es: Editor de expresiones
fr: Éditeur d'expressions
he: עורך הביטויים
it: Editor delle espressioni
nl: Editor voor expressies
pl: Edytor wyrażeń
pt_br: Editor de expressão
sl: Urejevalnik izraza
sv: Uttryckseditor
tr: İfade Düzenleyici
uk: Редактор виразів
zh_cn: 表达式编辑器
zh_tw: 運算式編輯器

# ExprFileDialog|
source: Open
ar: افتح
ca: Obre
eo: Malfermu
es: Abrir
fr: Ouvrir
he: פתיחה
it: Apri
nl: Openen
pl: Otwórz
pt_br: Abrir
sl: Odpri
sv: Öppna
tr: Aç
uk: Відкрити
zh_cn: 打开
zh_tw: 開啟

# ExprFileDialog|
source: Favorites
ar: المفضّلة
ca: Preferides
eo: Plej ŝatataj
es: Favoritos
fr: Favoris
he: מועדפים
it: Preferiti
nl: Favorieten
pl: Ulubione
pt_br: Favoritos
sl: Priljubljene
sv: Favoriter
tr: Sık Kullanılanlar
uk: Улюблене
zh_cn: 常用
zh_tw: 最愛

# ExprTextEdit|
source: Pop-up Help
ar: تعليمات منبثقة
ca: Ajuda emergent
eo: Pop-up Helpo
es: Ayuda emergente
fr: Aide contextuelle
he: עזרה קופצת
it: Aiuto a comparsa
nl: Help pop-up
pl: Pomoc podręczna
pt_br: Ajuda flutuante
sl: Pogovorno okno pomoči
sv: Hjälpruta
tr: Açılır Yardım Penceresi
uk: Контекстна довідка
zh_cn: 浮动式帮助
zh_tw: 浮動說明
