Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# ExprControlCollection|
source: Add new variable
ar: أضِف متغيرًا جديدًا
ca: Afegeix una variable nova
eo: Aldonu novan variablon
es: Añadir nueva variable
fr: Ajouter une nouvelle variable
he: הוספת משתנה חדש
it: Aggiungi una nuova variabile
nl: Nieuwe variabele toevoegen
pl: Dodaj nową zmienną
pt_br: Adicionar nova variável
sl: Dodaj novo spremenljivko
sv: Lägg till ny variabel
tr: Yeni değişken ekle
uk: Додати нову змінну
zh_cn: 新增变量
zh_tw: 加入新變數

# ErrorMessages|
source: Expected string or float[d]
ar: المتوقَّع هو string أو float[d]
ca: S'esperava «string» o «float[d]»
eo: Atendis ĉenon aŭ float[d]
es: Se esperaba string o float[d]
fr: Flottant ou chaîne attendus [d]
he: אמור היה להיות מחרוזת או שבר עשרוני[d]
it: Stringa o float[d] atteso
nl: String (tekenreeks) verwacht of float[d]
pl: Oczekiwany ciąg znaków lub float[d]
pt_br: Texto ou ponto flutuante esperado [d]
sl: Pričakovana string ali float[d]
sv: Förväntade sträng eller flyttal[d]
tr: Dizi veya kayan noktalı değer[d] bekleniyordu
uk: Мав бути рядок або float[d]
zh_cn: 需要 string 或者 float[d]
zh_tw: 預期應為字串 (string) 或浮點陣列 (float[d])

# ErrorMessages|
source: Expected float[d]
ar: المتوقَّع هو float[d]
ca: S'esperava «float[d]»
eo: Atendis float[d]
es: Se esperaba float[d]
fr: Flottant attendu [d]
he: אמור להיות שבר עשרוני[d]
it: float[d] atteso
nl: float[d] verwacht
pl: Oczekiwany float[d]
pt_br: Ponto flutuante esperado [d]
sl: Pričakovana float[d]
sv: Förväntade flyttal[d]
tr: Kayan noktalı değer[d] bekleniyordu
uk: Мало бути float[d]
zh_cn: 需要 float[d]
zh_tw: 預期應為浮點陣列 (float[d])

# ErrorMessages|
source: Expected float[%1]
ar: المتوقَّع هو float[%1]
ca: S'esperava «float[%1]»
eo: Atendis float[%1]
es: Se esperaba float[%1]
fr: Flottant attendu [%1]
he: אמור להיות שבר עשרוני[%1]
it: float[%1] atteso
nl: float[%1] verwacht
pl: Oczekiwano float[%1]
pt_br: Ponto flutuante esperado [%1]
sl: Pričakovana float[%1]
sv: Förväntade flyttal[%1]
tr: Kayan noktalı değer[%1] bekleniyordu
uk: Мало бути float[%1]
zh_cn: 需要 float[%1]
zh_tw: 預期應為含 %1 項的浮點陣列 (float[%1])

# ErrorMessages|
source: Type mismatch, first: '%1'; second: '%2'
ar: عدم توافق في النوع، الأول: '%1'؛ الثاني: '%2'
ca: No coincideixen els tipus, primer: «%1», segon: «%2»
eo: Tip-miskongruo, unue: '%1'; dua: '%2'
es: El tipo no coincide; primero: «%1»; segundo: «%2»
fr: Incohérence de type, premier arg : « %1 » ; second arg : « %2 »
he: סתירת סוג, ראשון: ‚%1’, שני: ‚%2’
it: Tipo non corrispondente, primo: «%1»; secondo «%2»
nl: Types kloppen niet, eerst: '%1'; daarna: '%2'
pl: Niezgodność rodzaju, pierwszy: '%1'; drugi: '%2'
pt_br: Digite incompatibilidade, primeiro: '%1'; segundo: '%2'
sl: Neujemanje tipov, prvo: '%1'; drugo: '%2'
sv: Typmissanpassning, första: '%1', andra: '%2'
tr: Tür uyuşmazlığı; önce: '%1', sonra: '%2'
uk: Невідповідність типів. Перший: «%1»; другий: «%2»
zh_cn: 类型不匹配，第一个: '%1'; 第二个: '%2'
zh_tw: 類型不符，首項：'%1'；次項：'%2'

# ErrorMessages|
source: Expected float or float[3]
ar: المتوقَّع هو float أو float[3]
ca: S'esperava «float» o «float[3]»
eo: Atendis float aŭ float[3]
es: Se esperaba float o float[3]
fr: Flottant attendu ou flottant [3]
he: אמור להיות שבר עשרוני או שבר עשרוני[3]
it: Float atteso o float[3]
nl: float of float[3] verwacht
pl: Oczekiwany float lub float[3]
pt_br: Ponto flutuante ou flutuação esperada [3]
sl: Pričakovan float ali float[3]
sv: Förväntade flyttal eller flyttal[3]
tr: Kayan noktalı değer veya kayan noktalı değer[3] bekleniyordu
uk: Мало бути float або float[3]
zh_cn: 需要 float 或者 float[3]
zh_tw: 預期應為浮點 (float) 或含 3 項的浮點陣列 (float[3])

# ErrorMessages|
source: Expected '%1' for argument, got '%2'
ar: المتوقَّع هو '%1' للوسيط، لَكِن حصل على '%2'
ca: S'esperava «%1» per a l'argument i s'ha obtingut «%2»
eo: Atendis '%1' por argumento, ricevis '%2'
es: Se esperaba «%1» para el argumento, pero se ha obtenido «%2»
fr: Argument attendu « %1 » mais fourni « %2 »
he: אמור היה להתקבל ‚%1’ כארגומנט, במקום התקבל ‚%2’
it: Atteso «%1» come argomento, ricevuto «%2»
nl: '%1' verwacht voor argument, maar kreeg '%2'
pl: Oczekiwano '%1' jako argumentu, dostano '%2'
pt_br: Esperado '%1' para o argumento, obtido '%2'
sl: Pričakovan argument '%1' , dobil '%2'
sv: Förväntade '%1' som argument, erhöll '%2'
tr: Argüman için '%1' bekleniyordu, '%2' alındı
uk: Аргументом мав бути «%1», а маємо «%2»
zh_cn: 参数需要 '%1' ，但得到了 '%2'
zh_tw: 預期參數應為 '%1'，卻得出 '%2'

# ErrorMessages|
source: Wrong number of arguments, should be 1 to 7
ar: عدد خاطئ من الوسائط، يجب أن يكون من 1 إلى 7
ca: Nombre incorrecte d'arguments, hauria de ser d'1 fins a 7
eo: Malĝusta nombro da argumentoj, devus esti 1 ĝis 7
es: Número incorrecto de argumentos; deben ser de 1 a 7
fr: Nombre incorrect d'arguments. Devrait être entre 1 et 7.
he: כמות הארגומנטים שגויה, אמורה להיות בין 1 ל־7
it: Numero di argomenti non corretto, dovrebbe essere da 1 a 7
nl: Aantal argumenten klopt niet, moet 1 tot 7 zijn
pl: Zła liczba argumentów, powinno być od 1 do 7
pt_br: Número errado de argumentos, deve ser de 1 a 7
sl: Napačno število argumentov, mora biti od 1 do 7
sv: Fel antal argument, ska vara 1 eller 7
tr: Yanlış argüman sayısı, 1-7 arasında olmalı
uk: Помилкова кількість аргументів. Має бути від одного до семи
zh_cn: 参数数量不正确，应为 1 到 7
zh_tw: 不正確的參數數目，應為 1 至 7 項

# ErrorMessages|
source: Wrong number of arguments, should be multiple of 3 plus 1
ar: عدد خاطئ من الوسائط، يجب أن يكون مضاعفًا للـ 3 زائد 1
ca: Nombre incorrecte d'arguments, hauria de ser múltiple de 3 més 1
eo: Malĝusta nombro da argumentoj, devus esti oblo de 3 plus 1
es: Número incorrecto de argumentos, debe ser múltiplo de 3 más 1
fr: Nombre incorrect d'arguments. Devrait être multiple de 3 plus 1.
he: כמות הארגומנטים שגויה, אמורה להיות בכפולות של 3 ועוד 1
it: Numero di argomenti non corretto, dovrebbe essere multiplo di 3 più 1
nl: Aantal argumenten klopt niet, moet veelvoud zijn van 3, plus 1
pl: Zła liczba argumentów, powinna być wielokrotnością 3 plus 1
pt_br: Número errado de argumentos, deve ser múltiplo de 3 mais 1
sl: Napačno število argumentov, mora biti večkratnik 3 plus 1
sv: Fel antal argument, ska vara en multipel av 3 plus 1
tr: Yanlış argüman sayısı, 3'ün katı artı 1 olmalı
uk: Помилкова кількість аргументів. Має бути кратною до 3 плюс 1
zh_cn: 参数数量不正确，应为 3 的倍数加 1
zh_tw: 不正確的參數數目，應為 3 的倍數加 1 項

# ErrorMessages|
source: Wrong number of arguments, should be 1 or more
ar: عدد خاطئ من الوسائط، يجب أن يكون 1 أو أكثر
ca: Nombre incorrecte d'arguments, hauria de ser 1 o més
eo: Malĝusta nombro da argumentoj, devus esti 1 aŭ pli
es: Número incorrecto de argumentos; debe ser 1 o más
fr: Nombre incorrect d'arguments. Devrait être 1 ou plus.
he: מספר הארגומנטים שגוי, אמור להיות אחד או יותר
it: Numero di argomenti non corretto, dovrebbe essere 1 o più
nl: Aantal argumenten klopt niet, moet 1 zijn of meer
pl: Zła liczba argumentów, powinno być 1 lub więcej
pt_br: Número errado de argumentos, deve ser 1 ou mais
sl: Napačno število argumentov, mora biti 1 ali več
sv: Fel antal argument, ska vara 1 eller fler
tr: Yanlış argüman sayısı, 1 veya daha çok olmalı
uk: Помилкова кількість аргументів. Має бути один або декілька
zh_cn: 参数数量不正确，应为 1 或者更多
zh_tw: 不正確的參數數目，應為 1 項或更多

# ErrorMessages|
source: First argument must be a string
ar: يجب أن يكون الوسيط الأول سلسلة نصية
ca: El primer argument ha de ser una cadena
eo: Unua argumento devas esti ĉeno
es: El primer argumento debe ser una cadena de texto
fr: Le premier argument doit être une chaîne
he: הארגומנט הראשון חייב להיות מחרוזת
it: Il primo argomento deve essere una stringa
nl: Eerste argument moet een tekenreeks zijn
pl: Pierwszym argumentem musi być ciąg znaków
pt_br: O primeiro argumento deve ser um texto
sl: Prvi argument mora biti niz
sv: Första argumentet måste vara en sträng
tr: İlk argüman bir dizi olmalı
uk: Першим аргументом має бути рядок
zh_cn: 第一个参数必须是字符串
zh_tw: 首項參數必須為字串 (string)

# ErrorMessages|
source: Incomplete format specifier
ar: محدِّد تنسيق غير مكتمل
ca: Especificador incomplet de format
eo: Nekompleta formato-specifilo
es: Especificador de formato incompleto
fr: Spécificateur de format incomplet
he: מציין תבנית חלקי
it: Specificatore di formato incompleto
nl: Onvolledige format specificatie
pl: Niezupełne określenie formatu
pt_br: Especificador de formato incompleto
sl: Nepopoln določilnik formata
sv: Ofullständig formatspecificering
tr: Tam olmayan biçim belirteci
uk: Неповний специфікатор форматування
zh_cn: 格式区分符不完整
zh_tw: 不完整的格式定義符號

# ErrorMessages|
source: No variable named '%1'
ar: لا يوجد متغير اسمه '%1'
ca: No hi ha cap variable anomenada «%1»
eo: Neniu variablo nomata '%1'
es: No hay ninguna variable con el nombre «%1»
fr: Aucune variable nommée « %1 »
he: אין משתנה בשם ‚%1’
it: Nessuna variabile con nome «%1»
nl: Geen variabele met naam '%1'
pl: Brak zmiennej o nazwie '%1'
pt_br: Nenhuma variável chamada '%1'
sl: Ni spremenljivke z imenom '%1'
sv: Ingen variabel benämnd '%1'
tr: '%1' adında bir değişken yok
uk: Немає змінної із назвою «%1»
zh_cn: 不存在名为 '%1' 的变量
zh_tw: 沒有名為 '%1' 的變數

# ErrorMessages|
source: Function '%1' has no definition
ar: لا يوجد تعريف للدالة '%1'
ca: La funció «%1» no té definició
eo: Funkcio '%1' ne havas difinon
es: La función «%1» no tiene definición
fr: La fonction « %1 » n'a aucune définition
he: לפונקציה ‚%1’ אין הגדרה
it: La funzione «%1» non ha definizione
nl: Functie '%1' is niet gedefinieerd
pl: Funkcja '%1' nie ma definicji
pt_br: A função '%1' não tem definição
sl: Funkcija '%1' nima definicije
sv: Funktionen '%1' saknar definition
tr: '%1' işlevinin bir tanımı yok
uk: Функція «%1» не має визначення
zh_cn: 函数 '%1' 没有定义
zh_tw: 函數 '%1' 未被定義

# ErrorMessages|
source: Assignment operation has incorrect type '%1'
ar: عملية الإسناد لديها نوع غير صحيح '%1'
ca: L'operació d'assignació té un tipus incorrecte «%1»
eo: Asigno operacio havas malĝustan tipon '%1'
es: La operación de asignación tiene el tipo incorrecto «%1»
fr: L'opération d'affectation a un type incorrect « %1 »
he: לפעולת ההקצאה יש סוג שגוי ‚%1’
it: L'operazione di assegnazione ha il tipo non corretto «%1»
nl: Toekenning heeft onjuist type '%1'
pl: Działanie przypisania ma niepoprawny rodzaj '%1'
pt_br: A operação de atribuição tem o tipo incorreto '%1'
sl: Operacija prirejanja ima napačen tip '%1'
sv: Tilldelningsoperation har felaktig typ '%1'
tr: Atama işlecinde yanlış '%1' türü var
uk: Операція надання значення належить до некоректного типу «%1»
zh_cn: 赋值运算符类型 '%1' 不正确
zh_tw: 指派操作含不正確的類型 '%1'

# ErrorMessages|
source: Types of conditional are not compatible
ar: أنواع الشرط غير متوافقة
ca: Els tipus de condicional no són compatibles
eo: Tipoj de kondicionalo ne kongruas
es: Los tipos del condicional no son compatibles
fr: Les types de conditions sont incompatibles.
he: סוגי ההתניות אינם תואמים
it: I tipi di condizione non sono compatibili
nl: Types van conditie komen niet met elkaar overeen
pl: Rodzaje warunków nie są zgodne
pt_br: Tipos de condicionais não são compatíveis
sl: Tipi pogojev niso združljivi
sv: Villkorsuttryckens typer är inte kompatibla
tr: Koşulsal türleri uyumlu değil
uk: Тип умов є несумісним
zh_cn: 条件类型不兼容
zh_tw: 條件運算式的類型不兼容

# ErrorMessages|
source: Variable '%1' defined in conditionals inconsistently
ar: المتغير '%1' مُعَرَّف في شروط غير متسقة
ca: La variable «%1» està definida de manera inconsistent en condicional
eo: Variablo '%1' difinita en kondicionaloj malkonsekvence
es: Variable «%1» definida en los condicionales de forma inconsistente
fr: La variable « %1 » est définie de façon incohérente dans les conditions
he: המשתנה ‚%1’ מוגדר בקבועים בצורה לא עקבית
it: Variabile «%1» definita nelle condizioni in modo incoerente
nl: Variabele '%1' in condities is inconsistent gedefinieerd
pl: Zmienna '%1' jest określona w warunkach niejednoznacznie
pt_br: Variável '%1' definida nas condicionais de forma inconsistente
sl: Spremenljivka '%1' je nedosledno določena v pogojih
sv: Variabeln '%1' är inkonsekvent definierad i villkorsuttryck
tr: '%1' değişkeni, koşulsallarda tutarsızca tanımlanmış
uk: Змінну «%1» визначено несумісним чином
zh_cn: 变量 '%1' 定义条件不一致
zh_tw: 變數 '%1' 在條件運算區塊內的定義不一致

# ErrorMessages|
source: Too few arguments for function '%1'
ar: عدد قليل جدًا من الوسائط للدالة '%1'
ca: Hi ha pocs arguments indicats per a la funció «%1»
eo: Tro malmultaj argumentoj por funkcio '%1'
es: Faltan argumentos para la función «%1»
fr: Nombre d'arguments insuffisant pour la fonction « %1 »
he: מעט מדי ארגומנטים לפונקציה ‚%1’
it: Troppi argomenti per la funzione «%1»
nl: Te weinig argumenten voor functie '%1'
pl: Zbyt mało argumentów dla funkcji '%1'
pt_br: Poucos argumentos para a função '%1'
sl: Premalo argumentov za funkcijo '%1'
sv: För få argument för funktionen '%1'
tr: '%1' işlevi için pek az argüman
uk: Замало аргументів функції «%1»
zh_cn: 函数 '%1' 的参数过少
zh_tw: 傳送給函數 '%1' 的參數過少

# ErrorMessages|
source: Too many arguments for function '%1'
ar: عدد كبير جدًا من الوسائط للدالة '%1'
ca: Hi ha massa arguments indicats per a la funció «%1»
eo: Tro multaj argumentoj por funkcio '%1'
es: Demasiados argumentos para la función «%1»
fr: Nombre d'arguments trop important pour la fonction « %1 »
he: יותר מדי ארגומנטים לפונקציה ‚%1’
it: Troppi argomenti per la funzione «%1»
nl: Teveel argumenten voor functie '%1'
pl: Zbyt wiele argumentów dla funkcji '%1'
pt_br: Muitos argumentos para a função '%1'
sl: Preveč argumentov za funkcijo '%1'
sv: För många argument för funktionen '%1'
tr: '%1' işlevi için pek çok argüman
uk: Забагато аргументів функції «%1»
zh_cn: 函数 '%1' 的参数过多
zh_tw: 傳送給函數 '%1' 的參數過多

# ErrorMessages|
source: Expression generated type '%1', incompatible with desired type '%2'
ar: العبارة ولَّدَت النوع '%1'، وهو غير متوافق مع النوع المطلوب '%2'
ca: Tipus d'expressió generada «%1», incompatible amb el tipus desitjat «%2»
eo: Esprimo generita tipo '%1', nekongrua kun dezirata tipo '%2'
es: El tipo de expresión generado «%1» es incompatible con el tipo deseado «%2»
fr: Type généré de l'expression « %1 », incompatible avec le type attendu « %2 »
he: הביטוי ייצר את הסוג ‚%1’, שאינו תואם לסוג הרצוי ‚%2’.
it: Tipo di espressione generato «%1», incompatibile con il tipo desiderato «%2»
nl: Expressie genereerde type '%1', incompatibel met gewenst type '%2'
pl: Rodzaj wytworzonego wyrażenia '%1' jest niezgodny z żądanym rodzajem '%2'
pt_br: Expressão gerada tipo '%1', incompatível com o tipo desejado '%2'
sl: Izraz je ustvaril tip '%1', je nezdružljiv z želenim tipom '%2'
sv: Uttryck genererade typen '%1', inkompatibel med önskad typ '%2'
tr: İfadenin ürettiği '%1' türü, istenen '%2' türüyle uyumsuz
uk: Створений виразом тип «%1» є несумісним із бажаним типом «%2»
zh_cn: 表达式生成类型“%1”，不兼容于预期类型“%2”
zh_tw: 運算式的結果為類型 '%1'，與目標類型 '%2' 不兼容

# ErrorMessages|
source: Syntax error near '%1'
ar: خطأ في بناء الجملة بالقرب من '%1'
ca: Error de sintaxi a prop de «%1»
eo: Sintaksoeraro proksime de '%1'
es: Error de sintaxis próximo a «%1»
fr: Erreur de syntaxe à proximité de « %1 »
he: שגיאת תחביר ליד ‚%1’
it: Errore di sintassi vicino a «%1»
nl: Syntaxisfout nabij '%1'
pl: Błąd składni w pobliżu '%1'
pt_br: Erro de sintaxe próximo a '%1'
sl: Skladenjska napaka blizu '%1'
sv: Syntaxfel nära '%1'
tr: '%1' yakınında sözdizim hatası
uk: Синтаксична помилка поряд із «%1»
zh_cn: 在 '%1' 附近发生语法错误
zh_tw: 語法錯誤——在 '%1' 附近

# ErrorMessages|
source: Unexpected end of expression near '%1'
ar: نهاية غير متوقَّعة للعبارة بالقرب من '%1'
ca: Final inesperat de l'expressió a prop de «%1»
eo: Neatendita fino de esprimo proksime de '%1'
es: Fin de expresión no esperado próximo a «%1»
fr: Fin inattendue d'expression à proximité de « %1 »
he: סוף הביטוי ליד ‚%1’ מפתיע
it: Fine di espressione inattesa vicino a «%1»
nl: Onverwacht einde van expressie nabij '%1'
pl: Nieoczekiwany koniec wyrażenia w pobliżu '%1'
pt_br: Fim de expressão inesperada próximo a '%1'
sl: Nepričakovan konec izraza blizu '%1'
sv: Oväntat slut på uttryck nära '%1'
tr: '%1' yakınında beklenmedik ifade sonu
uk: Неочікуване завершення виразу поряд із «%1»
zh_cn: 在 '%1' 附近表达式意外结束
zh_tw: 未預期運算式的終結——在 '%1' 附近

# ErrorMessages|
source: Unexpected end of format string
ar: نهاية غير متوقَّعة لسلسلة التنسيق
ca: Final inesperat del format de la cadena
eo: Neatendita fino de formata ĉeno
es: Fin no esperado de la cadena de formato
fr: Fin inattendue de la chaîne de formatage
he: סוף מחרוזת תבנית שגויה
it: Fine inattesa della stringa di formato
nl: Onverwacht einde van format string
pl: Nieoczekiwany koniec ciągu z formatowaniem
pt_br: Fim inesperado do texto de formato
sl: Nepričakovan konec niza formata
sv: Oväntat slut på formatsträng
tr: Biçim dizinin beklenmedik sonu
uk: Неочікуване завершення рядка форматування
zh_cn: 格式字符串意外结束
zh_tw: 未預期格式字串的終結

# ErrorMessages|
source: Invalid format string, only %v or %f is allowed
ar: سلسلة تنسيق غير صالحة، يُسمَح فقط بـ %v أو %f
ca: Format de la cadena no vàlid, només es permet %v o %f
eo: Nevalida formata ĉeno, nur %v aŭ %f estas permesitaj
es: Cadena de formato no válida. Solo se permite %v o %f.
fr: Chaîne de formatage non valable. Seuls « %v » ou « %f » sont autorisés.
he: מחרוזת תבנית שגויה, מותר רק ‎%v ו־‎%f
it: Formato non valido, è consentito solo %v o %f
nl: Ongeldige format string, alleen %v en %f zijn toegestaan
pl: Nieprawidłowy format ciągu znaków, dopuszczalne są tylko %v oraz %f
pt_br: Texto de formato inválido, apenas %v ou %f são permitidos.
sl: Neveljaven niz formata, dovoljen je samo %v ali %f
sv: Ogiltig formatsträng, bara %v eller %f är tillåtna
tr: Geçersiz biçim dizisi, yalnızca %v veya %f olabilir
uk: Некоректний рядок форматування. Можна використовувати лише %v або %f
zh_cn: 无效的格式字符串，只可使用 %v 或者 %f
zh_tw: 無效的格式字串，只容許 %v 或 %f

# ErrorMessages|
source: Wrong number of arguments for format string
ar: عدد خاطئ من الوسائط لسلسلة التنسيق
ca: Nombre incorrecte d'arguments per al format de la cadena
eo: Malĝusta nombro da argumentoj por formata ĉeno
es: Número incorrecto de argumentos para la cadena de formato
fr: Nombre incorrect d'arguments pour la chaîne de formatage.
he: מספר הארגומנטים למחרוזת התבנית שגוי
it: Numero di argomenti non corretto per la stringa di formato
nl: Aantal argumenten voor format string klopt niet
pl: Zła liczba argumentów dla ciągu z formatem
pt_br: Número errado de argumentos do texto de formato
sl: Napačno število argumentov za niz formata
sv: Fel antal argument för formatsträng
tr: Biçim dizisi için yanlış argüman sayısı
uk: Помилкова кількість аргументів для рядка форматування
zh_cn: 格式字符串的参数数量错误
zh_tw: 格式字串的參數數目不正確

# ErrorMessages|
source: Unknown error (message = %1)
ar: خطأ غير معروف (رسالة = %1)
ca: Error desconegut (missatge = %1)
eo: Nekonata eraro (mesaĝo = %1)
es: Error desconocido (mensaje = %1)
fr: Erreur inconnue (message = %1)
he: שגיאה לא ידועה (הודעה = %1)
it: Errore sconosciuto (messaggio = %1)
nl: Onbekende fout (melding=%1)
pl: Nieznany błąd (wiadomość = %1)
pt_br: Erro desconhecido (mensagem = %1)
sl: Neznana napaka (sporočilo = %1)
sv: Okänt fel (meddelande = %1)
tr: Bilinmeyen hata (ileti = %1)
uk: Невідома помилка (повідомлення = %1)
zh_cn: 未知错误 (消息 = %1)
zh_tw: 未知錯誤 (message = %1)

# ExprAddDialog|
source: Variable
ar: متغير
eo: Variablo
he: משתנה
it: Variabile
nl: Variabele
pl: Zmienna
pt_br: Variável
sl: Spremenljivka
sv: Variabel
tr: Değişken
uk: Змінна
zh_cn: Variable(变量)
zh_tw: 變數

# ExprAddDialog|
source: Lookup
ar: بحث
ca: Cerca
eo: Serĉu
es: Búsqueda
fr: Rechercher
he: איתור
it: Ricerca
nl: Opzoeken
pl: Znajdź
pt_br: Procurar
sl: Pogled
sv: Slå upp
tr: Ara
uk: Пошук
zh_cn: Lookup(查找)
zh_tw: 查找

# ExprAddDialog|
source: Curve
ar: منحنى
ca: Corba
eo: Kurbo
es: Curva
fr: Courbe
he: עקומה
it: Curva
nl: Kromme
pl: Krzywa
pt_br: Curva
sl: Krivulja
sv: Kurva
tr: Eğri
uk: Крива
zh_cn: Curve(曲线)
zh_tw: 曲線

# ExprAddDialog|
source: Color Curve
ar: منحنى لوني
ca: Corba de color
eo: Kolora Kurbo
es: Curva de color
fr: Colorer la courbe
he: עקומת צבע
it: Curva di colore
nl: Kleurkromme
pl: Krzywa barwy
pt_br: Curva de cor
sl: Barvna krivulja
sv: Färgkurva
tr: Renk Eğrisi
uk: Крива кольорів
zh_cn: Color Curve(颜色曲线)
zh_tw: 色彩曲線

# ExprAddDialog|
source: Default
ar: مبدئي
ca: Predeterminat
eo: Defaŭlte
es: Por omisión
fr: Par défaut
he: ברירת מחדל
it: Predefinita
nl: Standaard
pl: Domyślne
pt_br: Padrão
sl: Privzeto
sv: Förval
tr: Öntanımlı
uk: Типова
zh_cn: Default(默认值)
zh_tw: 預設

# ExprAddDialog|
source: Min
ar: الأدنى
ca: Mín
es: Mín
he: מזערי
pt_br: Mín
tr: En Az
uk: Мін.
zh_cn: Min(最小值)
zh_tw: 最小

# ExprAddDialog|
source: Max
ar: الأقصى
ca: Màx
eo: Maks
es: Máx
he: מרבי
pl: Maks
pt_br: Máx
tr: En Çok
uk: Макс.
zh_cn: Max(最大值)
zh_tw: 最大

# ExprAddDialog|
source: Int
ar: صحيح
ca: Enter
fr: Ent
he: מספר שלם
sv: Heltal
tr: Tamsayı
uk: Ціле
zh_cn: Int(整数)
zh_tw: 整數 (int)

# ExprAddDialog|
source: Float
ar: عائم
ca: Flotant
fr: Flottant
he: שבר עשרוני
pl: Liczba zmiennoprzecinkowa
pt_br: Ponto flutuante
sv: Flyttal
tr: Kayan Noktalı Değer
zh_cn: Float(浮点)
zh_tw: 浮點 (float)

# ExprAddDialog|
source: Vector
ar: متجه
eo: Vektoro
fr: Vecteur
he: וקטור
it: Vettore
pl: Wektor
pt_br: Vetor
sl: Vektor
sv: Vektor
tr: Vektör
uk: Вектор
zh_cn: Vector(矢量)
zh_tw: 向量 (vector)

# ExprAddDialog|
source: Color
ar: لون
eo: Koloro
fr: Couleur
he: צבע
it: Colore
nl: Kleur
pl: Barwa
pt_br: Cor
sl: Barva
sv: Färg
tr: Renk
uk: Колір
zh_cn: Color(颜色)
zh_tw: 色彩

# ExprAddDialog|
source: Rainbow
ar: قوس قزح
ca: Arc de Sant Martí
eo: Ĉielarko
es: Arcoíris
fr: Arc-en-ciel
he: קשת בענן
it: Arcobaleno
nl: Regenboog
pl: Tęcza
pt_br: Arco-íris
sl: Mavrica
sv: Regnbåge
tr: Gökkuşağı
uk: Веселка
zh_cn: Rainbow(彩虹色)
zh_tw: 彩虹

# ExprAddDialog|
source: Shades of Gray
ar: تدرجات الرمادي
ca: Ombres de gris
eo: Ombroj de Griza
es: Tonos de gris
fr: Nuances de gris
he: גווני אפור
it: Sfumature di grigio
nl: Grijswaarden
pl: Odcienie szarości
pt_br: Tons de cinza
sl: Odtenki sive
sv: Gråskala
tr: Grinin Tonları
uk: Відтінки сірого
zh_cn: Shades of Gray(灰度色)
zh_tw: 灰階

# ExprAddDialog|
source: Colors
ar: ألوان
eo: Koloroj
es: Colores
fr: Couleurs
he: צבעים
it: Colori
nl: Kleuren
pl: Barwy
pt_br: Cores
sl: Barve
sv: Färger
tr: Renkler
uk: Кольори
zh_cn: Colors(颜色)
zh_tw: 色彩

# ExprAddDialog|
source: Swatch
ar: عينة
ca: Mostra
es: Muestra
fr: Nuancier
he: מקבץ צבעים
it: Campione
nl: Kleurenstaal
pl: Łata
pt_br: Amostra
sl: Vzorec barve
sv: Färgruta
tr: Parça
uk: Зразок
zh_cn: Swatch(色块)
zh_tw: 色板 (swatch)

# ExprAddDialog|
source: string
ar: سلسلة نصية
ca: cadena
eo: ĉeno
es: cadena de texto
fr: chaîne
he: מחרוזת
it: stringa
nl: string (tekenreeks)
pl: ciąg znaków
pt_br: texto
sl: niz
sv: sträng
tr: dizi
uk: рядок
zh_cn: string(字符串)
zh_tw: 字串

# ExprAddDialog|
source: file
ar: ملف
ca: fitxer
eo: dosiero
es: archivo
fr: Fichier
he: קובץ
nl: bestand
pl: plik
pt_br: arquivo
sl: datoteka
sv: fil
tr: dosya
uk: файл
zh_cn: file(文件)
zh_tw: 檔案

# ExprAddDialog|
source: directory
ar: مجلد
ca: directori
eo: dosierujo
es: directorio
fr: dossier
he: תיקייה
it: cartella
nl: map
pl: katalog
pt_br: pasta
sl: direktorij
sv: katalog
tr: dizin
uk: каталог
zh_cn: directory(目录)
zh_tw: 目錄

# ExprAddDialog|
source: String Name
ar: اسم السلسلة النصية
ca: Nom de la cadena
eo: String Nomo
es: Nombre de la cadena de texto
fr: Nom de la chaîne
he: שם המחרוזת
it: Nome stringa
nl: Naam van string
pl: Nazwa ciągu znaków
pt_br: Nome do texto
sl: Ime niza
sv: Strängnamn
tr: Dizi Adı
uk: Назва рядка
zh_cn: String Name(字符串名称)
zh_tw: 字串名稱

# ExprAddDialog|
source: String Type
ar: نوع السلسلة النصية
ca: Tipus de cadena
eo: String Tipo
es: Tipo de cadena de texto
fr: Type de chaîne
he: סוג המחרוזת
it: Tipo stringa
pl: Rodzaj ciągu znaków
pt_br: Tipo de texto
sl: Vrsta niza
sv: Strängtyp
tr: Dizi Türü
uk: Тип рядка
zh_cn: String Type(字符串类型)
zh_tw: 字串類型
