Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: color cnoise4 ( vector v,float t) 4D color noise formed with original perlin noise at location (C2 interpolant)
ar: color cnoise4 ( vector v,float t) ضوضاء لونية رباعية الأبعاد مُشَكَّلَة بضوضاء بيرلين الأصلية في الموقع (مُستقطَب C2)
ca: color cnoise4 ( vector v,float t) Soroll del color en 4D format amb el soroll Perlin original a la ubicació (interpolant C2)
eo: color cnoise4 (vector v,float t) 4D kolorbruo formita kun origina perlina bruo ĉe loko (C2 interpolant)
es: color cnoise4 ( vector v,float t) Ruido de color en 4D formado con el ruido Perlin original de la posición (interpolante C2)
fr: color cnoise4 (vector v, float t) Bruit de couleurs « 4D » constitué par le bruit original de Perlin à cet emplacement (C2 interpolant)
it: color cnoise4 ( vector v,float t) rumore di colore 4D formato con rumore di Perlin originale nella posizione (interpolante C2)
nl: color cnoise4 ( vector v,float t) 4D kleur ruis met teken gevormd met originele perlin ruis op locatie (C2 interpolant)
pl: color cnoise4 ( vector v,float t) Szum kolorowy 4D utworzony z pierwotnego szumu perlin w miejscu (C2 interpolant)
pt_br: color cnoise4 ( vector v,float t) ruído de cor 4D formado com ruído perlin original no local (interpolante C2)
sl: color cnoise4 ( vector v,float t) 4D barvni šum oblikovan z originalnim Perlinovim šumom na lokaciji (C2 interpolacija)
sv: color cnoise4 ( vector v,float t) fyrdimensionellt färgbrus format med ursprungligt perlin brus på plats (C2 interpolant)
tr: color cnoise4(vector v, float t) Konumdaki özgün perlin gürültüsü ile oluşturulmuş, 4B renk gürültüsü (C2 aradeğerlenen)
uk: color cnoise4 ( vector v,float t) Чотиривимірний колірний шум, сформований за допомогою оригінального шуму Перліна у точці (інтерполятор C2)
zh_cn: color cnoise4 ( vector v,float t) 输出 4D 颜色噪声，以原始柏林噪声生成，位置为 (C2 插值函数)
zh_tw: color cnoise4 ( vector v,float t) 4D 色彩雜訊，由原版 Perlin 雜訊 (C2 插值) 產生

# builtin|
source: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion) is a multi-frequency noise function. The base frequency is the same as the "noise" function. The total number of frequencies is controlled by octaves. The lacunarity is the spacing between the frequencies - a value of 2 means each octave is twice the previous frequency. The gain controls how much each frequency is scaled relative to the previous frequency.
ar: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) fbm (الحركة البراونية الكسورية) هي دالة ضوضاء متعددة الترددات. التردد الأساسي هو نفس دالة "noise". يُتحَكَّم في العدد الإجمالي لـ الترددات بواسطة octaves. lacunarity هو التباعد بين الترددات - قيمة 2 تعني أن كل octave هو ضعف التردد السابق. الكسب يتحكم في مدى تقليم كل تردد بالنسبة لـ التردد السابق.
ca: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=0.5) «fbm» (moviment brownià fraccional) és una funció de soroll amb múltiples freqüències. La freqüència base és la mateixa que la funció «noise» (soroll). El nombre total de freqüències està controlat per «octaves» (octaus). La «lacunarity» (lacunaritat) és l'espai entre les freqüències: un valor de 2 vol dir que cada vuitena és el doble de la freqüència anterior. El «gain» (guany) controla quant s'escalarà cada freqüència en relació amb la freqüència anterior.
eo: float fbm(vector v,int oktavoj=6,float lakunareco=2,floatgajno=.5) fbm (Frakta Browniana Movo) estas plurfrekvenca brua funkcio. La baza frekvenco estas la sama kiel la funkcio "bruo". La tutsumo de frekvencoj estas kontrolita per oktavoj. La lakuneco estas la interspaco inter la frekvencoj - valoro de 2 signifas ke ĉiu oktavo estas duoble la antaŭa frekvenco. La gajno kontrolas kiom ĉiu frekvenco estas skalita relative al la antaŭa frekvenco.
es: float fbm(vector v,int octavas=6,float lagunaridad=2,float ganancia=.5) El «fbm» (movimiento browniano fraccionario) es una función de ruido multifrecuencia. La frecuencia base es la misma que la de la función «noise». El número total de frecuencias se controla mediante «octavas». La «lagunaridad» es el espacio entre las frecuencias (un valor de 2 significa que cada octava es el doble de la frecuencia anterior). La «ganancia» controla cuánto se escala cada frecuencia con relación a la frecuencia anterior.
fr: float fbm (vector v, int octaves=6, float lacunarity=2, float gain=0.5) fbm « Fractal Brownian Motion » est une fonction de bruit multi-fréquence. La fréquence de base est la même que la fonction « noise ». Le nombre total de fréquences est contrôlé par octaves. La lacunarité est l'espacement entre les fréquences - une valeur de 2 signifie que chaque octave est deux fois la fréquence précédente. Le gain contrôle de combien chaque fréquence est étendue relativement à la fréquence précédente.
it: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) fbm (moto browniano frazionario) è una funzione di rumore multi-frequenza. La frequenza di base è la stessa della funzione «noise». Il numero totale di frequenze è controllato da ottave. La lacunarità è la spaziatura tra le frequenze - un valore di 2 significa che ogni ottava è due volte la frequenza precedente. Il guadagno controlla quanto ciascuna frequenza viene scalata rispetto alla frequenza precedente.
nl: float fbm(vector v,int octaves=6,float lacunariteit=2,float versterking=.5) fbm (Fractale Brownse beweging) is een multi-frequentie ruis functie. The basis frequentie is gelijk aan de "noise" (ruis) functie. Het totale aantal van de frequenties wordt geregeld met octaves. The lacunariteit regelt deafstand tussen de frequenties - een waarde 2 betekent dat elke octaaf twee keer de voorgaande frequentie is. De versterking regelt de schaal van elke frequentie vergeleken met die van de vorige frequentie.
pl: float fbm(vector v,int oktawy=6,float lakunarność=2,float wzmocnienie=.5) fbm (Fraktalny ruch Browna) jest wieloczęstotliwościową funkcją szumu. Podstawowa częstotliwość jest taka sama jak funkcja "szumu". Całkowita liczba częstotliwości sterowanych przez oktawy. Lakunarność jest odległościąpomiędzy częstotliwościami - wartość równa 2 oznacza, że każda oktawa madwukrotnie wyższą częstotliwość poprzedniej. Wzmocnienie określa o ilekażda częstotliwość jest skalowana względem poprzedniej częstotliwości.
pt_br: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion) é uma função de ruído multifrequêncial. A frequência base é igual à função "noise". O número total de frequências é controlado por <i>octaves</i>. A <i>lacunarity</i> é o espaçamento entre as frequências - um valor de 2 significa que cada oitava é duas vezes a frequência anterior. O <i>gain</i> controla quanto cada frequência é escalada em relação à frequência anterior.
sl: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fraktalno Brownovo gibanje) je večfrekvenčna funkcija šuma. Osnovna frekvenca je enaka funkciji "šuma". Skupno številofrekvenc nadzirajo oktave. Lacunarnost je razmik med frekvencami - vrednost 2 pomeni, da je vsaka oktava dvakratnik prejšnje frekvence. Ojačenje nadzoruje, za koliko je posamezna frekvenca povečanaglede na prejšnjo frekvenco.
sv: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) Funktionen fbm (fraktal Brownsk rörelse) är en brusfunktion med flera frekvenser. Basfrekvensen är samma som funktionen "noise". Det totala antalet frekvenser bestäms av octaves. Värdet lacunarity är avståndet mellan frekvenserna: värdet 2 betyder att varje oktav är den dubbla av den föregående frekvensen. Värdet gain styr hur mycket varje frekvens skalas relativt till den föregående frekvensen.
tr: float fbm(vector v, int oktavlar=6, float eksiklik=2, float kazanç=,5) fbm (Fractal Brownian Motion) çok frekanslı bir gürültü işlevidir. Temel frekans, "gürültü" işleviyle aynıdır. Toplam frekans sayısı oktavlar tarafından denetlenir. Eksiklik, frekanslar arasındaki boşluktur. - 2 değeri, her oktavın önceki frekansın iki katı olduğu anlamına gelir. Kazanç, her frekansın önceki frekansa göre ne kadar ölçeklendirileceğini denetler.
uk: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion або фрактальний броунівський рух) є багаточастотною функцію шуму. Базова частота збігається із частотою функції «noise». Загальна кількість частот керується значенням «octaves». Значення «lacunarity» є інтервалом між частотами — значення 2 означає, що у кожній наступній октаві частота подвоюється. Значення «gain» керує тим, наскільки буде масштабовано кожну частоту відносно попередньої частоти.
zh_cn: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion / 分形布朗运动) 是一个多频率噪声函数 它的基本频率和 noise 函数相同 它的频率总数通过 octaves 控制 lacunarity 是频率之间的间隙，当它为 2 时 代表每一 octave (八度) 的频率是前一八度的 2 倍 gain 控制每个频率相对前一频率如何按比例缩放
zh_tw: float fbm(vector v,int octaves=6,float lacunarity=2,float gain=.5) FBM (Fractal Brownian Motion，碎形布朗運動) 為多個頻率週波雜訊函數。 基本頻率與 noise 函數相同。總週波數目由 octaves 控制。lacunarity 控制週波間距——若參數值為 2 則表示每個 actave 為上一個週波頻率的兩倍。gain 控制每個週波相對於上一個週波的振幅比例。

# builtin|
source: vector vfbm(vector vint octaves=6,float lacunarity=2,float gain=.5)
ar: vector vfbm(vector vint octaves=6,float lacunarity=2,float gain=.5) متجه الحركة البراونية الكسورية
ca: vector vfbm(vector vint octaves=6,float lacunarity=2,float gain=0.5)
eo: vector vfbm(vector vint oktavoj=6,float lakuneco=2, float gajno=.5)
es: vector vfbm(vector vint octavas=6,float lagunaridad=2,float ganancia=.5)
fr: vector vfbm (vector vint octaves=6, float lacunarity=2, float gain=0.5)
nl: vector vfbm(vector vint octaves=6,float lacunariteit=2,float versterking=.5)
pl: vector vfbm(vector v, int oktawy=6, float lakunarność=2, float wzmocnienie=.5 )
tr: vector vfbm(vector vint oktavlar=6, float eksiklik=2, float kazanç=,5)

# builtin|
source: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion) is a multi-frequency noise function. The base frequency is the same as the "noise" function. The total number of frequencies is controlled by octaves. The lacunarity is the spacing between the frequencies - a value of 2 means each octave is twice the previous frequency. The gain controls how much each frequency is scaled relative to the previous frequency.
ar: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (الحركة البراونية الكسورية) هي دالة ضوضاء متعددة الترددات. التردد الأساسي هو نفس دالة "noise". العدد الإجمالي للترددات يُتحَكَّم فيه بواسطة octaves. lacunarity هو التباعد بين الترددات - قيمة 2 تعني أن كل octave هو ضعف التردد السابق. الكسب يتحكم في مدى تقليم كل تردد بالنسبة للتردد السابق.
ca: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=0.5) «fbm» (moviment brownià fraccional) és una funció de soroll amb múltiples freqüències. La freqüència base és la mateixa que la funció «noise» (soroll). El nombre total de freqüències està controlat per «octaves» (octaus). La «lacunarity» (lacunaritat) és l'espai entre les freqüències: un valor de 2 vol dir que cada vuitena és el doble de la freqüència anterior. El «gain» (guany) controla quant s'escalarà cada freqüència en relació amb la freqüència anterior.
eo: float fbm4(vector v,float tempo,int oktavoj=6,float lakunareco=2,float gajno=.5) fbm (Frakta Browniana Moviĝo) estas plurfrekvenca brua funkcio. La baza frekvenco estas la sama kiel la funkcio "bruo". La totala nombro de frekvencoj estas regata de oktavoj. La lakuneco estas la interspaco inter la frekvencoj - valoro de 2 signifas ke ĉiu oktavo estas duoble la antaŭa frekvenco. La gajno kontrolas kiom ĉiu frekvenco estas skalita rilate al la antaŭa frekvenco.
es: float fbm4(vector v,float tiempo,int octavas=6,float lagunaridad=2,float ganancia=.5) El «fbm» (movimiento browniano fraccionario) es una función de ruido multifrecuencia. La frecuencia base es la misma que la de la función «noise». El número total de frecuencias se controla mediante «octavas». La «lagunaridad» es el espacio entre las frecuencias (un valor de 2 significa que cada octava es el doble de la frecuencia anterior). La «ganancia» controla cuánto se escala cada frecuencia con relación a la frecuencia anterior.
fr: float fbm4 (vector v, float time, int octaves=6, float lacunarity=2, float gain=0.5) fbm, « Fractal Brownian Motion », est une fonction de bruit multi-fréquence. La fréquence de base est la même que la fonction « noise ». Le nombre total de fréquences est contrôlé par octaves. La lacunarité est l'espacement entre les fréquences - une valeur de 2 signifie que chaque octave est deux fois la fréquence précédente. Le gain contrôle de combien chaque fréquence est étendue relativement à la fréquence précédente.
it: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (moto browniano frazionario) è una funzione di rumore multi-frequenza. La frequenza di base è la stessa della funzione «noise». Il numero totale di frequenze è controllato da ottave. La lacunarità è la spaziatura tra le frequenze - un valore di 2 significa che ogni ottava è due volte la frequenza precedente. Il guadagno controlla quanto ciascuna frequenza viene scalata rispetto alla frequenza precedente.
nl: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractale Brownse beweging) is een multi-frequentie ruis functie. The basis frequentie is gelijk aan de "noise" (ruis) functie. Het totale aantal van de frequenties wordt geregeld met octaves. The lacunariteit regelt de afstand tussen de frequenties - een waarde 2 betekent dat elke octaaf twee keer de voorgaande frequentie is. De versterking regelt de schaal van elke frequentie vergeleken met die van de vorige frequentie.
pl: float fbm4(vector v,float czas,int oktaves=6,float lakunarność=2,float wzmocnienie=.5) fbm (Fraktalny ruch Browna) jest wieloczęstotliwościową funkcją szumu. Podstawowa częstotliwość jest taka sama jak funkcja "szumu". Całkowita liczba częstotliwości sterowanych przez oktawy. Lakunarność jest odległością pomiędzy częstotliwościami - wartość równa 2 oznacza, że każda oktawa ma dwukrotnie wyższą częstotliwość poprzedniej. Wzmocnienie określa o ile każda częstotliwość jest skalowana względem poprzedniej częstotliwości.
pt_br: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion) é uma função de ruído multifrequencial. A frequência base é igual à função "ruído". O número total de frequências é controlado por oitavas. A lacunaridade é o espaçamento entre as frequências - um valor de 2 significa que cada oitava é duas vezes a frequência anterior. O ganho controla quanto cada frequência é escalada em relação à frequência anterior.
sl: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fraktalno Brownovo gibanje) je večfrekvenčna funkcija šuma. Osnovna frekvenca je enaka funkciji "šuma". Skupno število frekvenc nadzirajo oktave. Lacunarnost je razmik med frekvencami - vrednost 2 pomeni, da je vsaka oktava dvakratnik prejšnje frekvence. Ojačenje nadzoruje, za koliko je posamezna frekvenca povečana glede na prejšnjo frekvenco.
sv: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) Funktionen fbm (fraktal Brownsk rörelse) är en brusfunktion med flera frekvenser. Basfrekvensen är samma som funktionen "noise". Det totala antalet frekvenser bestäms av octaves. Värdet lacunarity är avståndet mellan frekvenserna: värdet 2 betyder att varje oktav är den dubbla av den föregående frekvensen. Värdet gain styr hur mycket varje frekvens skalas relativt till den föregående frekvensen.
tr: float fbm4(vector v, float zaman, int oktavlar=6, float eksiklik=2, float kazanç=,5) fbm (Fractal Brownian Motion) çok frekanslı bir gürültü işlevidir. Temel frekans, "gürültü" işleviyle aynıdır. Toplam frekans sayısı oktavlar tarafından denetlenir. Eksiklik, frekanslar arasındaki boşluktur. - 2 değeri, her oktavın önceki frekansın iki katı olduğu anlamına gelir. Kazanç, her frekansın önceki frekansa göre ne kadar ölçeklendirileceğini denetler.
uk: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion або фрактальний броунівський рух) є багаточастотною функцію шуму. Базова частота збігається із частотою функції «noise». Загальна кількість частот керується значенням «octaves». Значення «lacunarity» є інтервалом між частотами — значення 2 означає, що у кожній наступній октаві частота подвоюється. Значення «gain» керує тим, наскільки буде масштабовано кожну частоту відносно попередньої частоти.
zh_cn: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) fbm (Fractal Brownian Motion / 分形布朗运动) 是一个多频率噪声函数 它的基本频率和 noise 函数相同 它的频率总数通过 octaves 控制 lacunarity 是频率之间的间隙，当它为 2 时 代表每一 octave (八度) 的频率是前一八度的 2 倍 gain 控制每个频率相对前一频率如何按比例缩放
zh_tw: float fbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) FBM (Fractal Brownian Motion，碎形布朗運動) 為多個頻率週波雜訊函數。 基本頻率與 noise 函數相同。總週波數目由 octaves 控制。lacunarity 控制週波間距——若參數值為 2 則表示每個 actave 為上一個週波頻率的兩倍。gain 控制每個週波相對於上一個週波的振幅比例。

# builtin|
source: vector vfbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5)
ar: vector vfbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) متجه الحركة البراونية الكسورية رباعي الأبعاد
ca: vector vfbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=0.5)
eo: vector vfbm4(vector v,float tempo,int oktavoj=6,float lakunareco=2,float gajno=.5)
es: vector vfbm4(vector v,float tiempo,int octavas=6,float lagunaridad=2,float ganancia=.5)
fr: vector vfbm4 (vector v, float time, int octaves=6, float lacunarity=2, float gain=0.5)
nl: vector vfbm4(vector v,float time,int octaves=6,float lacunariteit=2,float versterking=.5)
pl: vector vfbm4(vector v,float czas,int oktawy=6,float lakunarność=2,float wzmocnienie=.5)
tr: vector vfbm4(vector v, float zaman, int oktavlar=6, float eksiklik=2, float kazanç=,5)

# builtin|
source: color cfbm(vector vint octaves=6,float lacunarity=2,float gain=.5)
ar: color cfbm(vector vint octaves=6,float lacunarity=2,float gain=.5) لون الحركة البراونية الكسورية
ca: color cfbm(vector vint octaves=6,float lacunarity=2,float gain=0.5)
eo: color cfbm (vector vint oktavoj=6,float lakuneco=2,float gajno=.5)
es: color cfbm(vector vint octavas=6,float lagunaridad=2,float ganancia=.5)
fr: color cfbm (vector vint octaves = 6, float lacunarity = 2,float gain=0.5)
nl: color cfbm(vector vint octaves=6,float lacunariteit=2,float versterking=.5)
pl: color cfbm(vector vint oktawy=6,float lakunarność=2,float wzmocnienie=.5)
tr: color cfbm(vector vint oktavlar=6, float eksiklik=2, float kazanç=,5)

# builtin|
source: color cfbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5)
ar: color cfbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5) لون الحركة البراونية الكسورية رباعي الأبعاد
ca: color cfbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=0.5)
eo: color cfbm4 (vector v, tempo de float, int oktavoj=6, float lakuneco=2, float gajno=.5)
es: color cfbm4(vector v,float tiempo,int octavas=6,float lagunaridad=2,float ganancia=.5)
fr: color cfbm4 (vector v, float time, int octaves=6, float lacunarity=2, float gain=0.5)
nl: color cfbm4(vector v,float time,int octaves=6,float lacunariteit=2,float versterking=.5)
pl: color cfbm4(vector v,float czas,int oktawy=6,float lakunarność=2,float wzmocnienie=.5)
sv: icolor cfbm4(vector v,float time,int octaves=6,float lacunarity=2,float gain=.5)
tr: color cfbm4(vector v, float zaman, int oktavlar=6, float eksiklik=2, float kazanç=,5)

# builtin|
source: float cellnoise(vector v) cellnoise generates a field of constant colored cubes based on the integer location. This is the same as the prman cellnoise function.
ar: float cellnoise(vector v) تولِّد cellnoise حقلاً من المكعبات ذات الألوان الثابتة بناءً على الموقع الصحيح. هذه هي نفس دالة prman cellnoise.
ca: float cellnoise(vector v) «cellnoise» genera un camp de cubs amb colors constants en funció de la ubicació del nombre enter. És el mateix que la funció «cellnoise» de PRMan.
eo: float cellnoise(vector v) cellnoise generas kampon de konstantaj koloraj kuboj surbaze de la entjera loko. Tio estas sama kiel la prman cellnoise funkcio.
es: float cellnoise(vector v) «cellnoise» genera un campo constante de cubos de color basado en la posición entera. Es idéntica a la función «cellnoise» de PRMan.
fr: float cellnoise (vector v) La fonction « cellnoise » génère un ensemble de cubes constants et colorés selon un emplacement entier. Elle est identique à la fonction « prman » pour le bruit dans les cellules.
he: float cellnoise(וקטור v) רעש תא מייצר שדה של קוביות בצבעים קבועים שמבוססים על מקום המספר השלם. זהה לפונקציית רעש תא של prman ‏(RenderMan מבית Pixar).
it: float cellnoise(vector v) cellnoise genera un campo di cubi colorati costanti in base alla posizione dell'intero. È uguale alla funzione prman cellnoise.
nl: float cellnoise(vector v) cellnoise genereert een veld van constant gekleurde kubussen op basis van de gehele locatie. Dit is gelijk aan de prman cellnoise functie.
pl: float cellnoise(vector v) cellnoise tworzy pole sześcianów o stałej barwie na podstawie położenia liczb całkowitych. Jest to to samo co funkcja szumu komórkowego prman.
pt_br: float cellnoise(vector v) cellnoise gera um campo de cubos coloridos constantes com base no número inteiro da localização. Este é o mesmo que a função cellnoise do prman.
sl: float cellnoise(vector v) cellnoise ustvari polje konstantnih barvnih kock na podlagi lokacije števila. To je enako kot funkcija prman cellnoise.
sv: float cellnoise(vector v) cellnoise genererar ett fält av konstantfärgade kuber baserade på heltaletsplats. Det är samma sak som prman funktionen cellnoise.
tr: float cellnoise(vector v) cellnoise, tamsayı konumuna göre sabit bir renkli küpler alanı üretir. Bu, prman cellnoise işlevi ile aynıdır.
uk: float cellnoise(vector v) cellnoise створює поле кубів розфарбованих сталим кольором на основі цілочисельного розташування вершин. Ця функція збігається із функцією cellnoise prman.
zh_cn: float cellnoise(vector v) cellnoise 会在一片区域中依据整数位置生成一片带有恒定颜色的方块 它和 PRMan cellnoise function 功能一致
zh_tw: float cellnoise(vector v) 產生一系列基於整數位置固定上色的立方體。 與 prman cellnoise 函數相同。
