Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: color saturate(color val, float amt) Scale saturation of color by amt. The color is scaled around the rec709 luminance value, and negative results are clamped at zero.
ar: color saturate(color val, float amt) قلّم تشبع اللون بـ amt. يُقَلَّم اللون حول قيمة لمعان rec709، والنتائج السلبية تُقيَّد عند الصفر.
ca: color saturate(color val, float amt) Escala de saturació del color per «amt». El color s'escala al voltant del valor de luminància Rec. 709 i els resultats negatius es mantenen a zero.
eo: color saturate(color val, float amt) Skali saturiĝon de koloro je amt. La koloro estas skalita ĉirkaŭ la rec709-lumeco, kaj negativaj rezultoj estas fiksitaj ĉe nulo.
es: color saturate(color val, float cantidad) Escalar la saturación de color en «cantidad». El color se escala en torno al valor de luminancia rec709, mientras que los valores negativos se recortan a cero.
fr: color saturate (color val, float amt) Réduire la saturation de couleurs par amt. La couleur est réduite d'environ de la valeur de luminance « rec709 », et les résultats négatifs sont calés à zéro.
he: color saturate(color val, float amt) שינוי קנה המידה של רוויית צבע ב־amt. הצבע משתנה סביב ערך הארה של rec709, ותוצאות שליליות נקטעות באפס.
it: color saturate(color val, float amt) Scala la saturazione del colore di amt. Il colore viene ridimensionato attorno al valore di luminanza di rec709, e i risultati negativi sono fissati a zero.
nl: color saturate(color getal, float amt) Kleurverzadiging schalen met amt. De kleur wordt geschaald rond de luminantiewaarde rec709, en negatieve resultaten worden beperkt tot nul.
pl: color saturate(color val, float amt) Skaluje nasycenie barwy o wartość "amt". Barwa jest skalowana wokół wartości luminancji rec709, a wartości ujemne są przycinane do zera.
pt_br: color saturate(color val, float amt) Escala de saturação de cor por quantidade. A cor é dimensionada em torno do valor de luminância rec709, e os resultados negativos são fixados em zero.
sl: color saturate(color val, float amt) Lestvico nasičenosti barve pomnoži z amt. Barva je pomanjšana okoli vrednosti osvetlitve rec709, negativni rezultati pa so pritrjeni na nič.
sv: color saturate(color val, float amt) Skala färgmättnaden med amt. Färgen skalas omkring rec709 luminansvärde, och negativa resultat tvingas till noll.
tr: color saturate(color değer, float tutar) Renk doygunluğunu tutar kadar ölçeklendir. Renk, rec709 aydınlık değeri çevresinde ölçeklendirilmiştir ve negatif değerler 0'da kenetlenmiştir.
uk: color saturate(color val, float amt) Масштабує насиченість кольору на amt. Колір буде масштабовано навколо значення освітленості rec709, від'ємні результати буде обрізано до нуля.
zh_cn: color saturate(color val, float amt) 按照 amt 缩放颜色的饱和度 颜色将按照 rec.709 亮度值进行缩放 负值的结果将被压缩为零
zh_tw: color saturate(color val, float amt) 將飽和度乘以 amt。 色彩會根據 rec709 的光度值按比例縮放， 而負數的結果會變為 0。

# builtin|
source: float rand ( [float min, float max], [float seed] ) Random number between [min, max] (or [0, 1] if unspecified). If a seed is supplied, it will be used in addition to the internal seeds and may be used to create multiple distinct generators.
ar: float rand ( [float min, float max], [float seed] ) رقم عشوائي بين [min, max] (أو [0, 1] إذا لَم يُحَدَّد). إذا زُوِّدَت بذرة، تُستخدَم بالإضافة إلى البذور الداخلية و قد تُستخدَم لإنشاء مولدات مميزة متعددة.
ca: float rand ( [float min, float max], [float seed] ) Nombre aleatori entre [min, max] (o [0, 1] si no s'especifica). Si se subministra una llavor, s'usarà a més de les llavors internes i es podrà utilitzar per a crear múltiples generadors diferents.
eo: float rand ( [float min, float max], [float seed] ) Hazarda nombro inter [min, max] (aŭ [0, 1] se nespecifita). Se semo estas liverita, ĝi estos uzata aldone al la internaj semoj kaj povas esti uzata por krei plurajn apartajn generatorojn.
es: float rand ( [float mín, float máx], [float semilla] ) Número aleatorio entre [mín, máx] (o [0, 1] si no se especifican). Si se proporciona una «semilla», se usará adicionalmente a las semillas internas; se puede usar para crear múltiples generadores distintos.
fr: float rand ([float min, float max], [float seed] ) Nombre aléatoire entre [min, max](ou [0, 1] si non spécifié). Si une initialisation « seed » est fournie, elle sera utilisée en addition des initialisations internes et pourra être utilisée pour créer de multiples générateurs distincts.
it: float rand ( [float min, float max], [float seme] ) Numero casuale compreso tra [min, max] (o [0, 1] se non specificato). Se viene fornito un seme, sarà utilizzato in aggiunta ai semi interni epuò essere utilizzato per creare più generatori distinti.
nl: float rand ( [float min, float max], [float zaadje] ) Willekeurig getal tussen [min, max] (of [0, 1] indien niet genoemd). Als een zaadje wordt gegeven wordt dat gebruikt naast de interne zaadjes, en kan het worden gebruikt voor het aanmaken van meerdere afzonderlijke generatoren.
pl: float rand ( [float min, float max], [float seed] ) Losowa liczba pomiędzy [min, max] (lub [0, 1] jeśli nie określono). Jeśli podano ziarno losowości, to zostanie ono wykorzystane jako dodatkowe do wewnętrznych ziaren losowości i może być użyte do stworzenia wielu odmiennych generatorów.
pt_br: float rand ( [float min, float max], [float seed] ) Número aleatório entre [mín, máx] (ou [0, 1] se não especificado). Se uma semente (seed) for fornecida, ela será usada adicionalmente às sementes internas e pode ser usado para criar múltiplos geradores distintos.
sl: float rand ( [float min, float max], [float seed] ) Slučajno število med [min, max] (ali [0, 1] če ni določeno). Če je določen brst, bo uporabljen kot dodatek k notranjim brstom inje lahko uporabljen za tvorbo več ločenih generatorjev slučajnih števil.
sv: float rand ( [float min, float max], [float seed] ) Slumptal mellan [min, max] (eller [0, 1] om de inte anges). Om ett frö anges, används det förutom de interna fröerna och kan användas för att skapa flera distinkta generatorer.
tr: float rand([float min, float maks], [float tohum]) [min, maks] (veya belirtilmemişse [0,1] arasında rastgele sayı. Bir tohum sağlanırsa iç tohumlara ek olarak kullanılacaktır ve birden çok birbirinden ayrık üreteç oluşturmak için kullanılabilir.
uk: float rand ( [float min, float max], [float seed] ) Випадкове число у проміжку [min; max] (або [0; 1], якщо проміжок не вказано). Якщо вказано базове значення (seed), його буде використано на додачу до вбудованих базових значень. Цим значенням можна скористатися для створення декількох різних генераторів.
zh_cn: float rand ( [float min, float max], [float seed] ) 在 [min, max] 范围内的随机数字 (如果不指定范围，范围为 [0, 1] )。 如果提供了外部种子，内部种子将和外部种子一同被使用，可以用于编写各种效果独特的生成器。
zh_tw: float rand ( [float min, float max], [float seed] ) [min, max] 之間的隨機數 (不指定範圍的話則為 [0, 1] 之間)。 如果提供 seed (種子) 參數，會與內置的隨機數種子同時使用，可用作建立多個不同的產生器。

# builtin|
source: float hash(float seed1,[float seed2, ...]) Like rand, but with no internal seeds. Any number of seeds may be given and the result will be a random function based on all the seeds.
ar: float hash(float seed1,[float seed2, ...]) مثل rand، ولكن بدون بذور داخلية. قد تُعطى أي عدد من البذور وتكون النتيجة دالة عشوائية تعتمد على كل البذور.
ca: float hash(float seed1,[float seed2, ...]) Com «rand», però sense llavors internes. Es pot indicar qualsevol nombre de llavors i el resultat serà una funció aleatòria basada en totes les llavors.
eo: float hash(float seed1,[float seed2, ...]) Kiel rand, sed sen internaj semoj. Iu ajn nombro da semoj povas esti donita kaj la rezulto estos hazarda funkcio bazita sur ĉiuj semoj.
es: float hash(float semilla1,[float semilla2, …]) Como rand, pero sin semillas internas. Se puede indicar cualquier número de semillas y el resultado será una función aleatoria basada en todas las semillas.
fr: float hash (float seed1, [float seed2,...]) Comme la fonction « rand » mais sans aucune initialisation interne et le résultat sera une fonction aléatoire reposant sur toutes les initialisations.
he: float hash(float seed1,[float seed2, ...]) כמו rand, אבל בלי זרעים פנימיים. אפשר לציין כל מספר של זרעים והתוצאה תהיה פונקציה אקראית שמבוססת על כל הזרעים.
it: float hash(float seed1,[float seed2, ...]) Come rand, ma senza semi interni. Può essere fornito un numero qualsiasi di semi e il risultato sarà una funzione casuale basata su tutti i semi.
nl: float hash(float zaadje1,[float zaadje2, ...]) Als rand, maar zonder interne zaadjes. Elk aantal zaadjes is mogelijk en het gegeven antwoord is afhankelijk van alle gegeven zaadjes.
pl: float hash(float seed1,[float seed2, ...]) Tak jak rand lecz bez wewnętrznych ziaren losowości. Można podać dowolną liczbę ziaren losowości, a wynikiem będzie losowa funkcja na podstawie wszystkich ziaren losowości.
pt_br: float hash(float seed1,[float seed2, ...]) Como rand, mas sem seeds (sementes) internas. Qualquer número de sementes pode ser fornecido e o resultado será uma função aleatória baseada em todas as sementes.
sl: float hash(float seed1,[float seed2, ...]) Kot rand a brez notranjih brstov. Dodati je možno poljubno število brstov in rezultat bo slučajna funkcija na osnovi vseh teh brstov.
sv: float hash(float seed1,[float seed2, ...]) Såsom rand, men utan några interna frön. Godtyckligt antal frön kan anges och resultatet är en slumpfunktion baserad på fröna.
tr: float hash(float tohum1,[float tohum2, ...]) rand gibi; ancak iç tohumu yoktur. Herhangi bir sayıda tohum verilebilir ve sonuç tüm tohumlar temelli rastgele bir işlev olacaktır.
uk: float hash(float seed1,[float seed2, ...]) Подібна до «rand», але без внутрішніх базових значень псевдовипадковості. Можна надавати довільну кількість базових значень (seed). Результатом буде випадкова функція на основі усіх базових значень.
zh_cn: float hash(float seed1,[float seed2, ...]) 和 rand 类似，但不带有内部种子，可以指定任意数量的种子 结果为基于所有种子的随机函数
zh_tw: float hash(float seed1,[float seed2, ...]) 與 rand 函數相似，不過沒有使用內置的隨機數種子。可提供任何數目 的隨機數種子，結果將會是由合併所有種子所得出的隨機數。

# builtin|
source: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Original perlin noise at location (C2 interpolant)
ar: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) ضوضاء بيرلين الأصلية في الموقع (مُستقطَب C2)
ca: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Soroll Perlin original a la ubicació (interpolant C2)
eo: float bruo ( vector v ) float bruo ( float x, float y ) float bruon ( float x, float y, float z ) float bruon ( float x, float y, float z, float w ) Originala perlina bruo je loko (C2 interpolant)
es: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Ruido Perlin original de la posición (interpolante C2)
fr: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Bruit original de Perlin à cet emplacement (C2 interpolant)
it: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Rumore di Perlin originale nella posizione (interpolante C2)
nl: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Originele perlin ruis op locatie (C2 interpolant)
pl: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Pierwotny szum perlin w miejscu (C2 interpolant)
pt_br: float noise (vector v) float noise (float x, float y) float noise (float x, float y, float z) float noise (float x, float y, float z, float w) Ruído perlin original no local (interpolante C2)
sl: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Izvorni Perlinov šum na lokaciji (C2 interpolacija)
sv: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Ursprungligt perlin brus på plats (C2 interpolant)
tr: float noise(vector v ) float noise(float x, float y ) float noise(float x, float y, float z ) float noise(float x, float y, float z, float w ) Konumdaki özgün perlin gürültüsü (C2 aradeğerlenen)
uk: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) Оригінальний шум Перліна у точці (інтерполятора C2)
zh_cn: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) 输出原始柏林噪声，位置为 (C2 插值函数)
zh_tw: float noise ( vector v ) float noise ( float x, float y ) float noise ( float x, float y, float z ) float noise ( float x, float y, float z, float w ) 原版 Perlin 雜訊 (C2 插值)

# builtin|
source: float snoise ( vector v) signed noise w/ range -1 to 1 formed with original perlin noise at location (C2 interpolant)
ar: float snoise ( vector v) ضوضاء مُوَقَّعَة بنطاق -1 إلى 1 مُشَكَّلَة بضوضاء بيرلين الأصلية في الموقع (مُستقطَب C2)
ca: float snoise ( vector v) Soroll signat «w/» amb l'interval -1 a 1 format amb el soroll Perlin original a la ubicació (interpolant C2)
eo: float bruo ( vector v) antaŭsigna bruo kun intervalo -1 ĝis 1 formita kun origina perlina bruo ĉe loko (C2-interpolanto)
es: float snoise ( vector v) Ruido con signo en el intervalo -1 a 1 formado con el ruido Perlin original de la posición (interpolante C2)
fr: float snoise ( vector v) Bruit signé « w/ range -1 » vers 1, constitué par le bruit original de Perlin à l'emplacement (C2 interpolant)
it: float snoise ( vector v) rumore con segno nell'intervallo da -1 a 1 formato con rumore di Perlin originale nella posizione (interpolante C2)
nl: float snoise ( vector v) ruis met teken binnen bereik -1 tot 1 gevormd met originele perlin ruis op locatie (C2 interpolant)
pl: float snoise ( vector v) Szum w zakresie od -1 do 1 utworzony z pierwotnego szumu perlin w miejscu (C2 interpolant)
pt_br: float snoise (vector v) ruído sinalizado com faixa -1 a 1 formado com ruído perlin original no local(Interpolante C2)
sl: float snoise ( vector v) predznačen šun v obsegu od -1 do 1 izoblikovan z izvirnim Perlinovem šumom na lokaciji(C2 interpolacija)
sv: float snoise ( vector v) brus med tecken i intervallet -1 till 1 format med ursprungligt perlin brus på plats (C2 interpolant)
tr: float snoise(vector v) Konumdaki özgün perlin gürültüsü ile oluşturulmuş, -1 ile 1 arası imzalı gürültü (C2 aradeğerlenen)
uk: float snoise ( vector v ) шум з чисел зі знаком у діапазоні від –1 до 1, сформований за допомогою оригінального шуму Перліна у точці (інтерполятор C2)
zh_cn: float snoise ( vector v) 输出有正负之分的噪声，以原始柏林噪声生成，范围为 -1 到 1，位置为 (C2 插值函数)
zh_tw: float snoise ( vector v) 含正負數、範圍為 -1 至 1 的雜訊，由原版 Perlin 雜訊 (C2 插值) 產生

# builtin|
source: vector vnoise ( vector v) vector noise formed with original perlin noise at location (C2 interpolant)
ar: vector vnoise ( vector v) ضوضاء متجه مكونة بضوضاء برلين الأصلية في الموقع (مُستكمِل C2)
ca: vector vnoise ( vector v) Soroll vectorial format amb el soroll Perlin original a la ubicació (interpolant C2)
eo: vector bruo ( vector v) vector bruo formita kun origina perlina bruo ĉe loko (C2-interpolanto)
es: vector vnoise ( vector v) Ruido vectorial formado con el ruido Perlin original de la posición (interpolante C2)
fr: vector vnoise ( vector v) Vecteur de bruit constitué par le bruit original de Perlin à cet emplacement (C2 interpolant)
it: vector vnoise ( vector v) rumore vettoriale formato con rumore di Perlin originale nella posizione (interpolante C2)
nl: vector vnoise ( vector v) vector ruis gevormd met originele perlin ruis op locatie (C2 interpolant)
pl: vector vnoise (vector v) Szum wektorowy utworzony z pierwotnego szumu perlin w miejscu (C2 interpolant)
pt_br: vector vnoise (vector v) ruído vetorial formado com ruído perlin original no local (interpolante C2)
sl: vector vnoise ( vector v) vektorski šum oblikovan z originalnim Perlinovim šumom na lokaciji (C2 interpolacija)
sv: vector vnoise ( vector v) vektorbrus format med ursprungligt perlin brus på plats (C2 interpolant)
tr: vector vnoise(vector v) Konumdaki özgün perlin gürültüsü ile oluşturulmuş vektör gürültüsü (C2 aradeğerlenen)
uk: vector vnoise ( vector v ) векторний шум, сформований за допомогою оригінального шуму Перліна у точці (інтерполятор C2)
zh_cn: vector vnoise ( vector v) 输出有正负之分的矢量噪声，以原始柏林噪声生成，位置为 (C2 插值函数)
zh_tw: vector vnoise ( vector v) 向量雜訊，由原版 Perlin 雜訊 (C2 插值) 產生

# builtin|
source: color cnoise ( vector v) color noise formed with original perlin noise at location (C2 interpolant)
ar: color cnoise ( vector v) ضوضاء لونية مُشَكَّلَة بضوضاء بيرلين الأصلية في الموقع (مُستقطَب C2)
ca: color cnoise ( vector v) Soroll del color format amb el soroll Perlin original a la ubicació (interpolant C2)
eo: color cnoise (vector v) kolorbruo formita kun origina perlin-bruo ĉe loko (C2 interpolanto)
es: color cnoise ( vector v) Ruido de color formado con el ruido Perlin original de la posición (interpolante C2)
fr: color cnoise (vector v) Bruit de couleurs constitué par le bruit original de Perlin à cet emplacement (C2 interpolant)
it: color cnoise ( vector v) rumore di colore formato con rumore di Perlin originale nella posizione (interpolante C2)
nl: color cnoise ( vector v) kleur ruis gevormd met originele perlin ruis op locatie (C2 interpolant)
pl: color cnoise ( vector v) Szum kolorowy utworzony z pierwotnego szumu perlin w miejscu (C2 interpolant)
pt_br: color cnoise (vector v) ruído de cor formado com ruído perlin original no local (interpolante C2)
sl: color cnoise ( vector v) barvni šum oblikovan z originalnim Perlinovim šumom na lokaciji (C2 interpolacija)
sv: color cnoise ( vector v) färgbrus format med ursprungligt perlin brus på plats (C2 interpolant)
tr: color cnoise(vector v) Konumdaki özgün perlin gürültüsü ile oluşturulmuş renk gürültüsü (C2 aradeğerlenen)
uk: color cnoise ( vector v ) колірний шум, сформований за допомогою оригінального шуму Перліна у точці (інтерполятор C2)
zh_cn: color cnoise ( vector v) 输出颜色噪声，以原始柏林噪声生成，位置为 (C2 插值函数)
zh_tw: color cnoise ( vector v) 色彩雜訊，由原版 Perlin 雜訊 (C2 插值) 產生

# builtin|
source: float snoise4 ( vector v,float t) 4D signed noise w/ range -1 to 1 formed with original perlin noise at location (C2 interpolant)
ar: float snoise4 ( vector v,float t) ضوضاء مُوَقَّعَة رباعية الأبعاد بنطاق -1 إلى 1 مُشَكَّلَة بضوضاء بيرلين الأصلية في الموقع (مُستقطَب C2)
ca: float snoise4 ( vector v,float t) Soroll signat en 4D «w/» amb l'interval -1 a 1 format amb el soroll Perlin original a la ubicació (interpolant C2)
eo: float bruo4 (vector v, float t) 4D signita bruo kun intervalo -1 ĝis 1 formita kun origina perlin-bruo ĉe loko (C2 interpolanto)
es: float snoise4 ( vector v,float t) Ruido con signo en 4D en el intervalo -1 a 1 formado con el ruido Perlin original de la posición (interpolante C2)
fr: float snoise4 ( vector v, float t) Bruit « 4D » signé « w/ range -1 » vers 1, constitué par le bruit original de Perlin à l'emplacement (C2 interpolant)
it: float snoise4 ( vector v,float t) rumore 4D con segno nell'intervallo da -1 a 1 formato con rumore di Perlin originale nella posizione (interpolante C2)
nl: float snoise4 ( vector v,float t) 4D ruis met teken, binnen bereik -1 tot 1 gevormd met originele perlin ruis op locatie (C2 interpolant)
pl: float snoise4 ( vector v,float t) Szum 4D ze znakiem w zakresie od -1 do 1 utworzony z pierwotnego szumu perlin w miejscu (C2 interpolant)
pt_br: float snoise4 (vector v,float t) ruído sinalizado 4D com faixa -1 a 1 formado com ruído perlin original nalocalização (C2 interpolante)
sl: float snoise4 ( vector v,float t) 4D predznačen šum v obsegu od -1 do 1 oblikovan z originalnim Perlinovim šumom na lokaciji (C2 interpolacija)
sv: float snoise4 ( vector v,float t) fyrdimensionellt brus med tecken i intervallet -1 till 1 format med ursprungligt perlin brus på plats (C2 interpolant)
tr: float snoise4(vector v, float t) Konumdaki özgün perlin gürültüsü ile oluşturulmuş, -1 ile 1 arası 4B imzalı gürültü (C2 aradeğerlenen)
uk: float snoise4 ( vector v, float t) Чотиривимірний шум з чисел зі знаком у діапазоні від –1 до 1, сформований за допомогою оригінального шуму Перліна у точці (інтерполятор C2)
zh_cn: float snoise4 ( vector v,float t) 输出有正负之分的 4D 噪声，以原始柏林噪声生成，范围为 -1 到 1，位置为 (C2 插值函数)
zh_tw: float snoise4 ( vector v,float t) 4D 且範圍為 -1 至 1 的雜訊，由原版 Perlin 雜訊 (C2 插值) 產生

# builtin|
source: vector vnoise4 ( vector v,float t) 4D vector noise formed with original perlin noise at location (C2 interpolant)
ar: vector vnoise4 ( vector v,float t) ضوضاء مُتَّجِهَة رباعية الأبعاد مُشَكَّلَة بضوضاء بيرلين الأصلية في الموقع (مُستقطَب C2)
ca: vector vnoise4 ( vector v,float t) Soroll vectorial en 4D format amb el soroll Perlin original a la ubicació (interpolant C2)
eo: vector vbruo4 ( vector v, float t) 4D vektora bruo formita kun origina perlina bruo ĉe loko (C2-interpolanto)
es: vector vnoise4 ( vector v,float t) Ruido vectorial en 4D formado con el ruido Perlin original de la posición (interpolante C2)
fr: vector vnoise4 ( vector v, float t) Vecteur de bruit « 4D » constitué par le bruit original de Perlin à cet emplacement (C2 interpolant)
it: vector vnoise4 ( vector v,float t) rumore vettoriale 4D formato con rumore di Perlin originale nella posizione (interpolante C2)
nl: vector vnoise4 ( vector v,float t) 4D vector ruis met teken, binnen bereik -1 tot 1 gevormd met originele perlin ruis op locatie (C2 interpolant)
pl: vector vnoise4 ( vector v,float t) Szum wektorowy 4D utworzony z pierwotnego szumu perlin w miejscu (C2 interpolant)
pt_br: vector vnoise4 ( vector v,float t) ruído de vetor 4D formado com ruído perlin original no local (interpolante C2)
sl: vector vnoise4 ( vector v,float t) 4D vektorski šum oblikovan z originalnim Perlinovim šumom na lokaciji (C2 interpolacija)
sv: vector vnoise4 ( vector v,float t) fyrdimensionellt vektorbrus format med ursprungligt perlin brus på plats (C2 interpolant)
tr: vector vnoise4(vector v, float t) Konumdaki özgün perlin gürültüsü ile oluşturulmuş, 4B vektör gürültüsü (C2 aradeğerlenen)
uk: vector vnoise4 ( vector v, float t) Чотиривимірний векторний шум, сформований за допомогою оригінального шуму Перліна у точці (інтерполятор C2)
zh_cn: vector vnoise4 ( vector v,float t) 输出有正负之分的 4D 矢量噪声，以原始柏林噪声生成，位置为 (C2 插值函数)
zh_tw: vector vnoise4 ( vector v,float t) 4D 向量雜訊，由原版 Perlin 雜訊 (C2 插值) 產生
