Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpolates a set of values to the parameter specified where y1, ..., yn are distributed evenly from [0..1]
ar: float spline(float param,float y1,float y2,float y3,float y4,[...]) يستقطب مجموعة من القيم إلى الوسيط المُحدَّد حيث y1، ...، yn موزعة بالتساوي من [0..1]
ca: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpola un conjunt de valors al paràmetre especificat, on «y1», «...» i «yn» són distribuïts homogèniament des de [0..1]
eo: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpolas aron da valoroj al la parametro specifita kie y1, ..., yn estas distribuitaj egale de [ 0..1]
es: float spline(float parámetro,float y1,float y2,float y3,float y4,[…]) Interpola un conjunto de valores al parámetro especificado, donde y1, …, yn se distribuyen uniformemente desde [0..1]
fr: float spline (float param, float y1, float y2, float y3, float y4, [...]) Interpole un ensemble de valeurs selon le paramètre spécifié, où y1,..., yn sont distribués de façon uniforme entre [0..1].
it: float spline (float param,float y1,float y2,float y3,float y4,[...]) Interpola un insieme di valori nel parametro specificato dove y1, ..., yn sono distribuiti uniformemente da [0...1]
nl: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpoleert een aantal waarden naar de opgegeven parameter, hierin zijn y1,...,y2 gelijkmatig verdeeld over [0..1]
pl: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpoluje zestaw wartości do danego parametru, gdzie y...1, ..., yn są rozłożone równo w zakresie [0..1]
pt_br: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpola um conjunto de valores para o parâmetro especificado onde y1, ..., yn são distribuídos uniformemente de [0..1]
sl: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpolira nabor vrednosti na navedeni parameter, kjer so y1, ..., yn porazdeljeni enakomerno na [0..1]
sv: float spline(float param,float y1,float y2,float y3,float y4,[...]) Interpolerar en uppsättning värden till den angivna parametern där y1, ..., yn distribueras jämt från [0..1]
tr: float spline(float param,float y1,float y2,float y3,float y4,[...]) y1, ..., yn'nin [0..1]'den eşit olarak dağıtıldığı yerde belirtilen parametreye bir dizi değeri aradeğerler
uk: float spline(float param,float y1,float y2,float y3,float y4,[...]) Інтерполює набір значень до вказаного параметра, де y1, ..., yn розподілено рівномірно у проміжку [0, 1]
zh_cn: float spline(float param,float y1,float y2,float y3,float y4,[...]) 将一组数值按照指定参数进行插值 y1 至 yn 的数值在 [0..1] 范围内等距分布
zh_tw: float spline(float param,float y1,float y2,float y3,float y4,[...]) 將 y1, ..., yn 平均分佈在 [0..1] 範圍內，依其計算 param 參數的插值

# builtin|
source: Unable to validate the interpolant type
ar: غير قادر على التحقق من صحة نوع المُستقطِب
ca: No s'ha pogut validar el tipus d'interpolant
eo: Ne eblas validigi la interpolan tipon
es: No se ha podido validar el tipo de interpolación
fr: Impossible de valider le type de l'interpolation
he: לא ניתן לתקף את סוג האינטרפולנט
it: Impossibile convalidare il tipo interpolante
nl: Kon het type interpolant niet valideren
pl: Nie można potwierdzić rodzaju interpolanta
pt_br: Não foi possível validar o tipo de interpolante
sl: Ni mogoče preveriti vrste interpoliranca
sv: Kunde inte validera interpoleringstypen
tr: Aradeğerlenen tür doğrulanamıyor
uk: Не вдалося перевірити тип інтерполянта
zh_cn: 无法验证插值类型
zh_tw: 無法驗證插值類型

# builtin|
source: Invalid interpolant type
ar: نوع مُستقطِب غير صالح
ca: Tipus no vàlid d'interpolant
eo: Nevalida interpola tipo
es: Tipo de interpolación no válido
fr: Type d'interpolation non valable
he: סוג אינטרפולנט שגוי
it: Tipo interpolante non valido
nl: Ongeldig type interpolant
pl: Nieprawidłowy rodzaj interpolanta
pt_br: Tipo de interpolante inválido
sl: Neveljavna vrsta interpoliranca
sv: Ogiltig interpoleringstyp
tr: Geçersiz aradeğerlenen türü
uk: Некоректний тип інтерполянта
zh_cn: 无效插值类型
zh_tw: 無效的插值類型

# builtin|
source: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpolates a 1D ramp defined by control points at 'param'. Control points are specified by triples of parameters pos_i, val_i, and interp_i. Interpolation codes are 0 - none, 1 - linear, 2 - smooth, 3 - spline, 4 - monotone (non oscillating spline)
ar: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) يستقطب مُنحَدَر أحادي البعد مُعَرَّف بنقاط تحكم عند 'param'. تُحَدَّد نقاط التحكم بثلاثيات من الوسائط pos_i، val_i، و interp_i. رموز الاستقطاب هي 0 - لا شيء، 1 - خطي، 2 - سلس، 3 - spline، 4 - أحادي الرتابة (spline غير متذبذب)
ca: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpola una rampa en 1D definida pels punts de control en el «param». Els punts de control s'especifiquen mitjançant triples dels paràmetres «pos_i», «val_i» i «interp_i». Els codis d'interpolació són: 0 - cap, 1 - lineal, 2 - suau, 3 - spline i 4 - monòton (spline no oscil·lant)
eo: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpolas 1D deklivirejon difinitan per kontrolpunktoj ĉe 'param'. Kontrolpunktoj estas specifitaj per triopoj de parametroj pos_i, val_i kaj interp_i. Interpolaj kodoj estas 0 - neniu, 1 - lineara, 2 - glata, 3 - spline, 4 - monotona (ne oscila spline)
es: float curve(float parámetro,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[…]) Interpola una rampa de 1D definida por los puntos de control en «parámetro». Los puntos de control se especifican mediante tripletes de los parámetros pos_i, val_i e interp_i. Los códigos de interpolación son 0 - ninguno, 1 - lineal, 2 - suave, 3 - spline, 4 - monótono (spline no oscilante)
fr: float curve (float param, float pos0, float val0, int interp0, float pos1, float val1, int interp1, [...]) Interpole une rampe « 1D » définie par des points de contrôle de « param ». Les points de contrôle sont spécifiés par des triplets de paramètres « pos_i », « val_i » et « interp_i ». Les codes d'interpolation sont 0 - aucun, 1 - linéaire, 2 - doux, 3 - courbe, 4-monotone (courbe non oscillante).
it: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpola una rampa 1D definita dai punti di controllo in «param». I punti di controllo sono specificati per triple dei parametri pos_i, val_i e interp_i. I codici di interpolazione sono 0 - nessuna, 1 - lineare, 2 - liscia, 3 - spline, 4 - monotona (spline non oscillante)
nl: float curve(float param,float pos0,float waarde0,int interp0,float pos1,float waarde1,int interp1,[...]) Interpoleert 1D helling gedefinieerd door de controlepunten in 'param'. Controlepuntenworden opgegeven met drietallen parameters posi, waardei, and interpi. Interpolatiecodes zijn 0 - geen, 1 - lineair, 2 - glad, 3 - spline, 4 - monotoon (niet-oscillerende spline)
pl: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpoluje rampę 1D określoną punktami tworzącymi poprzez 'param'. Punkty tworzące są określane trójkami parametrów pos_i, val_i oraz interp_i. Kody interpolacji to 0 - brak, 1 - liniowa, 2 - wygładzona, 3 - krzywa sklejana, 4 - monotoniczna (nieoscylacyjna krzywa sklejana)
pt_br: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpola uma rampa 1D definida por pontos de controle em 'param'. Pontos de controle são especificados por triplos de parâmetros pos_i, val_i e interp_i. Os códigos de interpolação são 0 - nenhum, 1 - linear, 2 - suave, 3 - spline, 4 - monótono (spline não oscilante)
sl: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpolira 1D rampo, določeno s kontrolnimi točkami pri 'param'. Kontrolne točke so določene s trojkami parametrov pos_i, val_i in interp_i. Interpolacijske kode so 0 - nič, 1 - linearno, 2 - gladko, 3 - zlepljeno, 4-monotona (ne nihajoči zlepek)
sv: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Interpolerar en endimensionell ramp definierad av styrpunkter i 'param'. Styrpunkter specificeras av tripplar av parametrarna pos_i, val_i och interp_i. Interpolationskoder är 0 - ingen, 1 - linjär, 2 - jämn, 3 - spline, 4-monoton (icke-oscillerande spline)
tr: float curve(float param, float kon0, float değ0, int arad0, float kon1, float değ1, int arad1,[...]) 'param' konumundaki denetim noktaları tarafından tanımlanan bir 1B rampa ara değerler. Denetim noktaları, kon_i, değ_i ve arad_i üçlü parametreleri ile belirtilir. Aradeğerleme kodları: 0 - yok, 1 - doğrusal, 2 - pürüzsüz, 3 - eğri, 4 - tek tonlu (salınmayan eğri)
uk: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) Інтерполює одновимірний набір, які задано контрольними точками для значення param. Контрольні точки задаються трійками параметрів pos_i, val_i і interp_i. Коди інтерполяції: 0 — немає, 1 — лінійна, 2 — згладжена, 3 — сплайни, 4 — монотонна (сплайни без осциляції)
zh_cn: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) 用 param 处给定的控制点对一维梯度进行插值 控制点由三元参数 pos_i、val_i、interp_i 进行指定 0 - none (无)、1 - linear (线性)、2 - smooth (平滑)、3 - spline (样条曲线) 4 - monotone (non-oscillating) spline (单调/非振动样条曲线)
zh_tw: float curve(float param,float pos0,float val0,int interp0,float pos1,float val1,int interp1,[...]) 以控制點定義一個 1D 斜坡，依其計算 param 參數的插值。 控制點根據多組三項連續的參數 pos_i、val_i，以及 interp_i 定義。 插值列舉常數值如下： 0 - 無、1 - 線性、2 - 平滑、3 - 樣條曲線 (spline)、 4 - 單調 (monotone，無振動的樣條)

# builtin|
source: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Interpolates color ramp given by control points at 'param'. Control points are specified by triples of parameters pos_i, val_i, and interp_i. Interpolation codes are 0 - none, 1 - linear, 2 - smooth, 3 - spline, 4 - monotone (non oscillating spline)
ar: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) يستقطب مُنحَدَر لوني مُعطى بنقاط تحكم عند 'param'. تُحَدَّد نقاط التحكم بثلاثيات من الوسائط pos_i، val_i، و interp_i. رموز الاستقطاب هي 0 - لا شيء، 1 - خطي، 2 - سلس، 3 - spline، 4 - أحادي الرتابة (spline غير متذبذب)
ca: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Interpola una rampa definida pels punts de control en el «param». Els punts de control s'especifiquen mitjançant triples dels paràmetres «pos_i», «val_i» i «interp_i». Els codis d'interpolació són: 0 - cap, 1 - lineal, 2 - suau, 3 - spline i 4 - monòton (spline no oscil·lant)
eo: color curve(float param, float pos0, color val0, int interp0, float pos1, color val1, int interp1,[...]) Interpolas kolordeklivon donitan de kontrolpunktoj ĉe 'param'. Kontrolpunktoj estas specifitaj per triopoj de parametroj pos_i, val_i kaj interp_i. Interpolaj kodoj estas 0 - neniu, 1 - lineara, 2 - glata, 3 - spline, 4 - monotona (ne oscila spline)
es: color curve(float parámetro,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[…]) Interpola la rampa de color indicada por los puntos de control de «parámetro». Los puntos de control se especifican mediante tripletes de los parámetros pos_i, val_i e interp_i. Los códigos de interpolación son 0 - ninguno, 1 - lineal, 2 - suave, 3 - spline, 4 - monótono (spline no oscilante)
fr: color curve (float param, float pos0, color val0, int interp0, float pos1, color val1,int interp1,[...]) Interpole une rampe définie par des points de contrôle de « param ». Les points de contrôle sont spécifiés par des triplets de paramètres pos_i, val_i, et interp_i. Les codes d'interpolation sont 0 - aucun, 1 - linéaire, 2 - doux, 3 - courbe, 4 - monotone (courbe non oscillante)
it: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Interpola la scala di colori fornita dai punti di controllo in «param». I punti di controllo sono specificati da triple dei parametri pos_i, val_i e interp_i. I codici di interpolazione sono 0 - nessuna, 1 - lineare, 2 - liscia, 3 - spline, 4 - monotona (spline non oscillante)
nl: color curve(float param,float pos0,float waarde0,int interp0,float pos1,float waarde1,int interp1,[...]) Interpoleert kleurenhelling gedefinieerd door de controlepunten in 'param'. Controlepuntenworden opgegeven met drietallen parameters posi, waardei, and interpi. Interpolatiecodes zijn 0 - geen, 1 - lineair, 2 - glad, 3 - spline, 4-monotoon (niet-oscillerende spline)
pl: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Interpoluje rampę barw określoną punktami tworzącymi poprzez 'param'. Punkty tworzące są określane trójkami parametrów pos_i, val_i oraz interp_i. Kody interpolacji to 0 - brak, 1 - liniowa, 2 - wygładzona, 3 - krzywa sklejana, 4 - monotoniczna (nieoscylacyjna krzywa sklejana)
pt_br: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Interpola a rampa de cores fornecida pelos pontos de controle em 'param'. Pontos de controle são especificados por triplos de parâmetros pos_i, val_i e interp_i. Os códigos de interpolação são 0 - nenhum, 1 - linear, 2 - suave, 3 - spline, 4 - monótono (spline não oscilante)
sl: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Interpolira barvno rampo, določeno s kontrolnimi točkami pri "param". Kontrolne točkeso določene s trojkami parametrov pos_i, val_i in interp_i. Interpolacijske kode so 0 - nič, 1 - linearno, 2 - gladko, 3 - zlepljeno, 4 - monotona (ne nihajoči zlepek)
sv: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Interpolerar en färgramp angiven av styrpunkter i 'param'. Styrpunkter specificeras av tripplar av parametrarna pos_i, val_i och interp_i. Interpolationskoder är 0 - ingen, 1 - linjär, 2 - jämn, 3 - spline, 4-monoton (icke-oscillerande spline)
tr: color curve(float param, float kon0, color değ0, int arad0, float kon1, color değ1, int arad1,[...]) 'param' konumundaki denetim noktaları tarafından tanımlanan bir renk rampası aradeğerler. Denetim noktaları, kon_i, değ_i ve arad_i üçlü parametreleri ile belirtilir. Aradeğerleme kodları: 0 - yok, 1 - doğrusal, 2 - pürüzsüz, 3 - eğri, 4 - tek tonlu (salınmayan eğri)
uk: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) Інтерполює набір кольорів, які задано контрольними точками для значення param. Контрольні точки задаються трійками параметрів pos_i, val_i і interp_i. Коди інтерполяції: 0 — немає, 1 — лінійна, 2 — згладжена, 3 — сплайни, 4 — монотонна (сплайни без осциляції)
zh_cn: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) 用 param 处给定的控制点对颜色梯度进行插值 控制点由三元参数 pos_i、val_i、interp_i 进行指定 0 - none (无)、1 - linear (线性)、2 - smooth (平滑)、3 - spline (样条曲线) 4 - monotone (non-oscillating) spline (单调/非振动样条曲线)
zh_tw: color curve(float param,float pos0,color val0,int interp0,float pos1,color val1,int interp1,[...]) 以控制點定義一個色彩斜坡，依其計算 param 參數的插值。 控制點根據多組三項連續的參數 pos_i、val_i，以及 interp_i 定義。 插值列舉常數值如下： 0 - 無、1 - 線性、2 - 平滑、3 - 樣條曲線 (spline)、 4 - 單調 (monotone，無振動的樣條)

# builtin|
source: getVar(string varName,vector defaultValue) return value of varName if variable exists, otherwise return defaultValue
ar: getVar(string varName,vector defaultValue) أرجِع قيمة varName إذا وُجِدَ المتغير، وإلا فأرجِع defaultValue
ca: getVar(string varName,vector defaultValue) Retorna el valor de «varName» si la variable existeix, en cas contrari retorna «defaultValue»
eo: getVar (string varName, vector defaŭltValoro) redonas valoron de varName se variablo ekzistas, alie redonu defaultValue
es: getVar(string nombreVariable,vector valorPredeterminado) Devuelve el valor de «nombreVariable» si existe dicha variable. En caso contrario devuelve «valorPredeterminado».
fr: getVar (string varName, vector DefaultValue) retourne la valeur de « varName » si la variable existe, sinon retourne « DefaultValue »
he: getVar(מחרוזת varName,וקטור defaultValue) החזרת הערך של varName אם המשתנה קיים, אחרת להחזיר defaultValue
it: getVar (string varName,vector defaultValue) restituisce il valore di varName se la variabile esiste, altrimenti restituisce defaultValue
nl: getVar(string varNaam,vector standaardWaarde) geeft waarde terug van varNaam indien variable bestaat, en anders de standaardWaarde
pl: getVar(string nazwaZmiennej,vector wartośćDomyślna) zwraca wartość nazwaZmiennej, jeśli zmienna istnieje, w przeciwnym przypadku zwraca wartośćDomyślna
pt_br: getVar(string varName,vector defaultValue) valor de retorno de varName se a variável existir; caso contrário, retorne valor padrão
sl: getVar(string varName,vector defaultValue) vrne vrednost varName, če spremenljivka obstaja, sicer vrne defaultValue
sv: getVar(string varName,vector defaultValue) returnera värdet på varName om variabeln finns, returnera annars defaultValue
tr: getVar(string değişkenAdı,vector öntanımlıDeğer) değişken varsa değişkenAdı değerini döndür, yoksa öntanımlıDeğeri döndür
uk: getVar(string varName, vector defaultValue) повертає значення змінної varName, якщо змінна існує, інакше, повертає значення defaultValue
zh_cn: getVar(string varName,vector defaultValue) 如果 varName 变量存在，返回它的值，否则返回 defaultValue
zh_tw: getVar(string varName,vector defaultValue) 如 varName 變數存在，傳回這變數的值，否則傳回 defaultValue

# builtin|
source: float printf(string format,[vec0, vec1, ...]) Prints out a string to STDOUT, Format parameters allowed are "%v" and "%f". Return parameter is empty, but must be assigned to a variable.
ar: float printf(string format,[vec0, vec1, ...]) اطبع سلسلة نصية إلى STDOUT، وسائط التنسيق المسموح بها هي "%v" و "%f". وسيط العودة فارغ، ولكن يجب إسناده إلى متغير.
ca: printf(string format,[vec0, vec1, ...]) Imprimeix una cadena a la sortida estàndard, el format permès dels paràmetres és «%v» i «%f». El retornat pel paràmetre estarà buit, però s'haurà d'assignar a una variable.
eo: float printf(string format,[vec0, vec1, ...]) Presas ĉenon al STDOUT, Format-parametroj permesitaj estas "%v" kaj "%f". Retur-parametro estas malplena, sed devas esti atribuita al variablo.
es: float printf(string formato,[vec0, vec1, …]) Imprime una cadena de texto en STDOUT. Los parámetros de formato permitidos son «%v» y «%f». El parámetro devuelto está vacío, aunque se puede asignar a una variable.
fr: float printf (string format, [vec0, vec1,...]) Imprime une chaîne sur « stdout ». Les paramètres de formatage sont « %v » et « %f ». Le paramètre retourné est vide mais doit être stocké dans une variable.
he: float printf(תבנית מחרוזת,[vec0, vec1, ...]) הצגת מחרוזת בפלט התקני (STDOUT), פרמטרי העיצוב המורשים הם „%v” ו־„%f”. פרמטר החזרה ריק, אבל יש להקצות אותו למשתנה.
it: printf (formato stringa,[vec0, vec1, ...]) Stampa una stringa su STDOUT, i parametri di formato consentiti sono è «%v» and «%f». Il parametro di ritorno è vuoto, ma deve essere assegnato a una variabile.
nl: float printf(string format,[vec0, vec1, ...]) Stuurt een tekenreeks naar STDOUT, Format parameters zijn "%v" en "%f". Teruggegeven parameter is leeg, maar moet aan een variabele worden toegekend.
pl: float printf(string format,[vec0, vec1, ...]) Wyświetla ciąg znaków na STDOUT, dozwolone parametry formatujące to "%v" oraz"%f". Wartość zwracana jest pusta, lecz musi zostać przypisana do zmiennej.
pt_br: float printf(string format,[vec0, vec1, ...]) Imprime um texto na STDOUT, os parâmetros de formato permitidos são "%v" e "%f". O retorno do parâmetro é vazio, mas deve ser atribuído a uma variável.
sl: float printf(string format,[vec0, vec1, ...]) Natisne niz v STDOUT, dovoljeni parametri formatiranja so "%v" in "%f". Vrnjeni parameter je prazen, vendar ga je treba dodeliti spremenljivki.
sv: float printf(string format,[vec0, vec1, ...]) Skriv ut en sträng till standardutmatningen, formatparametrar som tillåts är "%v" och "%f". Returparametern är tom, men måste tilldelas till en variabel.
tr: float printf(string biçim, [vec0, vec1, ...]) STDOUT'a bir dizi yazdırır. İzin verilen biçim parametreleri "%v" ve "%f"dir. Dönüş parametresi boştur; ancak bir değişkene atanmış olmalıdır.
uk: float printf(string формат,[vec0, vec1, ...]) Виводить рядок до STDOUT. Можливими значеннями параметра «формат» є %v та %f. Повернутий параметр є порожнім, але його обов'язково слід пов'язувати наданням значення змінній.
zh_cn: float printf(string format,[vec0, vec1, ...]) 打印一条字符串到 STDOUT，可以使用的格式参数是 “%v” 和 “%f”。 返回参数为空，但必须被指定到一个变量。
zh_tw: float printf(string format,[vec0, vec1, ...]) 輸出字串到 STDOUT，可用的格式字串為 "%v" 和 "%f"。 傳回值為空，不過必須將其指派給變數。

# builtin|
source: sprintf(string format, [double|string, double|string, ...]) Returns a string formatted from the given values. See 'man sprintf' for format details.
ar: sprintf(string format, [double|string, double|string, ...]) أرجع سلسلة مهيأة من القيم المُعطاة. راجع 'man sprintf' لتفاصيل التنسيق.
ca: sprintf(string format, [double|string, double|string, ...]) Retorna una cadena formatada a partir dels valors indicats. Per a obtenir els detalls sobre el format, vegeu «man sprintf».
eo: sprintf(string format, [double|string, double|string, ...]) Redonas ĉenon formatitan el la donitaj valoroj. Vidu 'man sprintf' por formataj detaloj.
es: sprintf(string formato, [double|string, double|string, …]) Devuelve una cadena de texto formateada con los valores indicados. Consulte «man sprintf» para los detalles del formato.
fr: sprintf (string format, [double|string, double|string,...]) Retourne une chaîne formatée à partir des valeurs fournies. Veuillez consulter « man sprintf » pour des informations détaillées sur le format.
he: sprintf(string format, [double|string, double|string, ...]) החזרת מחרוזת מעוצבת מערכים שסופקו. יש לעיין ב־‚man sprintf’ לפרטים על העיצוב.
it: sprintf (formato stringa, [double|stringa, double|stringa, ...]) Restituisce una stringa formattata dai valori forniti. Vedi «man sprintf» per i dettagli del formato.
nl: sprintf(string format, [double|string, double|string, ...]) Geeft tekenreeks terug geformatteerd naar de gegeven waarden. Zie 'man sprintf' voor meer details over format.
pl: sprintf(string format, [double|string, double|string, ...]) Zwraca ciąg znaków sformatowany wg podanych wartości. Zobacz 'man sprintf' po więcej szczegółów nt. formatowania.
pt_br: sprintf(string format, [double|string, double|string, ...]) Retorna um texto formatado a partir dos valores fornecidos. Veja 'man sprintf' para detalhes do formato.
sl: sprintf(string format, [double|string, double|string, ...]) Vrne niz oblikovan iz danih vrednosti. Glejte "man sprintf" zapodrobnosti o formatu.
sv: sprintf(string format, [double|string, double|string, ...]) Returnerar en sträng formaterad från det givna värdet. Se 'man sprintf' för formatinformation.
tr: sprintf(string biçim, [double|string, double|string, ...]) Verilen değerlerden biçimlendirilmiş bir dizi döndürür. Biçim ayrıntıları için 'man sprintf'ye bakın.
uk: sprintf(string формат, [double|рядок, double|рядок, ...]) Повертає рядок, форматований з вказаних значень. Див. «man sprintf», щоб дізнатися більше про форматування.
zh_cn: sprintf(string format, [double|string, double|string, ...]) 返回按照给定的值进行格式化的字符串，更多格式细节请通过 man sprintf 指令学习
zh_tw: sprintf(string format, [double|string, double|string, ...]) 傳回根據參數值作格式化的字串。格式化詳情請參見 'man sprintf'。
