Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: vector rotate(vector v,vector axis,float angle) rotates v around axis by given angle (in radians)
ar: vector rotate(vector v,vector axis,float angle) يُدَوِّر v حول المحور بالزاوية المُعطاة (بالراديان)
ca: vector rotate(vector v,vector axis,float angle) Gira «v» al voltant de l'eix en un angle indicat (en radians)
eo: vector rotacio (vector v, vector akso, float angulo) rotacias v ĉirkaŭ akso laŭ donita angulo (en radianoj)
es: vector rotate(vector v,vector eje,float ángulo) rota v alrededor del eje el ángulo indicado (en radianes)
fr: vector rotate (vector v, vector axis, float angle) tournes v autour l'axe donné par un angle donné (en radians).
he: vector rotate(וקטור v,חקטור axis,שבר עשרוני angle) סיבוב של v סביב ציר בזווית מסוימת (ברדיאנים)
it: vector rotate(vector v,vector axis,float angle) ruota v attorno all'asse di un dato angolo (in radianti)
nl: vector rotate(vector v,vector as, float hoek) roteert v rond as over een gegeven hoek (in radialen)
pl: vector rotate(vector v,vector oś,float kąt) obraca "v" wokół osi o dany kąt (w radianach)
pt_br: vector rotate(vector v,vector axis,float angle) gira v em torno do eixo por determinado ângulo (em radianos)
sl: vector rotate(vector v,vector axis,float angle) vrti v okoli osi za dani kot (v radianih)
sv: vector rotate(vector v,vector axis,float angle) roterar v omkring axeln axis med angiven vinkel angle (i radianer)
tr: vector rotate(vector v,vector axis,float angle) v'yi belirli bir açıyla eksen çevresinde döndürür (radyan türünden)
uk: vector rotate(vector v,vector вісь,float кут) Обертає вектор v навколо вісі на заданий кут (у радіанах)
zh_cn: vector rotate(vector v,vector axis,float angle) 按照给定的角度 angle (弧度数值)，绕轴旋转矢量 v
zh_tw: vector rotate(vector v,vector axis,float angle) 依 axis 軸旋轉 v，角度為 angle (以弧度 rad 為單位)

# builtin|
source: vector up(vector P,vector upvec) rotates v such that the Y axis points in the given up direction
ar: vector up(vector P,vector upvec) يُدَوِّر v بحيث يشير المحور Y في الاتجاه الأعلى المُعطى
ca: vector up(vector P,vector upvec) Gira «v» de manera que l'eix «Y» apunti en la direcció indicada
eo: vector supren (vector P, vector suprenvek) rotacias v tiel ke la Y-akso indikas en la fordonita direkto
es: vector up(vector P,vector vectorarriba) Rota «v» de tal modo que el eje Y apunte en la dirección arriba indicada
fr: vector up (vector P, vector upvec) tournes v tel que l'axe Y pointe dans une direction donnée.
he: vector up(וקטור P,וקטור upvec) הטייה של v כך שהנקודות בציר Y פונות לכיוון שצוין בתור למעלה
it: vector up(vector P,vector upvec) ruota v in modo tale che l'asse Y punti nella direzione indicata
nl: vector up(vector P,vector upvec) roteert v zodanig dat de Y-as wijst in de gegeven richting van upvec
pl: vector up(vector P,vector upvec) obraca v tak, że oś Y jest skierowana w górę danego kierunku
pt_br: vector up(vector P,vector upvec) gira v de modo que o eixo Y aponta na direção dada
sl: vector up(vector P,vector upvec) vrti v tako, da os Y kaže v dani smeri
sv: vector up(vector P,vector upvec) roterar v så att Y-axeln pekar i angiven uppåtriktning
tr: vector up(vector P,vector upvec) v'yi, Y ekseni verilen yönü gösterecek şekilde döndürür
uk: vector up(vector P,vector upvec) обертає v так, щоб вісь Y вказувала у заданому напрямку
zh_cn: vector up(vector P,vector upvec) 旋转矢量 v，使其 Y 轴指向给定的 up 方向。
zh_tw: vector up(vector P,vector upvec) 旋轉 v 以使其 Y 軸指向 upvec 指定的「上方」方向

# builtin|
source: int cycle(int index, int loRange, int hiRange ) Cycles through values between loRange and hiRange based on supplied index. This is an offset "mod" function. The result is computed as ``loRange + value % (hiRange-loRange+1)``.
ar: int cycle(int index, int loRange, int hiRange ) يَتَسَلسَل عبر القيم بين loRange و hiRange بناءً على الفهرس المُزَوَّد. هذه دالة "mod" مُزاحة. تُحتَسَب النتيجة كـ ``loRange + value % (hiRange-loRange+1)``.
ca: int cycle(int index, int loRange, int hiRange ) Recorre els valors entre «loRange» i «hiRange» segons l'índex proporcionat. Aquesta és una funció «mod» de compensació. El resultat és calculat com a «loRange + value % (hiRange-loRange+1)».
eo: int ciklo(int-indekso, int loRange, int hiRange ) Cirkulas tra valoroj inter loRange kaj hiRange surbaze de provizita indekso. Ĉi tio estas deŝovo "mod" funkcio. La rezulto estas kalkulita kiel ``loRange + valoro % (hiRange-loRange+1)``.
es: int cycle(int índice, int limInferior, int limSuperior ) Recorre los valores entre «limInferior» y «limSuperior» según el índice proporcionado. Es una función «mod» de desplazamiento. El resultado se calcula como ``limInferior + valor % (limSuperior - limInferior + 1)``.
fr: int cycle (int index, int loRange, int hiRange ) Parcourt les valeurs entre « loRange » et « hiRange » reposant sur l'index fourni. Ceci est une fonction dérivée de « mod ». Le résultat est calculé comme « loRange + value % (hiRange-loRange+1) ».
it: int cycle(int index, int loRange, int hiRange ) Passa attraverso i valori tra loRange e hiRange in base all'indice fornito. Questa è una funzione «mod» di offset. Il risultato è calcolato come ``loRange + value % (hiRange-loRange+1)``.
nl: int cycle(int index, int laag, int hoog ) cyclisch gaan door de waarden tussen laag en hoog, op basis van de gegeven index. Dit is een offset "mod"-functie. Het antwoord wordt berekend als "laag + waarde % (hoog - laag) +1 ".
pl: int cycle(int index, int loRange, int hiRange ) Krąży pomiędzy wartościami spomiędzy zakresu loRange oraz hiRange na podstawie podanego indeksu. Jest to funkcja przesunięcia "mod". Wynik jest obliczony jako ``loRange + wartość % (hiRange-loRange+1)``.
pt_br: int cycle(int index, int loRange, int hiRange ) Percorre os valores entre loRange e hiRange baseado no índice fornecido. Esta é uma função "mod" de deslocamento. O resultado é computado como ``loRange + valor % (hiRange-loRange+1)``.
sl: int cycle(int index, int loRange, int hiRange ) Preklaplja med vrednostmi loRange in hiRange na podlagi danega indeksa. To je odmik funkcije "mod". Rezultat je izračunan kot ``loRange + value % (hiRange-loRange+1)``.
sv: int cycle(int index, int loRange, int hiRange ) Går igenom värden mellan loRange och hiRange cykliskt baserat på angivna index. Det är en "mod" funktion. Resultatet beräknas som ``loRange + värde % (hiRange-loRange+1)``.
tr: int cycle(int indeks, int düErim, int yüErim ) Sağlanan indekse göre düErim ve yüErim değerleri arasında gidip gelir. Bu, bir ofset "kip" işlevidir. Sonuç, ``loRange + değer % (yüErim-düErim+1)`` olarak hesaplanır.
uk: int cycle(int index, int loRange, int hiRange ) Циклічно переходить значеннями між loRange і hiRange на основі наданого індексу (index). Це зсунута версія функції «mod». Результатом є значення ``loRange + value % (hiRange-loRange+1)``.
zh_cn: int cycle(int index, int loRange, int hiRange ) 按照提供的 index (索引) 在 loRange 和 hiRange 之间 cycle (循环) 输出数值。 这是一个 offset (偏移)的 “mod” 函数。其结果按照 ``loRange + value % (hiRange-loRange+1)`` 进行计算。
zh_tw: int cycle(int index, int loRange, int hiRange ) 依 index 偱環 loRange 及 hiRange 之間的數值。這是經偏移的 "mod" (模數) 函數，運算式為 ``loRange + value % (hiRange-loRange+1)``。

# builtin|
source: int pick(float index, int loRange, int hiRange, [float weights, ...] ) Picks values randomly between loRange and hiRange based on supplied index (which is automatically hashed).&nbsp; The values will be distributed according to the supplied weights.&nbsp; Any weights not supplied are assumed to be 1.0.
ar: int pick(float index, int loRange, int hiRange, [float weights, ...] ) يختار قيمًا عشوائيًا بين loRange و hiRange بناءً على الفهرس المُزَوَّد (الذي يُجَزَّأ آليًا). تُوزَّع القيم وفقًا لـ الأوزان المُزَوَّدَة. تُفترَض أي أوزان لَم تُزَوَّد بأنها 1.0.
ca: int pick(float index, int loRange, int hiRange, [float weights, ...] ) Tria aleatòriament els valors entre «loRange» i «hiRange» segons l'índex proporcionat (el qual automàticament té una suma):&nbsp; Els valors es distribuiran segons els pesos subministrats.&nbsp; S'assumirà que qualsevol pes no subministrat serà 1.0.
eo: int pick(float index, int loRange, int hiRange, [floatweights, ...] ) Elenas valorojn hazarde inter loRange kaj hiRange surbaze de provizita indekso (kiu estas aŭtomate haketkodita).&nbsp; La valoroj estos distribuitaj laŭ la liveritaj pezoj. Ĉiuj pezoj ne liveritaj estas supozitaj kiel 1.0.
es: int pick(float índice, int limInferior, int limSuperior, [float pesos, …] ) Escoge valores aleatoriamente entre «limInferior» y «limSuperior» según el índice proporcionado (cuyo «hash» se obtiene automáticamente).&nbsp; Los valores se distribuirán según los pesos proporcionados.&nbsp; Se asume que los pesos no indicados valen 1.0.
fr: int pick (float index, int loRange, int hiRange, [float weights,...] ) Sélectionne des valeurs aléatoires dans l'intervalle « loRange » et « hiRange » selon l'index fourni (lequel est automatiquement haché). Les valeurs seront distribués selon les poids fournis. Si non fourni, le poids est supposé valoir 1.0.
it: int pick (float index, int loRange, int hiRange, [float weights, ...]) Seleziona i valori in modo casuale tra loRange e hiRange in base all'indice fornito (per cui viene generato automaticamente un hash).&nbsp;I valori verranno distribuiti secondo ai pesi forniti.&nbsp;Si assume che i pesi non forniti siano 1,0.
nl: int pick(float index, int laag, int hoog, [float gewichten, ...] ) Kiest willekeurig waarden tussen laag en hoog op basis van de opgegeven index(met automatische hash . &nbsp; De waarden worden verdeeld volgens de opgegeven gewichten.&nbsp;Een niet opgegeven gewicht wordt verondersteld 1.0 te zijn.
pl: int pick(float index, int loRange, int hiRange, [float weights, ...] ) Wybiera wartości losowo spomiędzy loRange oraz hiRange na podstawie podanego indeksu (dla którego jest obliczany hasz).&nbsp; Wartości zostaną rozłożone wg podanych wag.&nbsp; Gdy wartość wagi jest niepodana, to przyjmuje się 1.0.
pt_br: int pick(float index, int loRange, int hiRange, [float weights, ...] ) Escolhe valores aleatoriamente entre loRange e hiRange com base no índice fornecido (que é automaticamente marcado). &nbsp; Os valores serão distribuídos de acordo com aos pesos fornecidos. &nbsp; Quaisquer pesos não fornecidos são assumidos como ser 1.0.
sl: nt pick(float index, int loRange, int hiRange, [float weights, ...] ) Naključno izbira vrednosti med loRange in hiRange glede na priloženi indeks (ki je samodejno zgoščena). &nbsp;Vrednosti bodo porazdeljene v skladu s priloženimi utežmi.&nbsp; Za vse nedobavljene uteži se predpostavlja da so 1,0.
sv: int pick(float index, int loRange, int hiRange, [float weights, ...] ) Väljer värden slumpmässigt mellan loRange och hiRange baserat på angivet index (som automatiskt kondenseras).&nbsp; Värdena fördelas enligt angivna vikter.&nbsp; Alla vikter som inte anges antas vara 1,0.
tr: int pick(float indeks, int düErim, int yüErim, [float ağırlıklar, ...] ) Sağlanan indekse göre düErim ve yüErim değerleri arasında gidip gelir (otomatik olarak sağlaması yapılır).&nbsp; Değerler, sağlanan ağırlıklara göre dağıtılır.&nbsp; Sağlanmamış herhangi bir ağırlık 1,0 olarak alınır.
uk: int pick(float index, int loRange, int hiRange, [float weights, ...] ) Випадково вибирає значення між loRange і hiRange на основі наданого індексу (index, який автоматично хешується). Значення буде розподілено за вказаними значеннями ваги (weights). Усі ваги, значення яких не вказано, вважатимуться рівними 1.0.
zh_cn: int pick(float index, int loRange, int hiRange, [float weights, ...] ) 按照提供的 index (索引值，通过自动散列得到 / automatically hashed) 在 loRange 和 hiRange 之间随机选取数值，数值将按照提供的 weight (权重) 分布 未提供权重的假设其权重为 1.0
zh_tw: int pick(float index, int loRange, int hiRange, [float weights, ...] ) 依 index (會經 hash 函數取雜湊值) 隨機取 loRange 及 hiRange 之間的數值。 數值會根據所提供的 weights 參數分佈。省略掉的 weights 參數將會預設為 1.0。

# builtin|
source: color swatch(float index, color choice0, color choice1, color choice2, [...]) Chooses one of the supplied color choices based on the index (assumed to be in range [0..1]).
ar: color swatch(float index, color choice0, color choice1, color choice2, [...]) يختار واحدًا من خيارات الألوان المُزَوَّدَة بناءً على الفهرس (المفترَض أنه في النطاق [0..1]).
ca: color swatch(float index, color choice0, color choice1, color choice2, [...]) Tria una de les opcions proporcionades segons l'índex (se suposa que està en l'interval [0..1]).
eo: color swatch(float indekso, color elekto0, color elekto1, color elekto2, [...]) Elektas unu el la provizitaj kolorelektoj surbaze de la indekso (supoze estas en intervalo [0..1]).
es: color swatch(float índice, color elección0, color elección1, color elección2, […]) Escoge una de las elecciones de color proporcionadas basándose en el «índice» (que se supone en el intervalo [0..1]).
fr: color swatch (float index, color choice0, color choice1, color choice2, [...]) Sélectionne un des choix fournis de couleurs selon l'index (supposé être dans [0..1]).
he: color swatch(float index, color choice0, color choice1, color choice2, [...]) בוחרת את אחת מבחירות הצבע שסופקו לפי המפתח (בהנחה שהוא בטווח [0..1]).
it: color swatch (float index, colore choice0, color choice1, color choice2, [...]) Sceglie una delle scelte di colore fornite in base all'indice (presumibilmente nell'intervallo [0..1]).
nl: color swatch(float index, color keuze0, color keuze1, color keuze2, [...]) Kiest een van de opgegeven kleurkeuzes op basis van de index ( volgens aanname in bereik [0..1]).
pl: color swatch(float indeks, color wybór0, color wybór1, color wybór2, [...]) Wybiera jedną z dostępnych barw na podstawie indeksu (zakłada się, że z zakresu [0..1]).
pt_br: color swatch(float index, color choice0, color choice1, color choice2, [...]) Escolhe uma das opções de cores fornecidas com base no índice (assumido como no intervalo [0..1]).
sl: color swatch(float index, color choice0, color choice1, color choice2, [...]) Izbere eno od ponujenih barvnih izbir glede na indeks (domnevnov območju [0..1]).
sv: color swatch(float index, color choice0, color choice1, color choice2, [...]) Väljer ett av de tillhandahållna färgvalen baserat på index (antas vara i intervallet [0..1]).
tr: color swatch(float indeks, color seçim0, color seçim1, color seçim2, [...]) İndekse göre sağlanan renk seçeneklerinden birini seçer ([0...1] eriminde olduğu varsayılır).
uk: color swatch(float індекс, color варіант0, color варіант1, color варіант2, [...]) Вибирає один із наданих варіантів на основі індексу (припускається значення у діапазоні [0, 1]).
zh_cn: color swatch(float index, color choice0, color choice1, color choice2, [...]) 在提供的颜色选项中基于 index (索引) 选取其中之一 (假设范围为 [0..1])
zh_tw: color swatch(float index, color choice0, color choice1, color choice2, [...]) 依 index (範圍為 [0..1]) 由所提供的色彩中選擇一種色彩。

# builtin|
source: float choose(float index,float choice1, float choice2, [...]) Chooses one of the supplied choices based on the index (assumed to be in range [0, 1]).
ar: float choose(float index,float choice1, float choice2, [...]) يختار واحدًا من الخيارات المُزَوَّدَة بناءً على الفهرس (المفترَض أنه في النطاق [0، 1]).
ca: float choose(float index,float choice1, float choice2, [...]) Tria una de les opcions proporcionades segons l'índex (se suposa que està en l'interval [0, 1]).
eo: float choose(float index,float elekto1, float elekto2, [...]) Elektas unu el la provizitaj elektoj surbaze de la indekso (supozita esti en intervalo [0, 1]).
es: float choose(float índice,float elección1, float elección2, […]) Escoge una de las elecciones proporcionadas basándose en el «índice» (que se supone en el intervalo [0, 1]).
fr: float choose (float index, float choice1, float choice2, [...]) Sélectionne un des choix proposés selon l'index (est supposé être entre [0, 1]).
he: float choose(שבר עשרוני index,שבר עשרוני choice1, שבר עשרוני choice2, [...]) בוחר את אחת הבחירות שסופקו ב־index (בהנחה שהערך הוא בטווח [0, 1]).
it: float choose(float index,float choice1, float choice2, [...]) Seleziona una delle scelte fornite in base all'indice (assunto nell'intervallo [0, 1]).
nl: float choose(float index,float keuze1, float keuze2, [0, ]) Kiest een van de opgegeven keuzes op basis van de index ( volgens aanname in bereik [0..1]).
pl: float choose(float indeks,float wybór1, float wybór2, [...]) Wybiera jeden z możliwych wyborów na podstawie indeksu (zakłada się, że z zakresu [0, 1]).
pt_br: float choose(float index,float choice1, float choice2, [...]) Escolhe uma das opções fornecidas com base no índice (presume-se que esteja no intervalo [0, 1]).
sl: float choose(float index,float choice1, float choice2, [...]) Izbere eno od ponujenih izbir glede na indeks (predvideno v območju [0..1]).
sv: float choose(float index,float choice1, float choice2, [...]) Väljer ett av de tillhandahållna valen baserat på index (antas vara i intervallet [0, 1]).
tr: float choose(float indeks, float seçim1, float seçim2, [...]) İndekse göre sağlanan renk seçeneklerinden birini seçer ([0...1] eriminde olduğu varsayılır).
uk: float choose(float індекс, float варіант1, float варіант2, [...]) Вибирає один із наданих варіантів на основі індексу (припускається значення у діапазоні [0, 1]).
zh_cn: float choose(float index,float choice1, float choice2, [...]) 在提供的选项中基于 index (索引) 选取其中之一 (假设范围为 [0, 1])
zh_tw: ufloat choose(float index,float choice1, float choice2, [...]) 依 index (範圍為 [0..1]) 由所提供的數值中選擇一個數值。

# builtin|
source: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) Chooses one of the supplied choices based on the index (assumed to be in range [0..1]). The values will be distributed according to the supplied weights.
ar: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) يختار واحدًا من الخيارات المُزَوَّدَة بناءً على الفهرس (المفترَض أنه في النطاق [0..1]). تُوزَّع القيم وفقًا للأوزان المُزَوَّدَة.
ca: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) Tria una de les opcions proporcionades segons l'índex (se suposa que està en l'interval [0..1]). Els valors es distribuiran segons els pesos subministrats.
eo: float wchoose(float index,float elekto1, float pezo1, float elekto2, float pezo2, [...] ) Elektas unu el la provizitaj elektoj surbaze de la indekso (supozita esti en intervalo [0..1]). La valoroj estos distribuitaj laŭ la liveritaj pezoj.
es: float wchoose(float índice,float elección1, float peso1, float elección2, float peso2, […] ) Escoge una de las elecciones proporcionadas basándose en el «índice» (que se supone en el intervalo [0..1]). Los valores se distribuyen según los pesos proporcionados.
fr: float wchoose (float index, float choice1, float weight1, float choice2, float weight2, [...] ) Choisit un des choix fournis selon l'index (en supposant qu'il soit dans l'intervalle [0..1]). Les valeurs seront distribuées selon les poids fournis.
it: float wchoose(float indice,float scelta1, float peso1, float scelta2, float peso2, [...] ) Seleziona una delle scelte fornite in base all'indice (assunto nell'intervallo [0..1]). I valori saranno distribuiti in base ai pesi forniti.
nl: float wchoose(float index,float keuze1, float gewicht1, float keuze2, float gewicht2, [...] ) Kiest een van de opgegeven keuzes op basis van de index ( volgens aanname in bereik [0..1]). De waarden worden verdeeld naar de opgegeven gewichten.
pl: float wchoose(float indeks,float wybór1, float waga1, float wybór2, float waga2, [...] ) Wybiera jeden z możliwych wyborów na podstawie indeksu (zakłada się, że z zakresu [0..1]). Wartości zostaną rozłożone wg podanych wag.
pt_br: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) Escolhe uma das opções fornecidas com base no índice (presume-se que esteja no intervalo [0..1]). Os valores serão distribuídos de acordo com os pesos fornecidos.
sl: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) Izbere eno od ponujenih možnosti na podlagi indeksa (domnevno v obsegu [0..1]). Vrednosti se porazdelijo glede na priložene uteži.
sv: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) Väljer ett av de angivna värdena baserat på index (som antas vara i intervallet [0..1]). Värdena distribueras enligt de angivna vikterna.
tr: float wchoose(float indeks, float seçim1, float ağırlık2, float seçim2, float ağırlık2, [...] ) İndekse göre sağlanan renk seçeneklerinden birini seçer ([0...1] eriminde olduğu varsayılır). Değerler, sağlanan ağırlıklara göre dağıtılır.
uk: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) Вибирає один із наданих варіантів на основі індексу (припускається значення у діапазоні [0, 1]). Значення буде розподілено відповідно до наданих значень ваги (weight).
zh_cn: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) 按照索引 (假设范围为 [0..1]) 从提供的选项中选择其一，数值将按照提供的权重进行分布
zh_tw: float wchoose(float index,float choice1, float weight1, float choice2, float weight2, [...] ) 依 index (範圍為 [0..1]) 由所提供的數值中選擇一個數值。 數值會根據所提供的 weights 參數分佈。
