Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: float abs(float x) absolute value of x
ar: float abs(float x) القيمة المطلقة لـ x
ca: float abs(float x) Valor absolut de «x»
eo: float abs(float x) absoluta valoro de x
es: float abs(float x) valor absoluto de x
fr: float abs (float x) Valeur absolue de x
he: float abs(x כשבר עשרוני) ערך מוחלט של x
it: float abs(float x) valore assoluto di x
nl: float abs(float x) absolute waarde van x
pl: float abs(float x) wartość bezwzględna z "x"
pt_br: float abs(float x) valor absoluto de x
sl: float abs(float x) absolutna vrednost x
sv: float abs(float x) absolutvärde av x
tr: float abs(float x) x'in mutlak değeri
uk: float abs(float x) модуль значення x
zh_cn: float abs(float x) x 的绝对值
zh_tw: float abs(float x) x 的絕對值

# builtin|
source: float deg(float angle) radians to degrees
ar: float deg(float angle) تحويل الراديان إلى درجات
ca: float deg(float angle) Radians a graus
eo: float deg(float angulo) radianoj al gradoj
es: float deg(float ángulo) radianes a grados
fr: float deg (float angle) Conversion de degrés en radians
he: float deg(זווית כשבר עשרוני) רדיאנים למעלות
it: float deg(float angolo) radianti a gradi
nl: float deg(float hoek) radialen naar graden
pl: float deg(float kąt) radiany na stopnie
pt_br: float deg(float angle) radianos para graus
sl: float deg(float angle) radiani v stopinje
sv: float deg(float angle) radianer till grader
tr: float deg(float açı) derecelere göre radyan
uk: float deg(float кут) радіани у градуси
zh_cn: float deg(float angle) 将弧度转换为角度
zh_tw: float deg(float angle) 轉換弧度 (rad) 至角度 (deg)

# builtin|
source: float rad(float angle) degrees to radians
ar: float rad(float angle) تحويل الدرجات إلى راديان
ca: float rad(float angle) Graus a radians
eo: float rad(float angulo) gradoj al radianoj
es: float rad(float ángulo) grados a radianes
fr: float rad (float angle) Conversion de degrés en radians
he: float rad(זווית כשבר עשרוני) מעלות לרדיאנים
it: float rad(float angolo) gradi a radianti
nl: float rad(float hoek) graden naar radialen
pl: float rad(float kąt) stopnie na radiany
pt_br: float rad(float angle) graus para radianos
sl: float rad(float angle) stopinje v radiane
sv: float rad(float angle) grader till radianer
tr: float rad(float açı) radyanlara göre derece
uk: float rad(float кут) градуси у радіани
zh_cn: float rad(float angle) 将角度转换为弧度
zh_tw: float rad(float angle) 轉換角度 (deg) 至弧度 (rad)

# builtin|
source: float cosd(float angle) cosine in degrees
ar: float cosd(float angle) جيب التمام بالدرجات
ca: float cosd(float angle) Cosinus en graus
eo: float cosd(float angulo) kosinuso en gradoj
es: float cosd(float ángulo) coseno en grados
fr: float cosd (float angle) cosinus en degrés
he: float cosd(זווית כשבר עשרוני) קוסינוס במעלות
it: float cosd(float angolo) coseno in gradi
nl: float cosd(float hoek) cosinus in graden
pl: float cosd(float kąt) kosinus w stopniach
pt_br: float cosd(float angle) cosseno em graus
sl: float cosd(float angle) cosinus v stopinjah
sv: float cosd(float angle) cosinus i grader
tr: float cosd(float açı) derece türünden kosinüs
uk: float cosd(float кут) косинус значення у градусах
zh_cn: float cosd(float angle) 求余弦角度
zh_tw: float cosd(float angle) 以角度 (deg) 計算餘弦 (cos)

# builtin|
source: float sind(float angle) sine in degrees
ar: float sind(float angle) الجيب بالدرجات
ca: float sind(float angle) Sinus en graus
eo: float sind(float angulo) sinuso en gradoj
es: float sind(float ángulo) seno en grados
fr: float sind (float angle) sinus en degrés
he: float sind(זווית כשבר עשרוני) סינוס במעלות
it: float sind(float angolo) seno in gradi
nl: float sind(float hoek) sinus in graden
pl: float sind(float kąt) sinus w stopniach
pt_br: float sind(float angle) seno em graus
sl: float sind(float angle) sinus v stopinjah
sv: float sind(float angle) sinus i grader
tr: float sind(float açı) derece türünden sinüs
uk: float sind(float кут) синус значення у градусах
zh_cn: float sind(float angle) 求正弦角度
zh_tw: float sind(float angle) 以角度 (deg) 計算正弦 (sin)

# builtin|
source: float tand(float angle) tangent in degrees
ar: float tand(float angle) الظل بالدرجات
ca: float tand(float angle) Tangent en graus
eo: float tand(float angulo) tangento en gradoj
es: float tand(float ángulo) tangente en grados
fr: float tand (float angle) tangente en degrés
he: float tand(זווית כשבר עשרוני) טנגנס במעלות
it: float tand(float angolo) tangente in gradi
nl: float tand(float hoek) tangens in graden
pl: float tand(float kąt) tangens w stopniach
pt_br: float tand(float angle) tangente em graus
sl: float tand(float angle) tangens v stopinjah
sv: float tand(float angle) tangens i grader
tr: float tand(float açı) derece türünden tanjant
uk: float tand(float кут) тангенс значення у градусах
zh_cn: float tand(float angle) 求正切角度
zh_tw: float tand(float angle) 以角度 (deg) 計算正切 (tan)

# builtin|
source: float acosd(float value) arc cosine in degrees
ar: float acosd(float value) جيب التمام العكسي بالدرجات
ca: float acosd(float value) Arccosinus en graus
eo: float acosd(floatvaloro) ark-kosinuso en gradoj
es: float acosd(float valor) arcocoseno en grados
fr: float acosd (float value) arc cosinus en degrés
he: float acosd(שבר עשרוני) ארק-קוסינוס במעלות
it: float acosd(float valore) arcocoseno in gradi
nl: float acosd(float getal) arccosinus in graden
pl: float acosd(float wartość) arkus kosinus w stopniach
pt_br: float acosd(float value) arco cosseno em graus
sl: float acosd(float value) arcs cosinus v stopinjah
sv: float acosd(float value) arcus cosinus i grader
tr: float acosd(float değer) derece türünden ark kosinüs
uk: float acosd(float значення) арккосинус у градусах
zh_cn: float acosd(float value) 求反余弦角度
zh_tw: float acosd(float value) 以角度 (deg) 計算反餘弦 (arccos)

# builtin|
source: float asind(float value) arc sine in degrees
ar: float asind(float value) الجيب العكسي بالدرجات
ca: float asind(float value) Arcsinus en graus
eo: float asind(float valoro) arc sine en gradoj
es: float asind(float valor) arcoseno en grados
fr: float asind (float value) arc sinus en degrés
he: float asind(שבר עשרוני) ארק-סינוס במעלות
it: float asind(float valore) arcoseno in gradi
nl: float asind(float getal) arcsinus in graden
pl: float asind(float wartość) arkus sinus w stopniach
pt_br: float asind(float value) arco seno em graus
sl: float asind(float value) arcus sinus v stopinjah
sv: float asind(float value) arcus sinus i grader
tr: float asind(float değer) derece türünden ark sinüs
uk: float asind(float значення) арксинус у градусах
zh_cn: float asind(float value) 求反正弦角度
zh_tw: float asind(float value) 以角度 (deg) 計算反正弦 (arcsin)

# builtin|
source: float atand(float value) arc tangent in degrees
ar: float atand(float value) الظل العكسي بالدرجات
ca: float atand(float value) Arctangent en graus
eo: float atand(float valoro) arc tangente en gradoj
es: float atand(float valor) arcotangente en grados
fr: float atand (float value) arc tangente en degrés
he: float atand(שבר עשרוני) ארק-טנגנס במעלות
nl: float atand(float getal) arctangens in graden
pl: float atand(float wartość) arkus tangens w stopniach
pt_br: float atand(float value) arco tangente em graus
sl: float atand(float value) arcus tangens v stopinjah
sv: float atand(float value) arcus tangens i grader
tr: float atand(float değer) derece türünden ark tanjant
uk: float atand(float значення) арктангенс у градусах
zh_cn: float atand(float value) 求反正切角度
zh_tw: float atand(float value) 以角度 (deg) 計算反正切 (arctan)

# builtin|
source: float atan2d(float y,float x) arc tangent in degrees of y/x between -180 and 180
ar: float atan2d(float y,float x) الظل العكسي بالدرجات لـ y/x بين -180 و 180
ca: float atan2d(float y,float x) Arctangent en graus de «y»/«x» entre -180 i 180
eo: float atan2d(float y,float x) arc-tangento en gradoj da y/x inter -180 kaj 180
es: float atan2d(float y,float x) arcotangente en grados de y/x entre -180 y 180
fr: float atan2d (float y, float x) arc tangente en degrés de y divisé par x entre -180 et 180 degrés
he: float atan2d(y כשבר עשרוני,x כשבר עשרוני) ארק-טנגנס במעלות של y/x בין ‎-180 ל־180
it: float atan2d(float y,float x) arcotangente in gradi di y/x tra -180 e 180
nl: float atan2d(float y,float x) arctangens in graden van y/x tussen -180 en 180
pl: float atan2d(float y,float x) arkus tangens w stopniach z "y/x" w zakresie -180 oraz 180
pt_br: float atan2d(float y,float x) arco tangente em graus de y/x entre -180 e 180
sl: float atan2d(float y,float x) arcus tangens v stopinjah y/x med -180 in 180
sv: float atan2d(float y,float x) arcus tangens i grader av y/x mellan -180 och 180
tr: float atan2d(float y,float x) -180 ve 180 arasında y/x'in derece türünden ark tanjantı
uk: float atan2d(float y,float x) арктангенс у градусах для y/x, значення від -180 до 180
zh_cn: float atan2d(float y,float x) 在 -180º 和 180º 之间求 y/x 的反正切角度
zh_tw: float atan2d(float y,float x) 以角度 (deg) 計算在 -180° 及 180° 之間 y/x 的反正切 (arctan)

# builtin|
source: float cos(float angle) cosine in radians
ar: float cos(float angle) جيب التمام بالراديان
ca: float cos(float angle) Cosinus en radians
eo: float cos(float angulo) kosinuso en radianoj
es: float cos(float ángulo) coseno en radianes
fr: float cos (float angle) cosinus en radians
he: float cos(זווית כשבר עשרוני) קוסינוס ברדיאנים
it: float cos(float angolo) coseno in radianti
nl: float cos(float hoek) cosinus in radialen
pl: float cos(float kąt) kosinus w radianach
pt_br: float cos(float angle) cosseno em radianos
sl: float cos(float angle) cosinus v radianih
sv: float cos(float angle) cosinus i radianer
tr: float cos(float açı) yarıçap türünden kosinüs
uk: float cos(float кут) косинус значення у радіанах
zh_cn: float cos(float angle) 求余弦弧度
zh_tw: float cos(float angle) 以弧度 (rad) 計算餘弦 (cos)

# builtin|
source: float sin(float angle) sine in radians
ar: float sin(float angle) الجيب بالراديان
ca: float sin(float angle) Sinus en radians
eo: float sin(float angle) sinuso en radianoj
es: float sin(float ángulo) seno en radianes
fr: float sin (float angle) sinus en radians
he: float sin(זווית כשבר עשרוני) סינוס ברדיאנים
it: float sin(float angolo) seno in radianti
nl: float sin(float hoek) sinus in radialen
pl: float sin(float kąt) sinus w radianach
pt_br: float sin(float angle) seno em radianos
sl: float sin(float angle) sinus v radianih
sv: float sin(float angle) sinus i radianer
tr: float sin(float açı) yarıçap türünden sinüs
uk: float sin(float кут) синус значення у радіанах
zh_cn: float sin(float angle) 求正弦弧度
zh_tw: float sin(float angle) 以弧度 (rad) 計算正弦 (sin)

# builtin|
source: float tan(float angle) tangent in radians
ar: float tan(float angle) الظل بالراديان
ca: float tan(float angle) Tangent en radians
eo: float tan(float angulo) tangent en radianoj
es: float tan(float ángulo) tangente en radianes
fr: float tan (float angle) tangente en radians
he: float tan(זווית כשבר עשרוני) טנגנס ברדיאנים
it: float tan(float angolo) tangente in radianti
nl: float tan(float hoek) tangens in radialen
pl: float tan(float kąt) tangens w radianach
pt_br: float tan(float angle) tangente em radianos
sl: float tan(float angle) tangens v radianih
sv: float tan(float angle) tangens i radianer
tr: float tan(float açı) yarıçap türünden tanjant
uk: float tan(float кут) тангенс значення у радіанах
zh_cn: float tan(float angle) 求正切弧度
zh_tw: float tan(float angle) 以弧度 (rad) 計算正切 (tan)

# builtin|
source: float acos(float value) arc cosine in radians
ar: float acos(float value) جيب التمام العكسي بالراديان
ca: float acos(float value) Arccosinus en radians
eo: float acos(float valoro) ark-kosinuso en radianoj
es: float acos(float valor) arcocoseno en radianes
fr: float acos (float value) arc cosinus en radians
he: float acos(שבר עשרוני) ארק-קוסינוס ברדיאנים
it: float acos(float valore) arcocoseno in radianti
nl: float acos(float getal) arccosinus in radialen
pl: float acos(float wartość) arkus kosinus w radianach
pt_br: float acos(float value) arco cosseno em radianos
sl: float acos(float value) arcus cosinus v radianih
sv: float acos(float value) arcus cosinus i radianer
tr: float acos(float değer) yarıçap türünden ark kosinüs
uk: float acos(float значення) арккосинус у радіанах
zh_cn: float acos(float value) 求反余弦弧度
zh_tw: float acos(float value) 以弧度 (rad) 計算反餘弦 (arccos)

# builtin|
source: float asin(float value) arc sine in radians
ar: float asin(float value) الجيب العكسي بالراديان
ca: float asin(float value) Arcsinus en radians
eo: float asin(float valoro) ark-sinuso en radianoj
es: float asin(float valor) arcoseno en radianes
fr: float asin (float value) arc sinus en radians
he: float asin(שבר עשרוני) ארק-סינוס ברדיאנים
it: float asin(float valore) arcoseno in radianti
nl: float asin(float getal) arcsinus in radialen
pl: float asin(float wartość) arkus sinus w radianach
pt_br: float asin(float value) arco seno em radianos
sl: float asin(float value) arcus sinus v radianih
sv: float asin(float value) arcus sinus i radianer
tr: float asin(float değer) yarıçap türünden ark sinüs
uk: float asin(float значення) арксинус у радіанах
zh_cn: float asin(float value) 求反正弦弧度
zh_tw: float asin(float value) 以弧度 (rad) 計算反正弦 (arcsin)

# builtin|
source: float atan(float value) arc tangent in radians
ar: float atan(float value) الظل العكسي بالراديان
ca: float atan(float value) Arctangent en radians
eo: float atan(floatvaloro) ark-tangento en radianoj
es: float atan(float valor) arcotangente en radianes
fr: float atan (float value) arc tangente en radians
he: float atan(שבר עשרוני) ארק טנגנס ברדיאנים
it: float atan(float valore) arcotangente in radianti
nl: float atan(float getal) arctangens in radialen
pl: float atan(float wartość) arkus tangens w radianach
pt_br: float atan(float value) arco tangente em radianos
sl: float atan(float value) arcus tangens v radianih
sv: float atan(float value) arcus tangens i radianer
tr: float atan(float değer) yarıçap türünden ark tanjant
uk: float atan(float значення) арктангенс у радіанах
zh_cn: float atan(float value) 求反正切弧度
zh_tw: float atan(float value) 以弧度 (rad) 計算反正切 (arctan)

# builtin|
source: float atan2(float y,float x) arc tangent in radians of y/x between -PI and PI
ar: float atan2(float y,float x) الظل العكسي بالراديان لـ y/x بين -PI و PI
ca: float atan2(float y,float x) Arctangent en radians de «y»/«x» entre -PI i PI
eo: float atan2(float y,float x) ark-tangento en radianoj de y/x inter -PI kaj PI
es: float atan2(float y,float x) arcotangente en radianes de y/x entre -PI y PI
fr: float atan2 (float y, float x) arc tangente en radians de y divisé par x entre -Pi et +Pi
he: float atan2(y כשבר עשרוני,x כשבר עשרוני) ארק-טנגנס של y/x בין ‎-PI לבין PI
it: float atan2(float y,float x) arcotangente in radianti di y/x tra -PI e PI
nl: float atan2(float y,float x) arctangens in radialen van y/x tussen -PI en PI
pl: float atan2(float y,float x) arkus tangens w radianach z "y/x" w zakresie -PI oraz PI
pt_br: float atan2(float y,float x) arco tangente em radianos de y/x entre -PI e PI
sl: float atan2(float y,float x) arcus tangens v radianih y/x med -PI in PI
sv: float atan2(float y,float x) arcus tangens i radianer av y/x mellan -PI och PI
tr: float atan2(float y,float x) -PI ve PI arasındaki y/x'in yarıçap türünden ark tanjantı
uk: float atan2(float y,float x) арктангенс у радіанах для y/x, значення від -PI до PI
zh_cn: float atan2(float y,float x) 在 -PI 和 PI 之间求 y/x 的反正切弧度
zh_tw: float atan2d(float y,float x) 以弧度 (rad) 計算在 -PI 及 PI 之間 y/x 的反正切 (arctan)

# builtin|
source: float cosh(float angle) hyperbolic cosine in radians
ar: float cosh(float angle) جيب التمام الزائدي بالراديان
ca: float cosh(float angle) Cosinus hiperbòlic en radians
eo: float cosh(float angle) hiperbola kosinuso en radianoj
es: float cosh(float ángulo) coseno hiperbólico en radianes
fr: float cosh (float angle) cosinus hyperbolique en radians
he: float cosh(זווית כשבר עשרוני) קוסינוס היפרבולי ברדיאנים
it: float cosh(float angolo) coseno iperbolico in radianti
nl: float cosh(float hoek) hyperbolische cosinus in radialen
pl: float cosh(float kąt) hiperboliczny kosinus w radianach
pt_br: float cosh(float angle) cosseno hiperbólico em radianos
sl: float cosh(float angle) hiperbolični cosinus v radianih
sv: float cosh(float angle) hyperbolisk cosinus i radianer
tr: float cosh(float açı) yarıçap türünden hiperbolik kosinüs
uk: float cosh(float кут) гіперболічний косинус значення у радіанах
zh_cn: float cosh(float angle) 求双曲余弦弧度
zh_tw: float cosh(float angle) 以弧度 (rad) 計算雙曲餘弦 (cosh)

# builtin|
source: float sinh(float angle) hyperbolic sine in radians
ar: float sinh(float angle) الجيب الزائدي بالراديان
ca: float sinh(float angle) Sinus hiperbòlic en radians
eo: float sinh(float angulo) hiperbola sinuso en radianoj
es: float sinh(float ángulo) seno hiperbólico en radianes
fr: float sinh (float angle) sinus hyperbolique en radians
he: float sinh(זווית כשבר עשרוני) סינוס היפרבולי ברדיאנים
it: float sinh(float angolo) seno iperbolico in radianti
nl: float sinh(float hoek) hyperbolische sinus in radialen
pl: float sinh(float kąt) hiperboliczny sinus w radianach
pt_br: float sinh(float angle) seno hiperbólico em radianos
sl: float sinh(float angle) hiperbolični sinus v radianih
sv: float sinh(float angle) hyperbolisk sinus i radianer
tr: float sinh(float açı) yarıçap türünden hiperbolik sinüs
uk: float sinh(float кут) гіперболічний синус значення у радіанах
zh_cn: float sinh(float angle) 求双曲正弦弧度
zh_tw: float sin(float angle) 以弧度 (rad) 計算雙曲正弦 (sinh)

# builtin|
source: float tanh(float angle) hyperbolic tangent in radians
ar: float tanh(float angle) الظل الزائدي بالراديان
ca: float tanh(float angle) Tangent hiperbòlica en radians
eo: float tanh(float angulo) hiperbola tangento en radianoj
es: float tanh(float ángulo) tangente hiperbólica en radianes
fr: float tanh (float angle) tangente hyperbolique en radians
he: float tanh(זווית כשבר עשרוני) טנגנס היפרבולי ברדיאנים
it: float tanh(float angolo) tangente iperbolica in radianti
nl: float tanh(float hoek) hyperbolische tangens in radialen
pl: float tanh(float kąt) hiperboliczny tangens w radianach
pt_br: float tanh(float angle) tangente hiperbólica em radianos
sl: float tanh(float angle) hiperbolični tangens v radianih
sv: float tanh(float angle) hyperbolisk tangens i radianer
tr: float tanh(float açı) yarıçap türünden hiperbolik tanjant
uk: float tanh(float кут) гіперболічний тангенс значення у радіанах
zh_cn: float tanh(float angle) 求双曲正切弧度
zh_tw: float tan(float angle) 以弧度 (rad) 計算雙曲正切 (tanh)

# builtin|
source: float acosh(float value) hyperbolic arc cosine in radians
ar: float acosh(float value) جيب التمام الزائدي العكسي بالراديان
ca: float acosh(float value) Arccosinus hiperbòlic en radians
eo: float acosh(float valoro) hiperbola arkokosinuso en radianoj
es: float acosh(float valor) arcocoseno hiperbólico en radianes
fr: float acosh (float value) arc cosinus hyperbolique en radians
he: float acosh(שבר עשרוני) ארק-קוסינוס היפרבולי ברדיאנים
it: float acosh(float valore) arcocoseno iperbolico in radianti
nl: float acosh(float getal) hyperbolische arccosinus in radialen
pl: float acosh(float wartość) hiperboliczny arkus kosinus w radianach
pt_br: float acosh(float value) arco cosseno hiperbólico em radianos
sl: float acosh(float value) hiperbolični arcus cosinus v radianih
sv: float acosh(float value) hyperbolisk arcus cosinus i radianer
tr: float acosh(float değer) yarıçap türünden hiperbolik ark kosinüs
uk: float acosh(float значення) гіперболічний арккосинус у радіанах
zh_cn: float acosh(float value) 求双曲反余弦弧度
zh_tw: float acosh(float value) 以弧度 (rad) 計算反雙曲餘弦 (arcosh)

# builtin|
source: float asinh(float value) hyperbolic arc sine in radians
ar: float asinh(float value) الجيب الزائدي العكسي بالراديان
ca: float asinh(float value) Arcsinus hiperbòlic en radians
eo: float asinh(float valoro) hiperbola arko-sinuso en radianoj
es: float asinh(float valor) arcoseno hiperbólico en radianes
fr: float asinh (float value) arc sinus hyperbolique en radians
he: float asinh(שבר עשרוני) ארק-סינוס היפרבולי ברדיאנים
it: float asinh(float valore) seno iperbolico in radianti
nl: float asinh(float getal) hyperbolische arcsinus in radialen
pl: float asinh(float wartość) hiperboliczny arkus sinus w radianach
pt_br: float asinh(float value) arco seno hiperbólico em radianos
sl: float asinh(float value) hiperbolični arcus sinus v radianih
sv: float asinh(float value) hyperbolisk arcus sinus i radianer
tr: float asinh(float değer) yarıçap türünden hiperbolik ark sinüs
uk: float asinh(float значення) гіперболічний арксинус у радіанах
zh_cn: float asinh(float value) 求双曲反正弦弧度
zh_tw: float asinh(float value) 以弧度 (rad) 計算反雙曲正弦 (arsinh)

# builtin|
source: float atanh(float value) hyperbolic arc tangent in radians
ar: float atanh(float value) الظل الزائدي العكسي بالراديان
ca: float atanh(float value) Arctangent hiperbòlic en radians
eo: float atanh(float valoro) hiperbola arko-tangento en radianoj
es: float atanh(float valor) arcotangente hiperbólica en radianes
fr: float atanh (float value) arc tangente hyperbolique en radians
he: float atanh(שבר עשרוני) ארק-טנגנס היפרבולי ברדיאנים
it: float atanh(float valore) arcotangente iperbolica in radianti
nl: float atanh(float getal) hyperbolische arctangens in radialen
pl: float atanh(float wartość) hiperboliczny arkus tangens w radianach
pt_br: float atanh(float value) arco tangente hiperbólico em radianos
sl: float atanh(float value) hiperbolični arcus tangens v radianih
sv: float atanh(float value) hyperbolisk arcus tangens i radianer
tr: float atanh(float değer) yarıçap türünden hiperbolik ark tanjant
uk: float atanh(float кут) гіперболічний арктангенс у радіанах
zh_cn: float atanh(float value) 求双曲反正切弧度
zh_tw: float atanh(float value) 以弧度 (rad) 計算反雙曲正切 (artanh)

# builtin|
source: float clamp(float x,float lo,float hi) constrain x to range [lo,hi]
ar: float clamp(float x,float lo,float hi) قيِّد x في النطاق [lo,hi]
ca: float clamp(float x,float lo,float hi) Restringeix «x» a l'interval [lo,hi]
eo: float clamp(float x,float lo,float hi) limigi x al intervalo [lo,hi]
es: float clamp(float x,float bajo,float alto) limitar x al intervalo [bajo,alto]
fr: float clamp (float x, float lo, float hi) Limiter x à l'intervalle [lo,hi]
he: float clamp(שבר עשרוני x,שבר עשרוני lo,שבר עשרוני hi) תיחום x לטווח [lo,hi]
it: float clamp(float x,float lo,float hi) vincola x all'intervallo [lo, hi]
nl: float clamp(float x,float laag,float hoog) beperk x tot domein [laag, hoog]
pl: float clamp(float x,float lo,float hi) wiąże x do zakresu [lo,hi]
pt_br: float clamp(float x,float lo,float hi) restringir x ao intervalo [lo, hi]
sl: float clamp(float x,float lo,float hi) omeji x na obseg [lo,hi]
sv: float clamp(float x,float lo,float hi) begränsar x till intervallet [lo,hi]
tr: float clamp(float x,float lo,float hi) x'i aralıkla sınırla [dü,yü]
uk: float clamp(float x,float lo,float hi) обмежити x до діапазону [lo,hi]
zh_cn: float clamp(float x,float lo,float hi) 将 x 限制在 [lo, hi] 范围内
zh_tw: float clamp(float x,float lo,float hi) 將 x 局限到 [lo,hi] 之間

# builtin|
source: float round(float x) nearest integer to x
ar: float round(float x) أقرب عدد صحيح إلى x
ca: float round(float x) Arrodoneix a l'enter més proper a «x»
eo: float round(float x) plej proksima entjero al x
es: float round(float x) entero más cercano a x
fr: float round (float x) entier le plus proche de x
he: float round(שבר עשרוני x) המספר השלם הקרוב ביותר ל־x
it: float round(float x) intero più vicino a x
nl: float round(float x) geheel getal dichtst bij x
pl: float round(float x) najbliższa liczba całkowita przy x
pt_br: float round(float x) o número inteiro mais próximo a x
sl: float round(float x) najbližje celo število x-a
sv: float round(float x) närmaste heltal till x
tr: float round(float x) x'e en yakın tamsayı
uk: float round(float x) найближче до x ціле значення
zh_cn: float round(float x) 取 x 的最近似整数
zh_tw: float round(float x) 取 x 最近整數值
