Repository: KDE/kseexpr
Catalog: poqm/*/seexpr2_qt.po
Languages: ar, ca, eo, es, fr, he, it, nl, pl, pt_br, sl, sv, tr, uk, zh_cn, zh_tw

# builtin|
source: float gamma(float x, float g) Gamma correction of x with gamma factor g
ar: float gamma(float x, float g) تصحيح غاما لـ x بعامل غاما g
ca: float gamma(float x, float g) Correcció de la gamma de «x» amb el factor de la gamma de «g»
eo: float gamma(float x, float g) Gama korekto de x kun gamafaktoro g
es: float gamma(float x, float g) Corrección gamma de x con el factor gamma g
fr: float gamma (float x, float g) Correction de « Gamma » de x selon le facteur « Gamma »
he: float gamma(שבר עשרוני x, שבר עשרוני g) תיקון גאמה של x עם מקדם גאמה g
it: float gamma (float x, float g) Correzione gamma di x con fattore gamma g
nl: float gamma(float x, float g) gammacorrectie van x met gammafactor g
pl: float gamma(float x, float g) Poprawka gammy "x" ze współczynnikiem gammy "g"
pt_br: float gamma(float x, float g) Correção gama de x com fator gama g
sl: float gamma(float x, float g) Gama korekcija x-a s faktorjem gama g
sv: float gamma(float x, float g) Gammakorrigering av x med gammafaktor g
tr: float gamma(float x, float g) Gama faktörü g ile x'in gama düzeltmesi
uk: float gamma(float x, float g) Гамма-виправлення x із коефіцієнтом гамма, який дорівнює g
zh_cn: float gamma(float x, float g) 用 Gamma 系数 g 对 x 进行 Gamma 校正
zh_tw: float gamma(float x, float g) 以伽馬因子 (gamma factor) g 對 x 作伽馬修正

# builtin|
source: float bias(float x, float g) Variation of gamma where values less than 0.5 pull the curve down and values greater than 0.5 pull the curve up pow(x,log(b)/log(0.5))
ar: float bias(float x, float g) تنوُّع لغاما حيث القيم التي تقل عن 0.5 تسحب المنحنى للأسفل والقيم التي تزيد عن 0.5 تسحب المنحنى للأعلى pow(x,log(b)/log(0.5))
ca: float bias(float x, float g) Variació de gamma on els valors inferiors a 0,5 empenyen la corba cap avall i els valors superiors a 0,5 empenyen la corba cap amunt pow(x,log(b)/log(0.5))
eo: float bias(float x, float g) Vario de gama kie valoroj malpli ol 0.5 tiras la kurbon malsupren kaj valoroj pli grandaj ol 0.5 tiras la kurbon supren pow(x,log(b)/log(0.5))
es: float bias(float x, float g) Variación de gamma en la que los valores menores que 0.5 tiran de la curva hacia abajo y los valores mayores que 0.5 tiran de la curva hacia arriba pow(x,log(b)/log(0.5))
fr: float bias (float x, float g) La variation de « Gamma » où les valeurs inférieures à 0.5 déplacent la courbe vers le bas et les valeurs supérieures à 0.5 vers le haut pow (x, log(b) / log (0.5))
it: float bias(float x, float g) Variazione della gamma dove valori inferiori a 0,5 abbassano la curva e valori maggiori di 0,5 alzano la curva pow(x,log(b)/log(0.5))
nl: float bias(float x, float g) Variatie van gamma, waarbij waarden kleiner dan 0.5 de kromme neertrekken en waarden groter dan 0.5 de kromme omhoog trekken pow(x,log(b)/log(0.5))
pl: float bias(float x, float g) Odmiana gammy, gdzie wartości mniejsze niż 0,5 ściągają krzywą na dół a wartości większe niż 0.5 ciągną krzywą w górę pow(x,log(b)/log(0.5))
pt_br: float bias(float x, float g) Variação de gama onde valores menores que 0,5 puxam a curva para baixo e valores maiores que 0,5 puxam a curva para cima pow(x,log(b)/log(0.5))
sl: float bias(float x, float g) Varianca game, kjer vrednosti manjše od 0,5 vlečejo krivuljo navzdol in vrednosti večje od 0.5 vlečejo krivuljo navzor pow(x,log(b)/log(0.5))
sv: float bias(float x, float g) Variation av gamma där värden mindre än 0,5 drar ner kurvan och värden större än 0,5 drar upp kurvan pow(x,log(b)/log(0.5))
tr: float bias(float x, float g) 0,5'ten küçük değerlerin eğriyi aşağı çektiği ve 0,5'ten büyük değerlerin eğriyi yukarı çektiği gama değerleri pow(x,log(b)/log(0,5))
uk: float bias(float x, float g) Варіація гамми, де параметр керування має значення від 0 до 1 зі значеннями, меншими за 0.5, які піднімають криву, і значеннями, більшими за 0.5, які опускають криву. Визначається як pow(x, log(b)/log(0.5)).
zh_cn: float bias(float x, float g) Gamma 变量 数值小于 0.5 时拉低曲线，大于 0.5 时拉高曲线 pow(x,log(b)/log(0.5))
zh_tw: float bias(float x, float g) gamma 的變異：低於 0.5 的值會將曲線下拉， 而高於 0.5 的值會將曲線上推 pow(x,log(b)/log(0.5))

# builtin|
source: float contrast(float x, float c) Adjust the contrast.&nbsp; For c from 0 to 0.5, the contrast is decreased.&nbsp; For c &gt; 0.5, the contrast is increased.
ar: float contrast(float x, float c) اضبط التباين. لـ c من 0 إلى 0.5، ينخفض التباين. لـ c &gt; 0.5، يزداد التباين.
ca: float contrast(float x,float c) Ajusta el contrast:&nbsp; Per a «c» des de 0 fins a 0,5, redueix el contrast.&nbsp; Per a «c» &gt; 0,5, augmenta el contrast.
eo: float contrast(float x, float c) Alĝustigi la kontraston.&nbsp; Por c de 0 ĝis 0.5, la kontrasto estas malpliigita.&nbsp; Por c &gt; 0.5, la kontrasto estas pliigita.
es: float contrast(float x, float c) Ajustar el contraste.&nbsp; Para c de 0 a 0.5, se disminuye el contraste.&nbsp; Para c &gt; 0.5, se aumenta el contraste.
fr: float contrast (float x, float c) Ajuste le contrast. Pour c allant de 0 à 0.5, le contraste et diminué. Pour c supérieur à 0.5, le contraste est augmenté.
he: float contrast(float x, float c) כיוון הניגודיות.&nbsp; עבור c מ־0 עד 0.5, הניגודיות מופחתת.&nbsp; עבור c &gt; 0.5, הניגודיות מוגברת.
it: float contrast(float x,float c) Regola il contrasto. &nbsp; Per c tra 0 e 0,5, il contrasto è ridotto.&nbsp; Per c &gt; 0,5, il contrasto è aumentato.
nl: float contrast(float x, float c) Contrast aanpassen.&nbsp; Bij c van 0 tot 0.5 neemt het contrast af .&nbsp; Bij c &gt; 0.5 neemt het contrast toe.
pl: float contrast(float x, float c) Dostosuje kontrast.&nbsp; Dla "c" od 0 do 0,5, kontrast jest zmniejszany.&nbsp; Dla "c" > 0,5, kontrast jest zwiększany.
pt_br: float contrast(float x, float c) Ajusta o contraste.&nbsp; Para c de 0 a 0.5, o contraste é diminuído.&nbsp; Para c &gt; 0.5, o contraste é aumentado.
sl: float contrast(float x, float c) Prilagodi kontrast.&nbsp; Za c od 0 do 0,5, je kontrast zmanjšan.&nbsp; Za c &gt; 0,5, je kontrast povečan.
sv: float contrast(float x,float c) Justerar kontrasten.&nbsp; För c från 0 till 0,5, minskas kontrasten.&nbsp; För c &gt; 0,5, ökas kontrasten.
tr: float contrast(float x, float c) Karşıtlığı ayarla.&nbsp; c'nin 0'dan 0,5'e kadar olduğu durumlarda karşıtlık azalır.&nbsp; c &gt; 0,5 iken karşıtlık artar.
uk: float contrast(float x,float c) Скоригувати контрастність. Для c у діапазоні від 0 до 0.5 контрастність зменшуватиметься. Для c &gt; 0.5 контрастність збільшуватиметься.
zh_cn: float contrast(float x, float c) Adjust the contrast.&nbsp; For c from 0 to 0.5, the contrast is decreased.&nbsp; For c &gt; 0.5, the contrast is increased. 调整对比度。c 在 0 到 0.5 之间时，对比度将下降。c 大于 0.5 时，对比度将提高
zh_tw: float contrast(float x,float c) 對比度調整。0 至 0.5 之間的 c 值會調低對比度，而大於 0.5 的 c 值會調高對比度。

# builtin|
source: float boxstep(float x,float a) if x < a then 0 otherwise 1
ar: float boxstep(float x,float a) إذا كانت x < a فـ 0 وإلا فـ 1
ca: float boxstep(float x,float a) Si «x» és < que a, serà 0, en cas contrari 1
eo: float boxstep(float x,float a) se x < a tiam 0 alie 1
es: float boxstep(float x,float a) si x < a entonces 0 en caso contrario 1
fr: float boxstep (float x,float a) si x est strictement plus petit que y alors 0 sinon 1
he: float boxstep(float x,float a) אם x < a אז 0 אחרת 1
it: float boxstep(float x,float a) se x < a allora 0 altrimenti 1
nl: float boxstep(float x,float a) als x < a dan 0 en anders 1
pl: float boxstep(float x,float a) jeśli x < a to 0 w przeciwnym przypadku 1
pt_br: float boxstep(float x,float a) se x < a então 0, caso contrário 1
sl: float boxstep(float x,float a) če x < a potem 0 sicer 1
sv: float boxstep(float x,float a) om x < a är resultatet 0 annars 1
tr: float boxstep(float x,float a) x < a ise 0 yoksa 1
uk: float boxstep(float x,float a) якщо x < a, то 0, інакше — 1
zh_cn: float boxstep(float x,float a) 当 x &lt; a 时为 0，否则为 1
zh_tw: float boxstep(float x,float a) 如 x < a 則傳回 0，否則傳回 1

# builtin|
source: float linearstep(float x, float a, float b) if x &lt; a then 0, if x &gt; b then 1, and x transitions linearly when a &lt; x &lt; b
ar: float linearstep(float x, float a, float b) إذا كانت x &lt; a فـ 0، وإذا كانت x &gt; b فـ 1، و x تنتقل خطيًا عندما a &lt; x &lt; b
ca: float linearstep(float x, float a, float b) Si «x» &lt; «a» serà 0, si «x» &gt; «b» serà 1, i «x» canviarà linealment quan &lt; «x» &lt; «b»
eo: float linearstep(float x, float a, float b) se x &lt; a tiam 0, se x &gt; b tiam 1, kaj x transiras linie kiam a &lt; x &lt; b
es: float linearstep(float x, float a, float b) si x &lt; a entonces 0, si x &gt; b entonces 1, y x se convierte linealmente cuando a &lt; x &lt; b
fr: float linearstep (float x, float a, float b) Si x &lt; a alors 0, si x &gt; b alors 1 et x est extrapolé linéairement quand &lt; x &lt; b
he: float linearstep(float x, float a, float b) אם x &lt; a אז 0, אם x &gt; b אז 1, ו־x מתחלף באופן קווי כאשר a &lt; x &lt; b
it: float linearstep(float x,float a,float b) se x &lt; a allora 0, se x &gt; b allora 1, e x passa linearmente quando a &lt; x &lt; b
nl: float linearstep(float x, float a, float b) als x &lt; a dan 0, als x &gt; b dan 1, en x verloopt lineair als a &lt; x &lt; b
pl: float linearstep(float x, float a, float b) jeśli x &lt; a to 0, jeśli x &gt; b to 1 oraz x przechodzi liniowo, gdy a &lt; x &lt; b
pt_br: float linearstep(float x,float a,float b) se x &lt; a então 0, se x &gt; b então 1 e x transita linearmente quando a &lt; x &lt; b
sl: float linearstep(float x, float a, float b) če x &lt; a potem 0, če x &gt; b potem 1, in x linearno prehaja ko &lt; x &lt; b
sv: float linearstep(float x,float a,float b) om x &lt; a är resultatet 0, om x &gt; b är det 1, och x ändras linjärt när &lt; x &lt; b
tr: float linearstep(float x, float a, float b) x &lt; a ise 0, x &gt; b ise 1 ve a &lt; x &lt; b iken x doğrusal olarak geçiş yapar
uk: float linearstep(float x,float a,float b) якщо x &lt; a, то 0, якщо x &gt; b, то 1, і значення лінійно переходить у проміжку a &lt; x &lt; b
zh_cn: float linearstep(float x, float a, float b) 当 x &lt; a 时为 0，当 x &gt; b 时为 1 当 a &lt; x &lt; b 时，x 在该范围线性过渡
zh_tw: float linearstep(float x,float a,float b) 如 x &lt; a 則傳回 0，如 x &gt; b 則傳回 1， 如 a &lt; x &lt; b 則為 x 作線性過渡

# builtin|
source: float smoothstep(float x,float a,float b) if x &lt; a then 0, if x &gt; b then 1, and x transitions smoothly (cubic) when a &lt; x &lt; b
ar: float smoothstep(float x,float a,float b) إذا كانت x &lt; a فـ 0، وإذا كانت x &gt; b فـ 1، و x تنتقل بسلاسة (تكعيبي) عندما a &lt; x &lt; b
ca: float smoothstep(float x,float a,float b) Si «x» &lt; «a» serà 0, si «x» &gt; «b» serà 1, i «x» canviarà suaument (cúbica) quan &lt; «x» &lt; «b»
eo: float smoothstep(float x,float a,float b) se x &lt; a tiam 0, se x &gt; b tiam 1, kaj x transiras glate (kuba) kiam a &lt; x &lt; b
es: float smoothstep(float x,float a,float b) si x &lt; a entonces 0, si x &gt; b entonces 1, y x se convierte suavemente (de forma cúbica) cuando a &lt; x &lt; b
fr: float smoothstep (float x, float a, float b) Si x &lt; a alors 0, si x &gt; b alors 1, et x extrapolé doucement (cubique) quand &lt; x &lt; b
he: float smoothstep(float x,float a,float b) אם x &lt; a אז 0, אם x &gt; b אז 1, ו־x מתחלף באופן חלק (קובייתי) a &lt; x &lt; b
it: float smoothstep(float x,float a,float b) se x &lt; a allora 0, se x &gt; b allora 1, e x passa gradualmente (cubica) quando a &lt; x &lt; b
nl: float smoothstep(float x,float a,float b) als x &lt; a dan 0, als x &gt; b dan 1, en x verloopt vloeiend (kubisch) als a &lt; x &lt; b
pl: float smoothstep(float x,float a,float b) jeśli x &lt; a to 0, jeśli x &gt; b to 1 oraz x przechodzi gładko (sześciennie), gdy a &lt; x &lt; b
pt_br: float smoothstep(float x,float a,float b) se x &lt; a então 0, se x &gt; b então 1 e x transita suavemente (cúbico) quando a &lt; x &lt; b
sl: float smoothstep(float x,float a,float b) če x &lt; a potem 0, če x &gt; b potem 1, in x gladko (kubično) prehaja ko a &lt; x &lt; b
sv: float smoothstep(float x,float a,float b) om x &lt; a är resultatet 0, om x &gt; b är det 1, och x ändras jämnt (kubiskt) när a &lt; x &lt; b
tr: float smoothstep(float x,float a,float b) x &lt; a ise 0, x &gt; b ise 1 ve a &lt; x &lt; b iken x pürüzsüzce geçiş yapar (kübik)
uk: float smoothstep(float x,float a,float b) якщо x &lt; a, то 0, якщо x &gt; b, то 1, і значення плавно переходить (за кубічною параболою) у проміжку a &lt; x &lt; b
zh_cn: float smoothstep(float x,float a,float b) 当 x &lt; a 时为 0，当 x &gt; b 时为 1 当 a &lt; x &lt; b 时，x 在该范围平滑过渡 (双立方插值)
zh_tw: float smoothstep(float x,float a,float b) 如 x &lt; a 則傳回 0，如 x &gt; b 則傳回 1， 如 a &lt; x &lt; b 則為 x 作平滑過渡 (cubic)

# builtin|
source: float gasussstep(float x,float a,float b) if x &lt; a then 0, if x &gt; b then 1, and x transitions smoothly (exponentially) when a &lt; x &lt; b
ar: float gasussstep(float x,float a,float b) إذا كانت x &lt; a فـ 0، وإذا كانت x &gt; b فـ 1، و x تنتقل بسلاسة (أسِّي) عندما a &lt; x &lt; b
ca: float gasussstep(float x,float a,float b) Si «x» &lt; «a» serà 0, si «x» &gt; «b» serà 1, i «x» canviarà suaument (exponencialment) quan &lt; «x» &lt; «b»
eo: float gasussstep(float x,float a,float b) se x &lt; a tiam 0, se x &gt; b tiam 1, kaj x transiras glate (eksponente) kiam a &lt; x &lt; b
es: float gasussstep(float x,float a,float b) si x &lt; a entonces 0, si x &gt; b entonces 1, y x se convierte suavemente (de forma exponencial) cuando a &lt; x &lt; b
fr: float gasussstep (float x, float a, float b) si x &lt; a alors 0, si x &gt; b alors 1, et x est extrapolé doucement (exponentiellement) quand a &lt; x &lt; b
he: float gasussstep(float x,float a,float b) אם x &lt; a אז 0, אם x &gt; b אז 1, ו־x מתחלף באופן חלק (מעריכית) כאשר a &lt; x &lt; b
it: float gasussstep(float x,float a,float b) se x &lt; a allora 0, se x &gt; b allora 1, e x passa in modo graduale (esponenzialmente) quando a &lt; x &lt; b
nl: float gaussstep(float x,float a,float b) als x &lt; a dan 0, als x &gt; b dan 1, en x verloopt vloeiend (exponentieel) als a &lt; x &lt; b
pl: float gasussstep(float x,float a,float b) jeśli x &lt; a to 0, jeśli x &gt; b to 1 oraz x przechodzi gładko (wykładniczo), gdy a &lt; x &lt; b
pt_br: float gasussstep(float x,float a,float b) se x &lt; a então 0, se x &gt; b então 1 e x transita suavemente (exponencialmente) quando a &lt; x &lt; b
sl: float gasussstep(float x,float a,float b) če x &lt; a potem 0, če x &gt; b potem 1, in x gladko (eksponentno) prehaja, ko a &lt; x &lt; b
sv: float gasussstep(float x,float a,float b) om x &lt; a är resultatet 0, om x &gt; b är det 1, och x ändras jämnt (exponentiellt) när a &lt; x &lt; b
tr: float gasussstep(float x,float a,float b) x &lt; a ise 0, x &gt; b ise 1 ve a &lt; x &lt; b iken x pürüzsüzce geçiş yapar (üssel)
uk: float gasussstep(float x,float a,float b) якщо x &lt; a, то 0, якщо x &gt; b, то 1, і значення плавно переходить (за експонентою) у проміжку a &lt; x &lt; b
zh_cn: float gasussstep(float x,float a,float b) 当 x &lt; a 时为 0，当 x &gt; b 时为 1 当 a &lt; x &lt; b 时，x 在该范围平滑过渡 (高斯指数插值)
zh_tw: float gasussstep(float x,float a,float b) 如 x &lt; a 則傳回 0，如 x &gt; b 則傳回 1， 如 a &lt; x &lt; b 則為 x 作平滑過渡 (exponentially)

# builtin|
source: remap(float x, float source, float range, float falloff, float interp) General remapping function. When x is within +/- <i>range</i> of source, the result is one. The result falls to zero beyond that range over <i>falloff</i> distance. The falloff shape is controlled by <i>interp</i>. Numeric values or named constants may be used: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
ar: remap(float x, float source, float range, float falloff, float interp) دالة إعادة رسم عامة. عندما تكون x ضمن +/- <i>range</i> من source، تكون النتيجة واحدًا. تنخفض النتيجة إلى الصفر بعد هذا النطاق على مسافة <i>falloff</i>. يتحكم <i>interp</i> في شكل الانخفاض. قد تُستخدَم القيم العددية أو الثوابت المسماة: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
ca: remap(float x, float source, float range, float falloff, float interp) Funció de reassignació general. Quan «x» es troba dins de l'interval (<i>range</i>) +/- de la font, el resultat és u. El resultat caurà a zero més enllà d'aquest interval sobre la distància de caiguda (<i>falloff</i>). La forma de la caiguda està controlada per <i>interp</i>. Es poden usar valors numèrics o constants amb nom: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
eo: remap(float x, float fonto, float intervalo, float falo, float interp) Ĝenerala remapfunkcio. Kiam x estas ene de +/- <i>intervalo</i> de fonto, la rezulto estas unu. La rezulto falas al nulo preter tiu intervalo super <i>fala</i> distanco. La falformo estas regata de <i>interp</i>. Nombraj valoroj ek nomitaj konstantoj povas esti uzataj: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linia</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>glata</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaŭsa</b> = 2
es: remap(float x, float origen, float intervado, float caída, float interp) Función de remapeo general. Cuando x está dentro de +/- <i>intervalo</i> de <i>origen</i>, el resultado es uno. El resultado cae a cero más allá de este intervalo, sobre la distancia de <i>caída</i>. La forma de la caída se controla con <i>interp</i>. Se pueden usar valores numéricos o constantes con nombre: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
fr: remap (float x, float source, float range, float falloff, float interp) Fonction générale de ré-association. Quand x est dans +/- <i>range</i> de source, le résultat est 1. Le résultat passe à zéro sous cette intervalle au dessus de la distance <i>falloff</i>. La condition falloff est contrôlé par <i>interp</i>. Les valeurs numériques ou les constantes nommées peuvent être utilisées : &nbsp;&nbsp;&nbsp;&nbsp;int <b>linéaire</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>doux</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussien</b> = 2
it: remap(float x, float source, float range, float falloff, float interp) Funzione di ri-mappatura generale. Quando x è all'interno di +/- il<i>range</i> della sorgente, il risultato è uno. Il risultato scende a zero oltre tale intervallo sulla distanza di <i>falloff</i>. La forma del decadimento è controllata da <i>interp</i>. Valori numerici o costanti con nome possono essere utilizzati: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
nl: remap(float x, float bron, float bereik, float afval, float interp) Algemene functie voor afbeelden. Wanneer x +/- binnen het <i>bereik</i> is van bron, is het antwoord een. Het resultaat wordt nul op meer dan <i>afval</i> buiten bereik. De vorm van afval wordt geregeld met <i>interp</i>. U kunt getallen gebruiken of constanten met een waarde: &nbsp;&nbsp;&nbsp;&nbsp;int <b>lineair</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>glad</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussisch</b> = 2
pl: remap(float x, float źródło, float zakres, float spadek, float interp) Ogólna funkcja ponownie mapująca. Gdy x jest w <i>zakres</i> +/- źródła, to wynik jest równy jeden. Wynik spada do zera poza tym zakresem w odległości <i>spadek</i>. Kształt spadku jest określany przez <i>interp</i>. Można używać wartości numerycznych lub nazwanych stałych: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linowy</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>wygładzony</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gausa</b> = 2
pt_br: remap(float x, float source, float range, float falloff, float interp) Função de remapeamento geral. Quando x está dentro de +/- <i>range</i> de <i>source</i>, o resultado é 1. O resultado cai para zero na distância <i>falloff</i> além do intervalo <i>range</i>. A forma de queda é controlada por <i>interp</i>. Valores numéricos ou constantes nomeadas podem ser usadas: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
sl: remap(float x, float source, float range, float falloff, float interp) Splošna funkcija preslikave. Ko je x znotraj +/- <i>obsega</i> vira, je rezultat ena. Rezultat pade na nič preko tega obsega na razdalji <i>padanja</i>. Obliko padanja nadzira <i>interp</i>. Številske vrednosti lahko se uporabijo konstante z imenom: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
sv: remap(float x, float source, float range, float falloff, float interp) Allmän avbildningsfunktion. När x är inom +/- <i>range</i> av source, är resultatet ett. Resultat minskar till noll bortom intervallet över avståndet <i>falloff</i>. Minskningens form bestäms av <i>interp</i>. Numeriska värden eller namngivna konstanter kan användas: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
tr: remap(float x, float kaynak, float erim, float düşme, float aradeğerlenen) Genel yeniden eşlemleme işlevi. x, kaynağın +/- <i>erimi</i> içindeyse, sonuç 1'dir. Sonuç, <i>düşme</i> uzaklığı boyunca bu erimin ötesinde sıfıra düşer. Düşme şekli, <i>aradeğerlenen</i> tarafından denetlenir. Sayısal değerler veya adlı sabitler kullanılabilir: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
uk: remap(float x, float source, float range, float falloff, float interp) Загальна функція відображення. Якщо x перебуває у діапазоні джерела ±<i>range</i>, результатом буде одиниця. Результат спадає до нуля за межами діапазону на відстані <i>falloff</i>. Форма спадання контролюється параметром <i>interp</i>. Можна використовувати числові значення або іменовані сталі: &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
zh_cn: remap(float x, float source, float range, float falloff, float interp) 常规重映射函数 当 x 在源数据的 +/- <i>range</i> 范围内时，结果为 1 当超出 <i>falloff</i> 距离时数值降为 0 falloff shape (滚降形状) 由 <i>interp</i> 进行控制 该参数可以通过数字或者具名常量调用： &nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
zh_tw: remap(float x, float source, float range, float falloff, float interp) 泛用的數值映射函數。 當 x 位於 source +/- <i>range</i> 的範圍內，結果為 1。 在範圍以外將會在 <i>falloff</i> 距離中下降到 0。 下降形狀由 <i>interp</i> 控制。可使用下列的列舉數值或 命名常數字串：&nbsp;&nbsp;&nbsp;&nbsp;int <b>linear</b> = 0 &nbsp;&nbsp;&nbsp;&nbsp;int <b>smooth</b> = 1 &nbsp;&nbsp;&nbsp;&nbsp;int <b>gaussian</b> = 2
